import 'package:flutter/material.dart';
import 'package:google_fonts/google_fonts.dart';
import 'package:scrollable_positioned_list/scrollable_positioned_list.dart';
import 'package:siddur/tools/hebrewcalendar/jewish_calendar.dart';
import 'package:siddur/tools/hebrewcalendar/jewish_date.dart';
import 'package:siddur/ui-elements/song_of_the_day_widget.dart';

import 'CustomDrawer.dart';

class MorningPragerPage extends StatefulWidget {
  @override
  _MorningPragerPageState createState() => _MorningPragerPageState();
}

class _MorningPragerPageState extends State<MorningPragerPage> {
  ItemScrollController itemScrollController;
  final ItemPositionsListener itemPositionsListener =
      ItemPositionsListener.create();

  // TODO: Implement pinch to zoom
  double _scaleFactor = 1.0;
  double _baseScaleFactor = 1.0;

  final TODAY = DateTime.now();
  final JEWISH_DATE_TODAY = JewishCalendar.fromDateTime(DateTime.now());
  final IS_TAANITH = JewishCalendar.fromDateTime(DateTime.now()).isTaanis();
  final IS_TEN_DAYS = JewishCalendar.fromDateTime(DateTime.now()).isTenDays();
  final IS_TACHANUN = JewishCalendar.fromDateTime(DateTime.now()).isTachanun();
  final IS_HALLEL = JewishCalendar.fromDateTime(DateTime.now()).isHallel();
  final IS_MONDAY_OR_TUESDAY = (DateTime.now().weekday == DateTime.monday ||
          DateTime.now().weekday == DateTime.thursday)
      ? true
      : false;

  int _scrollIndex = 0;

  final List<Widget> morningPrayers = [
    // Morning Prayers
    Column(
      children: [
        Padding(
          padding: const EdgeInsets.all(8.0),
          child: Text(
            "מַה טּבוּ אהָלֶיךָ יַעֲקב מִשְׁכְּנתֶיךָ יִשְׂרָאֵל. וַאֲנִי בְּרב חַסְדְּךָ אָבא בֵיתֶךָ אֶשְׁתַּחֲוֶה אֶל הֵיכַל קָדְשְׁךָ בְּיִרְאָתֶךָ. ה\' אָהַבְתִּי מְעון בֵּיתֶךָ וּמְקום מִשְׁכַּן כְּבודֶךָ. וַאֲנִי אֶשְׁתַּחֲוֶה וְאֶכְרָעָה אֶבְרְכָה לִפְנֵי ה\' עשִׂי. וַאֲנִי תְפִלָתִי לְךָ ה\' עֵת רָצון אֱלהִים בְּרָב חַסְדֶּךָ עֲנֵנִי בֶּאֱמֶת יִשְׁעֶךָ.",
            textAlign: TextAlign.justify,
            textDirection: TextDirection.rtl,
            style: GoogleFonts.suezOne(fontSize: 24),
          ),
        ),
        Padding(
          padding: const EdgeInsets.all(8.0),
          child: Text(
            "אֲדון עולָם אֲשֶׁר מָלַךְ. בְּטֶרֶם כָּל יְצִיר נִבְרָא: לְעֵת נַעֲשה בְחֶפְצו כּל. אֲזַי מֶלֶךְ שְׁמו נִקְרָא: וְאַחֲרֵי כִּכְלות הַכּל. לְבַדּו יִמְלךְ נורָא: וְהוּא הָיָה וְהוּא הוֶה. וְהוּא יִהְיֶה בְּתִפְאָרָה: וְהוּא אֶחָד וְאֵין שֵׁנִי. לְהַמְשִׁיל לו לְהַחְבִּירָה: בְּלִי רֵאשִׁית בְּלִי תַכְלִית. וְלו הָעז וְהַמִּשרָה: וְהוּא אֵלִי וְחַי גואֲלִי. וְצוּר חֶבְלִי בְּעֵת צָרָה: וְהוּא נִסִּי וּמָנוס לִי. מְנָת כּוסִי בְּיום אֶקְרָא: בְּיָדו אַפְקִיד רוּחִי. בְּעֵת אִישָׁן וְאָעִירָה: וְעִם רוּחִי גְּוִיָּתִי. ה\' לִי וְלא אִירָא:",
            textAlign: TextAlign.justify,
            textDirection: TextDirection.rtl,
            style: GoogleFonts.suezOne(fontSize: 24),
          ),
        ),
        Padding(
          padding: const EdgeInsets.all(8.0),
          child: Text(
            "בָּרוּךְ אַתָּה ה\' אֱלהֵינוּ מֶלֶךְ הָעולָם אֲשֶׁר קִדְּשָׁנוּ בְּמִצְותָיו וְצִוָּנוּ עַל נְטִילַת יָדַיִם:",
            textAlign: TextAlign.justify,
            textDirection: TextDirection.rtl,
            style: GoogleFonts.suezOne(fontSize: 24),
          ),
        ),
        Padding(
          padding: const EdgeInsets.all(8.0),
          child: Text(
            "בָּרוּךְ אַתָּה ה\' אֱלהֵינוּ מֶלֶךְ הָעולָם אֲשֶׁר יָצַר אֶת הָאָדָם בְּחָכְמָה וּבָרָא בו נְקָבִים נְקָבִים חֲלוּלִים חֲלוּלִים. גָּלוּי וְיָדוּעַ לִפְנֵי כִסֵּא כְבודֶךָ שֶׁאִם יִפָּתֵחַ אֶחָד מֵהֶם או יִסָּתֵם אֶחָד מֵהֶם אִי אֶפְשַׁר לְהִתְקַיֵּם וְלַעֲמוד לְפָנֶיךָ אֲפִילוּ שָׁעָה אֶחָת: בָּרוּךְ אַתָּה ה\' רופֵא כָל בָּשר וּמַפְלִיא לַעֲשות:",
            textAlign: TextAlign.justify,
            textDirection: TextDirection.rtl,
            style: GoogleFonts.suezOne(fontSize: 24),
          ),
        ),
        Padding(
          padding: const EdgeInsets.all(8.0),
          child: Text(
            "אֱלהַי. נְשָׁמָה שֶׁנָּתַתָּ בִּי טְהורָה הִיא. אַתָּה בְרָאתָהּ. אַתָּה יְצַרְתָּהּ. אַתָּה נְפַחְתָּהּ בִּי. וְאַתָּה מְשַׁמְּרָהּ בְּקִרְבִּי. וְאַתָּה עָתִיד לִטְּלָהּ מִמֶּנִּי. וּלְהַחֲזִירָהּ בִּי לֶעָתִיד לָבוא. כָּל זְמַן שֶׁהַנְּשָׁמָה בְּקִרְבִּי מודֶה אֲנִי לְפָנֶיךָ ה\' אֱלהַי וֵאלהֵי אֲבותַי. רִבּון כָּל הַמַּעֲשים אֲדון כָּל הַנְּשָׁמות: בָּרוּךְ אַתָּה ה\' הַמַּחֲזִיר נְשָׁמות לִפְגָרִים מֵתִים:",
            textAlign: TextAlign.justify,
            textDirection: TextDirection.rtl,
            style: GoogleFonts.suezOne(fontSize: 24),
          ),
        ),
        Padding(
          padding: const EdgeInsets.all(8.0),
          child: Text(
            "בָּרוּךְ אַתָּה ה\' אֱלהֵינוּ מֶלֶךְ הָעולָם, אֲשֶׁר נָתַן לַשּכְוִי בִינָה לְהַבְחִין בֵּין יום וּבֵין לָיְלָה.\nבָּרוּךְ אַתָּה ה\' אֱלהֵינוּ מֶלֶךְ הָעולָם, שֶׁלּא עָשנִי גּוי.\nבָּרוּךְ אַתָּה ה\' אֱלהֵינוּ מֶלֶךְ הָעולָם, שֶׁלּא עָשנִי עָבֶד.\nבָּרוּךְ אַתָּה ה\' אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, גברים אומרים: שֶׁלֹּא עָשַׂנִי אשָּׁה.\nבָּרוּךְ אַתָּה ה\' אֱלהֵינוּ מֶלֶךְ הָעולָם, מַלְבִּישׁ עֲרֻמִּים.\nבָּרוּךְ אַתָּה ה\' אֱלהֵינוּ מֶלֶךְ הָעולָם, פּוקֵחַ עִוְרִים.\nבָּרוּךְ אַתָּה ה\' אֱלהֵינוּ מֶלֶךְ הָעולָם, מַתִּיר אֲסוּרִים.\nבָּרוּךְ אַתָּה ה\' אֱלהֵינוּ מֶלֶךְ הָעולָם, זוקֵף כְּפוּפִים.\nבָּרוּךְ אַתָּה ה\' אֱלהֵינוּ מֶלֶךְ הָעולָם, רוקַע הָאָרֶץ עַל הַמָּיִם.\n בָּרוּךְ אַתָּה ה\' אֱלהֵינוּ מֶלֶךְ הָעולָם, שֶׁעָשה לִּי כָּל צָרְכִּי.\nבָּרוּךְ אַתָּה ה\' אֱלהֵינוּ מֶלֶךְ הָעולָם, הַמֵּכִין מִצְעֲדֵי גָבֶר.\nבָּרוּךְ אַתָּה ה\' אֱלהֵינוּ מֶלֶךְ הָעולָם, אוזֵר יִשרָאֵל בִּגְבוּרָה.\nבָּרוּךְ אַתָּה ה\' אֱלהֵינוּ מֶלֶךְ הָעולָם, עוטֵר יִשרָאֵל בְּתִפְאָרָה.\nבָּרוּךְ אַתָּה ה\' אֱלהֵינוּ מֶלֶךְ הָעולָם, הַנּותֵן לַיָּעֵף כּחַ.\nבָּרוּךְ אַתָּה ה\' אֱלהֵינוּ מֶלֶךְ הָעולָם, הַמַּעֲבִיר שֵׁנָה מֵעֵינַי וּתְנוּמָה מֵעַפְעַפָּי.\n",
            textAlign: TextAlign.justify,
            textDirection: TextDirection.rtl,
            style: GoogleFonts.suezOne(fontSize: 24),
          ),
        ),
        Padding(
          padding: const EdgeInsets.all(8.0),
          child: Text(
            "וִיהִי רָצון מִלְּפָנֶיךָ ה\' אֱלהֵינוּ וֵאלהֵי אֲבותֵינוּ שֶׁתַּרְגִּילֵנוּ בְּתורָתֶךָ. וְדַבְּקֵנוּ בְּמִצְותֶיךָ. וְאַל תְּבִיאֵנוּ לא לִידֵי חֵטְא. וְלא לִידֵי עֲבֵרָה וְעָון. וְלא לִידֵי נִסָּיון. וְלא לִידֵי בִזָּיון. וְאַל תַּשְׁלֶט בָּנוּ יֵצֶר הָרָע. וְהַרְחִיקֵנוּ מֵאָדָם רָע וּמֵחָבֵר רָע. וְדַבְּקֵנוּ בְּיֵצֶר הַטוב וּבְמַעֲשים טובִים. וְכף אֶת יִצְרֵנוּ לְהִשְׁתַּעְבֶּד לָךְ. וּתְנֵנוּ הַיּום וּבְכָל יום לְחֵן וּלְחֶסֶד וּלְרַחֲמִים בְּעֵינֶיךָ וּבְעֵינֵי כָל רואֵינוּ. וְתִגְמְלֵנוּ חֲסָדִים טובִים. בָּרוּךְ אַתָּה ה\' הַגּומֵל חֲסָדִים טובִים לְעַמּו יִשרָאֵל.",
            textAlign: TextAlign.justify,
            textDirection: TextDirection.rtl,
            style: GoogleFonts.suezOne(fontSize: 24),
          ),
        ),
        Padding(
          padding: const EdgeInsets.all(8.0),
          child: Text(
            "יְהִי רָצון מִלְּפָנֶיךָ ה\' אֱלהַי וֵאלהֵי אֲבותַי שֶׁתַּצִּילֵנִי הַיּום וּבְכָל יום מֵעַזֵּי פָנִים וּמֵעַזּוּת פָּנִים. מֵאָדָם רָע. וּמֵחָבֵר רָע. וּמִשָּׁכֵן רָע. וּמִפֶּגַע רָע. וּמִשּטָן הַמַּשְׁחִית. מִדִּין קָשֶׁה וּמִבַּעַל דִּין קָשֶׁה. בֵּין שֶׁהוּא בֶן בְּרִית וּבֵין שֶׁאֵינו בֶן בְּרִית.",
            textAlign: TextAlign.justify,
            textDirection: TextDirection.rtl,
            style: GoogleFonts.suezOne(fontSize: 24),
          ),
        ),
        Padding(
          padding: const EdgeInsets.all(8.0),
          child: Text(
            "לְעולָם יְהֵא אָדָם יְרֵא שָׁמַיִם בְּסֵּתֶר וּמודֶה עַל הָאֱמֶת וְדובֵר אֱמֶת בִּלְבָבו וְיַשְׁכֵּם וְיאמַר,",
            textAlign: TextAlign.justify,
            textDirection: TextDirection.rtl,
            style: GoogleFonts.suezOne(fontSize: 24),
          ),
        ),
        Padding(
          padding: const EdgeInsets.all(8.0),
          child: Text(
            "רִבּון כָּל הָעולָמִים לא עַל צִדְקותֵינוּ אֲנַחְנוּ מַפִּילִים תַּחֲנוּנֵינוּ לְפָנֶיךָ כִּי עַל רַחֲמֶיךָ הָרַבִּים. מָה אֲנַחְנוּ מֶה חַיֵּינוּ מֶה חַסְדֵּנוּ מַה צִּדְקֵנוּ מַה יְשְׁעֵנוּ מַה כּחֵנוּ מַה גְּבוּרָתֵנוּ. מַה נּאמַר לְפָנֶיךָ ה\' אֱלהֵינוּ וֵאלהֵי אֲבותֵינוּ הֲלא כָל הַגִּבּורִים כְּאַיִן לְפָנֶיךָ וְאַנְשֵׁי הַשֵּׁם כְּלא הָיוּ וַחֲכָמִים כִּבְלִי מַדָּע וּנְבונִים כִּבְלִי הַשכֵּל כִּי רב מַעֲשיהֶם תּהוּ וִימֵי חַיֵּיהֶם הֶבֶל לְפָנֶיךָ. וּמותַר הָאָדָם מִן הַבְּהֵמָה אָיִן כִּי הַכּל הָבֶל.",
            textAlign: TextAlign.justify,
            textDirection: TextDirection.rtl,
            style: GoogleFonts.suezOne(fontSize: 24),
          ),
        ),
        Padding(
          padding: const EdgeInsets.all(8.0),
          child: Text(
            "אֲבָל אֲנַחְנוּ עַמְּךָ בְּנֵי בְרִיתֶךָ. בְּנֵי אַבְרָהָם אהַבְךָ שֶׁנִּשְׁבַּעְתָּ לּו בְּהַר הַמּורִיָּה. זֶרַע יִצְחָק יְחִידו. שֶׁנֶּעֱקַד עַל גַּבֵּי הַמִּזְבֵּחַ. עֲדַת יַעֲקב בִּנְךָ בְּכורֶךָ. שֶׁמֵּאַהֲבָתְךָ שֶׁאָהַבְתָּ אותו וּמִשּמְחָתְךָ שֶׁשּמַחְתָּ בּו. קָרָאתָ אֶת שְׁמו יִשרָאֵל וִישֻׁרוּן.",
            textAlign: TextAlign.justify,
            textDirection: TextDirection.rtl,
            style: GoogleFonts.suezOne(fontSize: 24),
          ),
        ),
        Padding(
          padding: const EdgeInsets.all(8.0),
          child: Text(
            "לְפִיכָךְ אֲנַחְנוּ חַיָּבִים לְהודות לְךָ וּלְשַׁבֵּחֲךָ וּלְפָאֶרְךָ וּלְבָרֵךְ וּלְקַדֵּשׁ וְלָתֵת שֶׁבַח וְהודָיָה לִשְׁמֶךָ. אַשְׁרֵינוּ מַה טּוב חֶלְקֵנוּ וּמַה נָּעִים גּורָלֵנוּ וּמַה יָּפָה יְרֻשָּׁתֵנוּ. אַשְׁרֵינוּ שֶׁאֲנַחְנוּ מַשְׁכִּימִים וּמַעֲרִיבִים עֶרֶב וָבקֶר וְאומְרִים פַּעֲמַיִם בְּכָל יום,",
            textAlign: TextAlign.justify,
            textDirection: TextDirection.rtl,
            style: GoogleFonts.suezOne(fontSize: 24),
          ),
        ),
        Padding(
          padding: const EdgeInsets.all(8.0),
          child: Text(
            "ה\' אֱלהֵינוּ ה’ אֶחָד",
            textAlign: TextAlign.center,
            textDirection: TextDirection.rtl,
            style: GoogleFonts.suezOne(fontSize: 24),
          ),
        ),
        Padding(
          padding: const EdgeInsets.all(8.0),
          child: Text(
            "אַתָּה הוּא עַד שֶׁלּא נִבְרָא הָעולָם אַתָּה הוּא מִשֶּׁנִּבְרָא הָעולָם. אַתָּה הוּא בָּעולָם הַזֶּה וְאַתָּה הוּא לָעולָם הַבָּא: קַדֵּשׁ אֶת שִׁמְךָ עַל מַקְדִּישֵׁי שְׁמֶךָ וְקַדֵּשׁ אֶת שִׁמְךָ בְּעולָמֶךָ. וּבִישׁוּעָתְךָ תָּרִים וְתַגְבִּיהַּ קַרְנֵנוּ: ברוּךְ אַתָּה ה\', הַמְקַדֵּשׁ אֶת שְׁמו בָּרַבִּים:",
            textAlign: TextAlign.justify,
            textDirection: TextDirection.rtl,
            style: GoogleFonts.suezOne(fontSize: 24),
          ),
        ),
        Padding(
          padding: const EdgeInsets.all(8.0),
          child: Text(
            "אַתָּה הוּא ה\' אֱלהֵינוּ בַּשָּׁמַיִם וּבָאָרֶץ וּבִשְׁמֵי הַשָּׁמַיִם הָעֶלְיונִים. אֱמֶת אַתָּה הוּא רִאשׁון וְאַתָּה הוּא אַחֲרון וּמִבַּלְעָדֶיךָ אֵין אֱלהִים: קַבֵּץ קוֶיךָ מֵאַרְבַּע כַּנְפות הָאָרֶץ. יַכִּירוּ וְיֵדְעוּ כָּל בָּאֵי עולָם כִּי אַתָּה הוּא הָאֱלהִים לְבַדְּךָ לְכל מַמְלְכות הָאָרֶץ: אַתָּה עָשיתָ אֶת הַשָּׁמַיִם וְאֶת הָאָרֶץ אֶת הַיָּם וְאֶת כָּל אֲשֶׁר בָּם וּמִי בְּכָל מַעֲשי יָדֶיךָ בָּעֶלְיונִים או בַתַּחְתּונִים שֶׁיּאמַר לְךָ מַה תַּעֲשה אָבִינוּ שֶׁבַּשָּׁמַיִם עֲשה עִמָּנוּ חֶסֶד בַּעֲבוּר שִׁמְךָ הַגָּדול שֶׁנִּקְרָא עָלֵינוּ. וְקַיֶּם לָנוּ ה\' אֱלהֵינוּ מַה שֶׁכָּתוּב בָּעֵת הַהִיא אָבִיא אֶתְכֶם וּבָעֵת קַבְּצִי אֶתְכֶם. כִּי אֶתֵּן אֶתְכֶם לְשֵׁם וְלִתְהִלָּה בְּכל עַמֵּי הָאָרֶץ. בְּשׁוּבִי אֶת שְׁבוּתֵיכֶם לְעֵינֵיכֶם. אָמַר ה\':",
            textAlign: TextAlign.justify,
            textDirection: TextDirection.rtl,
            style: GoogleFonts.suezOne(fontSize: 24),
          ),
        ),
      ],
    ),
    // Birkoth HaTorah
    Padding(
      padding: const EdgeInsets.all(8.0),
      child: Text(
        "בָּרוּךְ אַתָּה ה\' אֱלהֵינוּ מֶלֶךְ הָעולָם אֲשֶׁר קִדְּשָׁנוּ בְּמִצְותָיו וְצִוָּנוּ לַעֲסוק בְּדִבְרֵי תורָה: וְהַעֲרֶב נָא ה\' אֱלהֵינוּ אֶת דִּבְרֵי תורָתְךָ בְּפִינוּ וּבְפִיּות עַמְּךָ בֵּית יִשרָאֵל. וְנִהְיֶה אֲנַחְנוּ וְצֶאֱצָאֵינוּ צֶאֱצָאֵי עַמְּךָ בֵּית יִשרָאֵל. כֻּלָּנוּ יודְעֵי שְׁמֶךָ וְלומְדֵי תורָתֶךָ לִשְׁמָהּ: בָּרוּךְ אַתָּה ה\' הַמְלַמֵּד תּורָה לְעַמּו יִשרָאֵל: בָּרוּךְ אַתָּה ה\' אֱלהֵינוּ מֶלֶךְ הָעולָם. אֲשֶׁר בָּחַר בָּנוּ מִכָּל הָעַמִּים וְנָתַן לָנוּ אֶת תּורָתו: בָּרוּךְ אַתָּה ה\'. נותֵן הַתּורָה:",
        textAlign: TextAlign.justify,
        textDirection: TextDirection.rtl,
        style: GoogleFonts.suezOne(fontSize: 24),
      ),
    ),
    // Seder HaKorbanoth
    Column(
      children: [
        Padding(
          padding: const EdgeInsets.all(8.0),
          child: Text(
            "וַיְדַבֵּר ה\' אֶל משֶׁה לֵּאמר: צַו אֶת בְּנֵי יִשרָאֵל וְאָמַרְתָּ אֲלֵהֶם. אֶת קָרְבָּנִי לַחְמִי לְאִשַּׁי רֵיחַ נִיחחִי. תִּשְׁמְרוּ לְהַקְרִיב לִי בְּמועֲדו: וְאָמַרְתָּ לָהֶם. זֶה הָאִשֶּׁה אֲשֶׁר תַּקְרִיבוּ לה\'. כְּבָשים בְּנֵי שָׁנָה תְמִימִים. שְׁנַיִם לַיּום עלָה תָמִיד: אֶת הַכֶּבֶש אֶחָד תַּעֲשה בַבּקֶר. וְאֵת הַכֶּבֶש הַשֵּׁנִי תַּעֲשה בֵּין הָעַרְבָּיִם: וַעֲשירִית הָאֵיפָה סלֶת לְמִנְחָה. בְּלוּלָה בְּשֶׁמֶן כָּתִית רְבִיעִת הַהִין: עלַת תָּמִיד הָעֲשיָה בְּהַר סִינַי. לְרֵיחַ נִיחחַ אִשֶּׁה לה\': וְנִסְכּו רְבִיעִת הַהִין לַכֶּבֶש הָאֶחָד. בַּקּדֶשׁ הַסֵּךְ נֶסֶךְ שֵׁכָר לה\': וְאֵת הַכֶּבֶש הַשֵּׁנִי תַּעֲשה בֵּין הָעַרְבָּיִם. כְּמִנְחַת הַבּקֶר וּכְנִסְכּו תַּעֲשה. אִשֵּׁה רֵיחַ נִיחחַ לה\': וְשָׁחַט אתו עַל יֶרֶךְ הַמִּזְבֵּחַ צָפנָה לִפְנֵי ה\'. וְזָרְקוּ בְּנֵי אַהֲרן הַכּהֲנִים אֶת דָּמו עַל הַמִּזְבֵּחַ סָבִיב:\nוְהִפְשִׁיט אֶת־הָעֹלָה וְנִתַּח אֹתָהּ לִנְתָחֶיהָ׃ וְנָתְנוּ בְּנֵי אַהֲרֹן הַכֹּהֵן אֵשׁ עַל־הַמִּזְבֵּחַ וְעָרְכוּ עֵצִים עַל־הָאֵשׁ׃ וְעָרְכוּ בְּנֵי אַהֲרֹן הַכֹּהֲנִים אֵת הַנְּתָחִים אֶת־הָרֹאשׁ וְאֶת־הַפָּדֶר עַל־הָעֵצִים אֲשֶׁר עַל־הָאֵשׁ אֲשֶׁר עַל־הַמִּזְבֵּחַ׃ וְקִרְבּוֹ וּכְרָעָיו יִרְחַץ בַּמָּיִם וְהִקְטִיר הַכֹּהֵן אֶת־הַכֹּל הַמִּזְבֵּחָה עֹלָה אִשֵּׁה רֵיחַ־נִיחוֹחַ לַיהוָה׃",
            textAlign: TextAlign.justify,
            textDirection: TextDirection.rtl,
            style: GoogleFonts.suezOne(fontSize: 24),
          ),
        ),
        Padding(
          padding: const EdgeInsets.all(8.0),
          child: Text(
            "וַיּאמֶר ה\' אֶל משֶׁה קַח לְךָ סַמִּים נָטָף וּשְׁחֵלֶת וְחֶלְבְּנָה סַמִּים וּלְבנָה זַכָּה בַּד בְּבַד יִהְיֶה: וְעָשיתָ אתָהּ קְטרֶת רקַח מַעֲשה רוקֵחַ מְמֻלָּח טָהור קדֶשׁ: וְשָׁחַקְתָּ מִמֶּנָּה הָדֵק וְנָתַתָּה מִמֶּנָּה לִפְנֵי הָעֵדֻת בְּאהֶל מועֵד אֲשֶׁר אִוָּעֵד לְךָ שָׁמָּה קדֶשׁ קָדָשִׁים תִּהְיֶה לָכֶם: וְהִקְטִיר עָלָיו אַהֲרן קְטרֶת סַמִּים בַּבּקֶר בַּבּקֶר בְּהֵיטִיבו אֶת הַנֵּרות יַקְטִירֶנָּה: וּבְהַעֲלת אַהֲרן אֶת הַנֵּרות בֵּין הָעַרְבַּיִם יַקְטִירֶנָּה קְטרֶת תָּמִיד לִפְנֵי ה\' לְדרתֵיכֶם:",
            textAlign: TextAlign.justify,
            textDirection: TextDirection.rtl,
            style: GoogleFonts.suezOne(fontSize: 24),
          ),
        ),
        Padding(
          padding: const EdgeInsets.all(8.0),
          child: Text(
            "פִּטּוּם הַקְּטרֶת, הַצֳּרִי וְהַצִּפּרֶן הַחֶלְבְּנָה וְהַלְּבונָה מִשְׁקַל שִׁבְעִים שִׁבְעִים מָנֶה. מר וּקְצִיעָה שִׁבּלֶת נֵרְדְּ וְכַרְכּם מִשְׁקַל שִׁשָּׁה עָשר שִׁשָּׁה עָשר מָנֶה. הַקּשְׁטְ שְׁנֵים עָשר. קִלּוּפָה שְׁלשָׁה. קִנָּמון תִּשְׁעָה. בּרִית כַּרְשִׁינָה תִּשְׁעָה קַבִּין. יֵין קַפְרִיסִין סְאִין תְּלָתָא וְקַבִּין תְּלָתָא וְאִם לא מָצָא יֵין קַפְרִיסִין מֵבִיא חֲמַר חִוַּרְיָן עַתִּיק, מֶלַח סְדומִית רבַע מַעֲלֶה עָשָׁן כָּל שֶׁהוּא, רִבִּי נָתָן הַבַּבְלִי אומֵר אַף כִּפַּת הַיַּרְדֵּן כָּל שֶׁהוּא וְאִם נָתַן בָּהּ דְּבַשׁ פְּסָלָהּ. וְאִם חִסַּר אַחַת מִכָּל סַמָּנֶיהָ חַיָּב מִיתָה:",
            textAlign: TextAlign.justify,
            textDirection: TextDirection.rtl,
            style: GoogleFonts.suezOne(fontSize: 24),
          ),
        ),
        Padding(
          padding: const EdgeInsets.all(8.0),
          child: Text(
            "רִבִּי שִׁמְעון בֶּן גַּמְלִיאֵל אומֵר הַצֳּרִי אֵינו אֶלָּא שרָף הַנּוטֵף מֵעֲצֵי הַקְּטָף. בּרִית כַּרְשִׁינָה שֶׁשָׁפִין בָּה אֶת הַצִּפּרֶן כְּדֵי שֶׁתְּהֵא נָאָה. יֵין קַפְרִיסִין שֶׁשׁורִין בּו אֶת הַצִּפּרֶן כְּדֵי שֶׁתְּהֵא עַזָּה. וַהֲלא מֵי רַגְלַיִם יָפִין לָהּ אֶלָּא שֶׁאֵין מַכְנִיסִין מֵי רַגְלַיִם בַּמִּקְדָּשׁ מִפְּנֵי הַכָּבוד:",
            textAlign: TextAlign.justify,
            textDirection: TextDirection.rtl,
            style: GoogleFonts.suezOne(fontSize: 24),
          ),
        ),
        (JewishCalendar.fromDateTime(DateTime.now()).isRoshChodesh())
            ? Padding(
                padding: const EdgeInsets.all(8.0),
                child: Text(
                  "בְרָאשֵׁי חָדְשֵׁיכֶם תַּקְרִיבוּ עלָה לה\', פָּרִים בְּנֵי בָקָר שְׁנַיִם וְאַיִל אֶחָד, כְּבָשים בְּנֵי שָׁנָה שִׁבְעָה תְּמִימִים: וּשְׁלשָׁה עֶשרנִים סלֶת מִנְחָה בְּלוּלָה בַשֶּׁמֶן לַפָּר הָאֶחָד, וּשְׁנֵי עֶשרנִים סלֶת מִנְחָה בְּלוּלָה בַשֶּׁמֶן לָאַיִל הָאֶחָד: וְעִשּרן עִשּרון סלֶת מִנְחָה בְּלוּלָה בַשֶּׁמֶן לַכֶּבֶש הָאֶחָד, עלָה רֵיחַ נִיחחַ אִשֶּׁה לה\': וְנִסְכֵּיהֶם, חֲצִי הַהִין יִהְיֶה לַפָּר, וּשְׁלִישִׁת הַהִין לָאַיִל, וּרְבִיעִת הַהִין לַכֶּבֶש יָיִן, זאת עלַת חדֶשׁ בְּחָדְשׁו לְחָדְשֵׁי הַשָּׁנָה: וּשעִיר עִזִּים אֶחָד לְחַטָּאת לה\', עַל עלַת הַתָּמִיד יֵעָשה וְנִסְכּו:",
                  textAlign: TextAlign.justify,
                  textDirection: TextDirection.rtl,
                  style: GoogleFonts.suezOne(
                      fontSize: 24, color: Colors.redAccent),
                ),
              )
            : Container(),
        Padding(
          padding: const EdgeInsets.all(8.0),
          child: Text(
            "אֵיזֶהוּ מְקומָן שֶׁל זְבָחִים. קָדְשֵׁי קָדָשִׁים שְׁחִיטָתָן בַּצָּפון. פָּר וְשעִיר שֶׁל יום הַכִּפּוּרִים שְׁחִיטָתָן בַּצָּפון וְקִבּוּל דָּמָן בִּכְלִי שָׁרֵת בַּצָּפון וְדָמָן טָעוּן הַזָּיָה עַל בֵּין הַבַּדִּים וְעַל הַפָּרכֶת וְעַל מִזְבַּח הַזָּהָב. מַתָּנָה אַחַת מֵהֶן מְעַכָּבֶת. שְׁיָרֵי הַדָּם הָיָה שׁופֵךְ עַל יְסוד מַעֲרָבִי שֶׁל מִזְבֵּחַ הַחִיצון אִם לא נָתַן לא עִכֵּב:",
            textAlign: TextAlign.justify,
            textDirection: TextDirection.rtl,
            style: GoogleFonts.suezOne(fontSize: 24),
          ),
        ),
        Padding(
          padding: const EdgeInsets.all(8.0),
          child: Text(
            "פָּרִים הַנִּשרָפִים וּשעִירִים הַנִּשרָפִים. שְׁחִיטָתָן בַּצָּפון וְקִבּוּל דָּמָן בִּכְלִי שָׁרֵת בַּצָּפון וְדָמָן טָעוּן הַזָּיָה עַל הַפָּרכֶת וְעַל מִזְבַּח הַזָּהָב. מַתָּנָה אַחַת מֵהֶן מְעַכָּבֶת. שְׁיָרֵי הַדָּם הָיָה שׁופֵךְ עַל יְסוד מַעֲרָבִי שֶׁל מִזְבֵּחַ הַחִיצון. אִם לא נָתַן לא עִכֵּב. אֵלּוּ וָאֵלּוּ נִשרָפִין בְּבֵית הַדָּשֶׁן:",
            textAlign: TextAlign.justify,
            textDirection: TextDirection.rtl,
            style: GoogleFonts.suezOne(fontSize: 24),
          ),
        ),
        Padding(
          padding: const EdgeInsets.all(8.0),
          child: Text(
            "חַטּאת הַצִּבּוּר וְהַיָּחִיד. אֵלּוּ הֵן חַטּאת הַצִּבּוּר. שעִירֵי רָאשֵׁי חֳדָשִׁים וְשֶׁל מועֲדות שְׁחִיטָתָן בַּצָּפון וְקִבּוּל דָּמָן בִּכְלִי שָׁרֵת בַּצָּפון וְדָמָן טָעוּן אַרְבַּע מַתָּנות עַל אַרְבַּע קְרָנות. כֵּיצַד. עָלָה בַכֶּבֶשׁ וּפָנָה לַסּובֵב וּבָא לו לְקֶרֶן דְּרומִית מִזְרָחִית. מִזְרָחִית צְפונִית. צְפונִית מַעֲרָבִית. מַעֲרָבִית דְּרומִית. שְׁיָרֵי הַדָּם הָיָה שׁופֵךְ עַל יְסוד דְּרומִי. וְנֶאֱכָלִין לִפְנִים מִן הַקְּלָעִים. לְזִכְרֵי כְהֻנָּה. בְּכָל מַאֲכָל. לְיום וָלַיְלָה עַד חֲצות:",
            textAlign: TextAlign.justify,
            textDirection: TextDirection.rtl,
            style: GoogleFonts.suezOne(fontSize: 24),
          ),
        ),
        Padding(
          padding: const EdgeInsets.all(8.0),
          child: Text(
            "הָעולָה קדֶשׁ קָדָשִׁים. שְׁחִיטָתָהּ בַּצָּפון וְקִבּוּל דָּמָהּ בִּכְלִי שָׁרֵת בַּצָּפון. וְדָמָהּ טָעוּן שְׁתֵּי מַתָּנות שֶׁהֵן אַרְבַּע. וּטְעוּנָה הֶפְשֵׁט וְנִתּוּחַ וְכָלִיל לָאִשִּׁים:",
            textAlign: TextAlign.justify,
            textDirection: TextDirection.rtl,
            style: GoogleFonts.suezOne(fontSize: 24),
          ),
        ),
        Padding(
          padding: const EdgeInsets.all(8.0),
          child: Text(
            "זִבְחֵי שַׁלְמֵי צִבּוּר וַאֲשָׁמות. אֵלּוּ הֵן אֲשָׁמות. אֲשַׁם גְּזֵלות. אֲשַׁם מְעִילות. אֲשַׁם שִׁפְחָה חֲרוּפָה. אֲשַׁם נָזִיר. אֲשַׁם מְצרָע. אָשָׁם תָּלוּי. שְׁחִיטָתָן בַּצָּפון וְקִבּוּל דָּמָן בִּכְלִי שָׁרֵת בַּצָּפון. וְדָמָן טָעוּן שְׁתֵּי מַתָּנות שֶׁהֵן אַרְבַּע. וְנֶאֱכָלִין לִפְנִים מִן הַקְּלָעִים. לְזִכְרֵי כְהֻנָּה. בְּכָל מַאֲכָל. לְיום וָלַיְלָה עַד חֲצות:",
            textAlign: TextAlign.justify,
            textDirection: TextDirection.rtl,
            style: GoogleFonts.suezOne(fontSize: 24),
          ),
        ),
        Padding(
          padding: const EdgeInsets.all(8.0),
          child: Text(
            "הַתּודָה וְאֵיל נָזִיר קָדָשִׁים קַלִּים. שְׁחִיטָתָן בְּכָל מָקום בָּעֲזָרָה. וְדָמָן טָעוּן שְׁתֵּי מַתָּנות שֶׁהֵן אַרְבַּע. וְנֶאֱכָלִין בְּכָל הָעִיר. לְכָל אָדָם. בְּכָל מַאֲכָל. לְיום וָלַיְלָה עַד חֲצות: הַמּוּרָם מֵהֶם כַּיּוצֵא בָהֶם. אֶלָּא שֶׁהַמּוּרָם נֶאֱכָל לַכּהֲנִים לִנְשֵׁיהֶם וְלִבְנֵיהֶם וּלְעַבְדֵיהֶם:",
            textAlign: TextAlign.justify,
            textDirection: TextDirection.rtl,
            style: GoogleFonts.suezOne(fontSize: 24),
          ),
        ),
        Padding(
          padding: const EdgeInsets.all(8.0),
          child: Text(
            "שְׁלָמִים קָדָשִׁים קַלִּים. שְׁחִיטָתָן בְּכָל מָקום בָּעֲזָרָה. וְדָמָן טָעוּן שְׁתֵּי מַתָּנות שֶׁהֵן אַרְבַּע. וְנֶאֱכָלִין בְּכָל הָעִיר. לְכָל אָדָם. בְּכָל מַאֲכָל. לִשְׁנֵי יָמִים וְלַיְלָה אֶחָד: הַמּוּרָם מֵהֶם כַּיּוצֵא בָהֶם. אֶלָּא שֶׁהַמּוּרָם נֶאֱכָל לַכּהֲנִים לִנְשֵׁיהֶם וְלִבְנֵיהֶם וּלְעַבְדֵיהֶם:",
            textAlign: TextAlign.justify,
            textDirection: TextDirection.rtl,
            style: GoogleFonts.suezOne(fontSize: 24),
          ),
        ),
        Padding(
          padding: const EdgeInsets.all(8.0),
          child: Text(
            "בְּכור וְהַמַּעֲשר וְהַפֶּסַח קָדָשִׁים קַלִּים. שְׁחִיטָתָן בְּכָל מָקום בָּעֲזָרָה. וְדָמָן טָעוּן מַתָּנָה אֶחָת. וּבִלְבָד שֶׁיִּתֵּן כְּנֶגֶד הַיְסוד. שִׁנָּה בַאֲכִילָתָן. הַבְּכור נֶאֱכָל לַכּהֲנִים. וְהַמַּעֲשר לְכָל אָדָם. וְנֶאֱכָלִין בְּכָל הָעִיר. בְּכָל מַאֲכָל. לִשְׁנֵי יָמִים וְלַיְלָה אֶחָד: הַפֶּסַח אֵינו נֶאֱכָל אֶלָּא בַלַּיְלָה. וְאֵינו נֶאֱכָל אֶלָּא עַד חֲצות. וְאֵינו נֶאֱכָל אֶלָּא לִמְנוּיָיו. וְאֵינו נֶאֱכָל אֶלָּא צָלִי:",
            textAlign: TextAlign.justify,
            textDirection: TextDirection.rtl,
            style: GoogleFonts.suezOne(fontSize: 24),
          ),
        ),
        Padding(
          padding: const EdgeInsets.all(8.0),
          child: Text(
            "רִבִּי יִשְׁמָעֵאל אומֵר. בִּשְׁלשׁ עֶשרֵה מִדּות הַתּורָה נִדְרֶשֶׁת: מִקַּל וָחמֶר. וּמִגְּזֵרָה שָׁוָה. מִבִּנְיַן אָב מִכָּתוּב אֶחָד. וּמִבִּנְיַן אָב מִשְּׁנֵי כְתוּבִים. מִכְּלָל וּפְרָט. וּמִפְּרָט וּכְלָל. כְּלָל וּפְרָט וּכְלָל. אִי אַתָּה דָן אֶלָּא כְּעֵין הַפְּרָט. מִכְּלָל שֶׁהוּא צָרִיךְ לִפְרָט. וּמִפְּרָט שֶׁהוּא צָרִיךְ לִכְלָל. כָּל דָּבָר שֶׁהָיָה בִּכְלָל וְיָצָא מִן הַכְּלָל לְלַמֵּד. לא לְלַמֵּד עַל עַצְמו יָצָא. אֶלָּא לְלַמֵּד עַל הַכְּלָל כֻּלּו יָצָא. כָּל דָּבָר שֶׁהָיָה בִּכְלָל וְיָצָא לִטְעון טעַן אֶחָד שֶׁהוּא כְעִנְיָנו. יָצָא לְהָקֵל וְלא לְהַחֲמִיר. כָּל דָּבָר שֶׁהָיָה בִּכְלָל וְיָצָא לִטְעון טעַן אַחֵר שֶׁלּא כְעִנְיָנו. יָצָא לְהָקֵל וּלְהַחֲמִיר. כָּל דָּבָר שֶׁהָיָה בִּכְלָל וְיָצָא לִדּון בַּדָּבָר הֶחָדָשׁ. אִי אַתָּה יָכול לְהַחֲזִירו לִכְלָלו עַד שֶׁיַּחֲזִירֶנּוּ הַכָּתוּב לִכְלָלו בְּפֵרוּשׁ. דָּבָר הַלָּמֵד מֵעִנְיָנו. וְדָבָר הַלָּמֵד מִסּופו. וְכֵן שְׁנֵי כְתוּבִים הַמַּכְחִישִׁים זֶה אֶת זֶה. עַד שֶׁיָּבוא הַכָּתוּב הַשְּׁלִישִׁי וְיַכְרִיעַ בֵּינֵיהֶם:",
            textAlign: TextAlign.justify,
            textDirection: TextDirection.rtl,
            style: GoogleFonts.suezOne(fontSize: 24),
          ),
        ),
        Padding(
          padding: const EdgeInsets.all(8.0),
          child: Text(
            "יְהִי רָצון מִלְּפָנֶיךָ ה\' אֱלהֵינוּ וֵאלהֵי אֲבותֵינוּ שֶׁיִּבָּנֶה בֵּית הַמִּקְדָּשׁ בִּמְהֵרָה בְיָמֵינוּ. וְתֵן חֶלְקֵנוּ בְּתורָתֶךָ:",
            textAlign: TextAlign.justify,
            textDirection: TextDirection.rtl,
            style: GoogleFonts.suezOne(fontSize: 24),
          ),
        ),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Card(
              child: Padding(
                padding: const EdgeInsets.all(8.0),
                child: ExpansionTile(
                  title: Center(
                      child: Text(
                    "Kaddish",
                  )),
                  children: [
                    Text(
                      "יִתְגַּדֵּל וְיִתְקַדֵּשׁ שְׁמֵהּ רַבָּא.\nבְּעָלְמָא דִּי בְרָא כִּרְעוּתֵהּ וְיַמְלִיךְ מַלְכוּתֵהּ בְּחַיֵּיכון וּבְיומֵיכון וּבְחַיֵּי דְכָל בֵּית יִשרָאֵל, בַּעֲגָלָא וּבִזְמַן קָרִיב, וְאִמְרוּ אָמֵן.\nיְהֵא שְׁמֵהּ רַבָּא מְבָרַךְ לְעָלַם וּלְעָלְמֵי עָלְמַיָּא.\nיִתְבָּרַךְ וְיִשְׁתַּבַּח וְיִתְפָּאַר וְיִתְרומַם וְיִתְנַשׁא וְיִתְהַדַּר וְיִתְעַלֶּה שְׁמֵהּ דְּקֻדְשָׁא. בְּרִיךְ הוּא.\nלְעֵלָּא מִן כָּל בִּרְכָתָא וְשִׁירָתָא תֻּשְׁבְּחָתָא וְנֶחֱמָתָא דַּאֲמִירָן בְּעָלְמָא, וְאִמְרוּ אָמֵן.",
                      textAlign: TextAlign.justify,
                      textDirection: TextDirection.rtl,
                      style: GoogleFonts.suezOne(fontSize: 24),
                    )
                  ],
                ),
              ),
            )),
      ],
    ),
    // Psukei D'Zimra
    Column(
      children: [
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "בָּרוּךְ שֶׁאָמַר וְהָיָה הָעולָם. בָּרוּךְ הוּא. בָּרוּךְ עושה בְרֵאשִׁית. בָּרוּךְ אומֵר וְעושה. בָּרוּךְ גּוזֵר וּמְקַיֵּם. בָּרוּךְ מְרַחֵם עַל הָאָרֶץ. בָּרוּךְ מְרַחֵם עַל הַבְּרִיּות. בָּרוּךְ מְשַׁלֵּם שכָר טוב לִירֵאָיו. בָּרוּךְ חַי לָעַד וְקַיָּם לָנֶצַח. בָּרוּךְ פּודֶה וּמַצִּיל. בָּרוּךְ שְׁמו: בָּרוּךְ אַתָּה ה' אֱלהֵינוּ מֶלֶךְ הָעולָם. הָאֵל הָאָב הָרַחֲמָן הַמְהֻלָּל בְּפִי עַמּו. מְשֻׁבָּח וּמְפאָר בִּלְשׁון חֲסִידָיו וַעֲבָדָיו. וּבְשִׁירֵי דָוִד עַבְדֶּךָ. נְהַלֶּלְךָ ה' אֱלהֵינוּ בִּשְׁבָחות וּבִזְמִירות. נְגַדֶּלְךָ וּנְשַׁבֵּחֲךָ וּנְפָאֶרְךָ וְנַזְכִּיר שִׁמְךָ וְנַמְלִיכְךָ מַלְכֵּנוּ אֱלהֵינוּ. יָחִיד חֵי הָעולָמִים. מֶלֶךְ מְשֻׁבָּח וּמְפאָר עֲדֵי עַד שְׁמו הַגָּדול: בָּרוּךְ אַתָּה ה' מֶלֶךְ מְהֻלָּל בַּתִּשְׁבָּחות:",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "הודוּ לה' קִרְאוּ בִשְׁמו. הודִיעוּ בָעַמִּים עֲלִילותָיו: שִׁירוּ לו זַמְּרוּ לו. שיחוּ בְּכָל נִפְלְאותָיו: הִתְהַלְלוּ בְּשֵׁם קָדְשׁו. יִשמַח לֵב מְבַקְשֵׁי ה': דִּרְשׁוּ ה' וְעֻזּו. בַּקְּשׁוּ פָנָיו תָּמִיד: זִכְרוּ נִפְלְאותָיו אֲשֶׁר עָשה. מפְתָיו וּמִשְׁפְּטֵי פִיהוּ: זֶרַע יִשרָאֵל עַבְדּו. בְּנֵי יַעֲקב בְּחִירָיו: הוּא ה' אֱלהֵינוּ. בְּכָל הָאָרֶץ מִשְׁפָּטָיו: זִכְרוּ לְעולָם בְּרִיתו. דָּבָר צִוָּה לְאֶלֶף דּור: אֲשֶׁר כָּרַת אֶת אַבְרָהָם. וּשְׁבוּעָתו לְיִצְחָק: וַיַּעֲמִידֶהָ לְיַעֲקב לְחק. לְיִשרָאֵל בְּרִית עולָם: לֵאמר. לְךָ אֶתֵּן אֶרֶץ כְּנָעַן. חֶבֶל נַחֲלַתְכֶם: בִּהְיותְכֶם מְתֵי מִסְפָּר. כִּמְעַט וְגָרִים בָּהּ: וַיִּתְהַלְּכוּ מִגּוי אֶל גּוי. וּמִמַּמְלָכָה אֶל עַם אַחֵר: לא הִנִּיחַ לְאִישׁ לְעָשְׁקָם. וַיּוכַח עֲלֵיהֶם מְלָכִים: אַל תִּגְּעוּ בִּמְשִׁיחָי וּבִנְבִיאַי אַל תָּרֵעוּ: שִׁירוּ לה' כָּל הָאָרֶץ. בַּשּרוּ מִיּום אֶל יום יְשׁוּעָתו: סַפְּרוּ בַגּויִם אֶת כְּבודו. בְּכָל הָעַמִּים נִפְלְאתָיו: כִּי גָדול ה' וּמְהֻלָּל מְאד. וְנורָא הוּא עַל כָּל אֱלהִים: כִּי כָּל אֱלהֵי הָעַמִּים אֱלִילִים וה' שָׁמַיִם עָשה: הוד וְהָדָר לְפָנָיו. עז וְחֶדְוָה בִּמְקומו: הָבוּ לה' מִשְׁפְּחות עַמִּים. הָבוּ לה' כָּבוד וָעז: הָבוּ לה' כְּבוד שְׁמו. שאוּ מִנְחָה וּבאוּ לְפָנָיו. הִשְׁתַּחֲווּ לה' בְּהַדְרַת קדֶשׁ: חִילוּ מִלְּפָנָיו כָּל הָאָרֶץ. אַף תִּכּון תֵּבֵל בַּל תִּמּוט: יִשמְחוּ הַשָּׁמַיִם וְתָגֵל הָאָרֶץ. וְיאמְרוּ בַגּויִם ה' מָלָךְ: יִרְעַם הַיָּם וּמְלאו. יַעֲלץ הַשּדֶה וְכָל אֲשֶׁר בּו: אָז יְרַנְּנוּ עֲצֵי הַיָּעַר מִלִּפְנֵי ה'. כִּי בָא לִשְׁפּוט אֶת הָאָרֶץ: הודוּ לה'. כִּי טוב. כִּי לְעולָם חַסְדּו: וְאִמְרוּ. הושִׁיעֵנוּ אֱלהֵי יִשְׁעֵנוּ. וְקַבְּצֵנוּ וְהַצִּילֵנוּ מִן הַגּויִם.לְהדות לְשֵׁם קָדְשֶׁךָ. לְהִשְׁתַּבֵּחַ בִּתְהִלָּתֶךָ: בָּרוּךְ ה' אֱלהֵי יִשרָאֵל מִן הָעולָם וְעַד הָעולָם וַיּאמְרוּ כָל הָעָם אָמֵן וְהַלֵּל לה':",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "רומְמוּ ה' אֱלהֵינוּ וְהִשְׁתַּחֲווּ לַהֲדם רַגְלָיו. קָדושׁ הוּא: רומְמוּ ה' אֱלהֵינוּ וְהִשְׁתַּחֲווּ לְהַר קָדְשׁו. כִּי קָדושׁ ה' אֱלהֵינוּ: וְהוּא רַחוּם יְכַפֵּר עָון וְלא יַשְׁחִית. וְהִרְבָּה לְהָשִׁיב אַפּו וְלא יָעִיר כָּל חֲמָתו: אַתָּה ה' לא תִכְלָא רַחֲמֶיךָ מִמֶּנִּי. חַסְדְּךָ וַאֲמִתְּךָ תָּמִיד יִצְּרוּנִי: זְכר רַחֲמֶיךָ ה'. וַחֲסָדֶיךָ. כִּי מֵעולָם הֵמָּה: תְּנוּ עז לֵאלהִים עַל יִשרָאֵל גַּאֲוָתו. וְעֻזּו בַּשְּׁחָקִים: נורָא אֱלהִים מִמִּקְדָּשֶׁיךָ. אֵל יִשרָאֵל. הוּא נותֵן עז וְתַעֲצֻמות לָעָם. בָּרוּךְ אֱלהִים: אֵל נְקָמות ה'. אֵל נְקָמות הופִיעַ: הִנָּשא שׁפֵט הָאָרֶץ הָשֵׁב גְּמוּל עַל גֵּאִים: לה' הַיְשׁוּעָה. עַל עַמְּךָ בִרְכָתֶךָ סֶּלָה: ה' צְבָאות עִמָּנוּ. מִשגָּב לָנוּ אֱלהֵי יַעֲקב סֶלָה: ה' צְבָאות. אַשְׁרֵי אָדָם בּטֵחַ בָּךְ: ה' הושִׁיעָה. הַמֶּלֶךְ יַעֲנֵנוּ בְיום קָרְאֵנוּ: הושִׁיעָה אֶת עַמֶּךָ וּבָרֵךְ אֶת נַחֲלָתֶךָ. וּרְעֵם וְנַשּאֵם עַד הָעולָם: נַפְשֵׁנוּ חִכְּתָה לה'. עֶזְרֵנוּ וּמָגִנֵּנוּ הוּא: כִּי בו יִשמַח לִבֵּנוּ. כִּי בְשֵׁם קָדְשׁו בָטָחְנוּ: יְהִי חַסְדְּךָ ה' עָלֵינוּ. כַּאֲשֶׁר יִחַלְנוּ לָךְ: הַרְאֵנוּ ה' חַסְדֶּךָ. וְיֶשְׁעֲךָ תִּתֶּן לָנוּ: קוּמָה עֶזְרָתָה לָנוּ. וּפְדֵנוּ לְמַעַן חַסְדֶּךָ: אָנכִי ה' אֱלהֶיךָ הַמַּעַלְךָ מֵאֶרֶץ מִצְרָיִם. הַרְחֶב פִּיךָ וַאֲמַלְאֵהוּ: אַשְׁרֵי הָעָם שֶׁכָּכָה לּו. אַשְׁרֵי הָעָם שֶׁה' אֱלהָיו: וַאֲנִי בְּחַסְדְּךָ בָטַחְתִּי. יָגֵל לִבִּי בִּישׁוּעָתֶךָ. אָשִׁירָה לה' כִּי גָמַל עָלָי:",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "מִזְמור לְתודָה. הָרִיעוּ לה' כָּל הָאָרֶץ: עִבְדוּ אֶת ה' בְּשמְחָה. בּאוּ לְפָנָיו בִּרְנָנָה: דְּעוּ כִּי ה' הוּא אֱלהִים. הוּא עָשנוּ. וְלו אֲנַחְנוּ עַמּו וְצאן מַרְעִיתו: בּאוּ שְׁעָרָיו בְּתודָה. חֲצֵרתָיו בִּתְהִלָּה. הודוּ לו בָּרְכוּ שְׁמו: כִּי טוב ה'. לְעולָם חַסְדּו. וְעַד דּר וָדר אֱמוּנָתו:",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "יְהִי כְבוד ה' לְעולָם. יִשמַח ה' בְּמַעֲשיו: יְהִי שֵׁם ה' מְברָךְ. מֵעַתָּה וְעַד עולָם: מִמִּזְרַח שֶׁמֶשׁ עַד מְבואו. מְהֻלָּל שֵׁם ה': רָם עַל כָּל גּויִם ה'. עַל הַשָּׁמַיִם כְּבודו: ה' שִׁמְךָ לְעולָם. ה' זִכְרְךָ לְדור וָדור: ה' בַּשָׁמַיִם הֵכִין כִּסְאו. וּמַלְכוּתו בַּכּל מָשָׁלָה: יִשמְחוּ הַשָּׁמַיִם וְתָגֵל הָאָרֶץ. וְיאמְרוּ בַגּויִם ה' מָלָךְ: ה' מֶלֶךְ. ה' מָלָךְ. ה' יִמְלךְ לְעולָם וָעֶד: ה' מֶלֶךְ עולָם וָעֶד. אָבְדוּ גויִם מֵאַרְצו: ה' הֵפִיר עֲצַת גּויִם. הֵנִיא מַחְשְׁבות עַמִּים: רַבּות מַחֲשָׁבות בְּלֶב אִישׁ. וַעֲצַת ה' הִיא תָקוּם: עֲצַת ה' לְעולָם תַּעֲמד. מַחְשְׁבות לִבּו לְדר וָדר: כִּי הוּא אָמַר וַיֶּהִי. הוּא צִוָּה וַיַּעֲמד: כִּי בָחַר ה' בְּצִיּון. אִוָּהּ לְמושָׁב לו: כִּי יַעֲקב בָּחַר לו יָהּ. יִשרָאֵל לִסְגֻלָּתו: כִּי לא יִטּשׁ ה' עַמּו. וְנַחֲלָתו לא יַעֲזב: וְהוּא רַחוּם יְכַפֵּר עָון וְלא יַשְׁחִית. וְהִרְבָּה לְהָשִׁיב אַפּו. וְלא יָעִיר כָּל חֲמָתו: ה' הושִׁיעָה. הַמֶּלֶךְ יַעֲנֵנוּ בְיום קָרְאֵנוּ:",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "אַשְׁרֵי יושְׁבֵי בֵיתֶךָ. עוד יְהַלְלוּךָ סֶּלָה: אַשְׁרֵי הָעָם שֶׁכָּכָה לּו. אַשְׁרֵי הָעָם שֶׁה' אֱלהָיו: תְּהִלָּה לְדָוִד. אֲרומִמְךָ אֱלוהַי הַמֶּלֶךְ. וַאֲבָרְכָה שִׁמְךָ לְעולָם וָעֶד: בְּכָל יום אֲבָרְכֶךָּ. וַאֲהַלְלָה שִׁמְךָ לְעולָם וָעֶד: גָּדול ה' וּמְהֻלָּל מְאד. וְלִגְדֻלָּתו אֵין חֵקֶר: דּור לְדור יְשַׁבַּח מַעֲשיךָ. וּגְבוּרתֶיךָ יַגִּידוּ: הֲדַר כְּבוד הודֶךָ. וְדִבְרֵי נִפְלְאתֶיךָ אָשיחָה: וֶעֱזוּז נורְאתֶיךָ יאמֵרוּ. וּגְדֻלָּתְךָ אֲסַפְּרֶנָּה: זֵכֶר רַב טוּבְךָ יַבִּיעוּ. וְצִדְקָתְךָ יְרַנֵּנוּ: חַנּוּן וְרַחוּם ה'. אֶרֶךְ אַפַּיִם וּגְדָל חָסֶד: טוב ה' לַכּל. וְרַחֲמָיו עַל כָּל מַעֲשיו: יודוּךָ ה' כָּל מַעֲשיךָ. וַחֲסִידֶיךָ יְבָרְכוּכָה: כְּבוד מַלְכוּתְךָ יאמֵרוּ. וּגְבוּרָתְךָ יְדַבֵּרוּ: לְהודִיעַ לִבְנֵי הָאָדָם גְּבוּרתָיו. וּכְבוד הֲדַר מַלְכוּתו: מַלְכוּתְךָ מַלְכוּת כָּל עולָמִים. וּמֶמְשַׁלְתְּךָ בְּכָל דּור וָדר: סומֵךְ ה' לְכָל הַנּפְלִים. וְזוקֵף לְכָל הַכְּפוּפִים: עֵינֵי כל אֵלֶיךָ יְשבֵּרוּ. וְאַתָּה נותֵן לָהֶם אֶת אָכְלָם בְּעִתּו: פּותֵחַ אֶת יָדֶךָ. וּמַשבִּיעַ לְכָל חַי רָצון: צַדִּיק ה' בְּכָל דְּרָכָיו. וְחָסִיד בְּכָל מַעֲשיו קָרוב ה' לְכָל קרְאָיו. לְכל אֲשֶׁר יִקְרָאֻהוּ בֶאֱמֶת: רְצון יְרֵאָיו יַעֲשה. וְאֶת שַׁוְעָתָם יִשְׁמַע וְיושִׁיעֵם: שׁומֵר ה' אֶת כָּל אהֲבָיו. וְאֵת כָּל הָרְשָׁעִים יַשְׁמִיד: תְּהִלַּת ה' יְדַבֶּר פִּי. וִיבָרֵךְ כָּל בָּשר שֵׁם קָדְשׁו לְעולָם וָעֶד: וַאֲנַחְנוּ נְבָרֵךְ יָהּ מֵעַתָּה וְעַד עולָם. הַלְלוּיָהּ:",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "הַלְלוּיָהּ. הַלְלִי נַפְשִׁי אֶת ה': אֲהַלְלָה ה' בְּחַיָּי. אֲזַמְּרָה לֵאלהַי בְּעודִי: אַל תִּבְטְחוּ בִנְדִיבִים. בְּבֶן אָדָם שֶׁאֵין לו תְשׁוּעָה: תֵּצֵא רוּחו יָשֻׁב לְאַדְמָתו. בַּיּום הַהוּא אָבְדוּ עֶשְׁתּנתָיו: אַשְׁרֵי שֶׁאֵל יַעֲקב בְּעֶזְרו. שבְרו עַל ה' אֱלהָיו: עשה שָׁמַיִם וָאָרֶץ. אֶת הַיָּם וְאֶת כָּל אֲשֶׁר בָּם. הַשּׁמֵר אֱמֶת לְעולָם: עשה מִשְׁפָּט לַעֲשׁוּקִים. נתֵן לֶחֶם לָרְעֵבִים. ה' מַתִּיר אֲסוּרִים: ה' פּקֵחַ עִוְרִים. ה' זוקֵף כְּפוּפִים. ה' אהֵב צַדִּיקִים: ה' שׁמֵר אֶת גֵּרִים. יָתום וְאַלְמָנָה יְעודֵד. וְדֶרֶךְ רְשָׁעִים יְעַוֵּת: יִמְלךְ ה' לְעולָם. אֱלהַיִךְ צִיּון לְדר וָדר. הַלְלוּיָהּ:",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "הַלְלוּיָהּ. כִּי טוב זַמְּרָה אֱלהֵינוּ. כִּי נָעִים נָאוָה תְהִלָּה: בּונֵה יְרוּשָׁלַיִם ה'. נִדְחֵי יִשרָאֵל יְכַנֵּס: הָרופֵא לִשְׁבוּרֵי לֵב. וּמְחַבֵּשׁ לְעַצְּבותָם: מונֶה מִסְפָּר לַכּוכָבִים. לְכֻלָּם שֵׁמות יִקְרָא: גָּדול אֲדונֵינוּ וְרַב כּחַ. לִתְבוּנָתו אֵין מִסְפָּר: מְעודֵד עֲנָוִים ה'. מַשְׁפִּיל רְשָׁעִים עֲדֵי אָרֶץ: עֱנוּ לה' בְּתודָה. זַמְּרוּ לֵאלהֵינוּ בְכִנּור: הַמְכַסֶּה שָׁמַיִם בְּעָבִים. הַמֵּכִין לָאָרֶץ מָטָר. הַמַּצְמִיחַ הָרִים חָצִיר: נותֵן לִבְהֵמָה לַחְמָהּ. לִבְנֵי ערֵב אֲשֶׁר יִקְרָאוּ: לא בִגְבוּרַת הַסּוּס יֶחְפָּץ. לא בְשׁוקֵי הָאִישׁ יִרְצֶה: רוצֶה ה' אֶת יְרֵאָיו. אֶת הַמְיַחֲלִים לְחַסְדּו: שַׁבְּחִי יְרוּשָׁלַיִם אֶת ה'. הַלְלִי אֱלהַיִךְ צִיּון: כִּי חִזַּק בְּרִיחֵי שְׁעָרָיִךְ. בֵּרַךְ בָּנַיִךְ בְּקִרְבֵּךְ: הַשּם גְּבוּלֵךְ שָׁלום. חֵלֶב חִטִּים יַשבִּיעֵךְ: הַשּׁלֵחַ אִמְרָתו אָרֶץ. עַד מְהֵרָה יָרוּץ דְּבָרו: הַנּתֵן שֶׁלֶג כַּצָּמֶר. כְּפור כָּאֵפֶר יְפַזֵּר: מַשְׁלִיךְ קַרְחו כְפִתִּים. לִפְנֵי קָרָתו מִי יַעֲמד: יִשְׁלַח דְּבָרו וְיַמְסֵם. יַשֵּׁב רוּחו יִזְּלוּ מָיִם: מַגִּיד דְּבָרָיו לְיַעֲקב. חֻקָּיו וּמִשְׁפָּטָיו לְיִשרָאֵל: לא עָשה כֵן לְכָל גּוי. וּמִשְׁפָּטִים בַּל יְדָעוּם. הַלְלוּיָהּ:",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "הַלְלוּיָהּ. הַלְלוּ אֶת ה' מִן הַשָּׁמַיִם. הַלְלוּהוּ בַּמְּרומִים: הַלְלוּהוּ כָּל מַלְאָכָיו. הַלְלוּהוּ כָּל צְבָאָיו: הַלְלוּהוּ שֶׁמֶשׁ וְיָרֵחַ. הַלְלוּהוּ כָּל כּוכְבֵי אור: הַלְלוּהוּ שְׁמֵי הַשָּׁמָיִם. וְהַמַּיִם אֲשֶׁר מֵעַל הַשָּׁמָיִם: יְהַלְלוּ אֶת שֵׁם ה'. כִּי הוּא צִוָּה וְנִבְרָאוּ: וַיַּעֲמִידֵם לָעַד לְעולָם. חָק נָתַן וְלא יַעֲבור: הַלְלוּ אֶת ה' מִן הָאָרֶץ. תַּנִּינִים וְכָל תְּהמות: אֵשׁ וּבָרָד שֶׁלֶג וְקִיטור. רוּחַ סְעָרָה עשה דְבָרו: הֶהָרִים וְכָל גְבָעות. עֵץ פְּרִי וְכָל אֲרָזִים: הַחַיָּה וְכָל בְּהֵמָה. רֶמֶש וְצִפּור כָּנָף: מַלְכֵי אֶרֶץ וְכָל לְאֻמִּים. שרִים וְכָל שׁפְטֵי אָרֶץ: בַּחוּרִים וְגַם בְּתוּלות. זְקֵנִים עִם נְעָרִים: יְהַלְלוּ אֶת שֵׁם ה'. כִּי נִשגָּב שְׁמו לְבַדּו. הודו עַל אֶרֶץ וְשָׁמָיִם: וַיָּרֶם קֶרֶן לְעַמּו. תְּהִלָּה לְכָל חֲסִידָיו. לִבְנֵי יִשרָאֵל עַם קְרבו. הַלְלוּיָהּ:",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "הַלְלוּיָהּ. שִׁירוּ לה' שִׁיר חָדָשׁ. תְּהִלָּתו בִּקְהַל חֲסִידִים: יִשמַח יִשרָאֵל בְּעשיו. בְּנֵי צִיּון יָגִילוּ בְמַלְכָּם: יְהַלְלוּ שְׁמו בְמָחול. בְּתף וְכִנּור יְזַמְּרוּ לו: כִּי רוצֶה ה' בְּעַמּו. יְפָאֵר עֲנָוִים בִּישׁוּעָה: יַעְלְזוּ חֲסִידִים בְּכָבוד. יְרַנְּנוּ עַל מִשְׁכְּבותָם: רומְמות אֵל בִּגְרונָם. וְחֶרֶב פִּיפִיּות בְּיָדָם: לַעֲשות נְקָמָה בַגּויִם. תּוכֵחות בַּלְאֻמִּים: לֶאְסר מַלְכֵיהֶם בְּזִקִּים. וְנִכְבְּדֵיהֶם בְּכַבְלֵי בַרְזֶל: לַעֲשות בָּהֶם מִשְׁפָּט כָּתוּב. הָדָר הוּא לְכָל חֲסִידָיו. הַלְלוּיָהּ:",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "הַלְלוּיָהּ. הַלְלוּ אֵל בְּקָדְשׁו. הַלְלוּהוּ בִּרְקִיעַ עֻזּו: הַלְלוּהוּ בִּגְבוּרתָיו. הַלְלוּהוּ כְּרב גֻּדְלו: הַלְלוּהוּ בְּתֵקַע שׁופָר. הַלְלוּהוּ בְּנֵבֶל וְכִנּור: הַלְלוּהוּ בְּתף וּמָחול. הַלְלוּהוּ בְּמִנִּים וְעֻגָב: הַלְלוּהוּ בְּצִלְצְלֵי שָׁמַע. הַלְלוּהוּ בְּצִלְצְלֵי תְרוּעָה: כּל הַנְּשָׁמָה תְּהַלֵּל יָהּ. הַלְלוּיָהּ: כּל הַנְּשָׁמָה תְּהַלֵּל יָהּ. הַלְלוּיָהּ:",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "בָּרוּךְ ה' לְעולָם. אָמֵן וְאָמֵן: בָּרוּךְ ה' מִצִּיּון שׁכֵן יְרוּשָׁלָיִם. הַלְלוּיָהּ: בָּרוּךְ ה' אֱלהִים אֱלהֵי יִשרָאֵל. עשה נִפְלָאות לְבַדּו: וּבָרוּךְ שֵׁם כְּבודו לְעולָם. וְיִמָּלֵא כְבודו אֶת כָּל הָאָרֶץ. אָמֵן וְאָמֵן:",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "וַיְבָרֶךְ דָּוִיד אֶת ה' לְעֵינֵי כָּל הַקָּהָל. וַיּאמֶר דָּוִיד. בָּרוּךְ אַתָּה ה' אֱלהֵי יִשרָאֵל אָבִינוּ. מֵעולָם וְעַד עולָם: לְךָ ה' הַגְּדֻלָּה וְהַגְּבוּרָה וְהַתִּפְאֶרֶת וְהַנֵּצַח וְהַהוד. כִּי כל בַּשָּׁמַיִם וּבָאָרֶץ. לְךָ ה' הַמַּמְלָכָה. וְהַמִּתְנַשּא לְכל לְראשׁ: וְהָעשֶׁר וְהַכָּבוד מִלְּפָנֶיךָ. וְאַתָּה מושֵׁל בַּכּל. וּבְיָדְךָ כּחַ וּגְבוּרָה. וּבְיָדְךָ לְגַדֵּל וּלְחַזֵּק לַכּל: וְעַתָּה אֱלהֵינוּ מודִים אֲנַחְנוּ לָךְ. וּמְהַלְלִים לְשֵׁם תִּפְאַרְתֶּךָ:",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "אַתָּה הוּא ה' לְבַדֶּךָ. אַתָּה עָשיתָ אֶת הַשָּׁמַיִם. שְׁמֵי הַשָּׁמַיִם וְכָל צְבָאָם. הָאָרֶץ וְכָל אֲשֶׁר עָלֶיהָ. הַיַּמִּים וְכָל אֲשֶׁר בָּהֶם. וְאַתָּה מְחַיֶּה אֶת כֻּלָּם. וּצְבָא הַשָּׁמַיִם לְךָ מִשְׁתַּחֲוִים: אַתָּה הוּא ה' הָאֱלהִים. אֲשֶׁר בָּחַרְתָּ בְּאַבְרָם. וְהוצֵאתו מֵאוּר כַּשדִּים. וְשמְתָּ שְׁמו אַבְרָהָם: וּמָצָאתָ אֶת לְבָבו נֶאֱמָן לְפָנֶיךָ: וְכָרות עִמּו הַבְּרִית לָתֵת אֶת אֶרֶץ הַכְּנַעֲנִי. הַחִתִּי הָאֱמרִי וְהַפְּרִזִּי וְהַיְבוּסִי וְהַגִּרְגָּשִׁי לָתֵת לְזַרְעו. וַתָּקֶם אֶת דְּבָרֶיךָ כִּי צַדִּיק אָתָּה: וַתֵּרֶא אֶת עֳנִי אֲבותֵינוּ בְּמִצְרָיִם. וְאֶת זַעֲקָתָם שָׁמַעְתָּ עַל יַם סוּף: וַתִּתֵּן אתת וּמפְתִים בְּפַרְעה וּבְכָל עֲבָדָיו וּבְכָל עַם אַרְצו. כִּי יָדַעְתָּ כִּי הֵזִידוּ עֲלֵיהֶם וַתַּעַש לְךָ שֵׁם כְּהַיּום הַזֶּה: וְהַיָּם בָּקַעְתָּ לִפְנֵיהֶם וַיַּעַבְרוּ בְתוךְ הַיָּם בַּיַּבָּשָׁה. וְאֶת רדְפֵיהֶם הִשְׁלַכְתָּ בִמְצולת כְּמו אֶבֶן. בְּמַיִם עַזִּים:",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "וַיּושַׁע ה' בַּיּום הַהוּא אֶת יִשרָאֵל מִיַּד מִצְרָיִם. וַיַּרְא יִשרָאֵל אֶת מִצְרַיִם מֵת. עַל שפַת הַיָּם: וַיַּרְא יִשרָאֵל אֶת הַיָּד הַגְּדלָה אֲשֶׁר עָשה ה' בְּמִצְרַיִם. וַיִּירְאוּ הָעָם אֶת ה'. וַיַּאֲמִינוּ בה' וּבְמשֶׁה עַבְדּו:",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "אָז יָשִׁיר משֶׁה וּבְנֵי יִשרָאֵל אֶת הַשִּׁירָה הַזּאת לה'. וַיּאמְרוּ לֵאמר. אָשִׁירָה לה' כִּי גָּאה גָּאָה. סוּס וְרכְבו רָמָה בַיָּם: עָזִּי וְזִמְרָת יָהּ. וַיְהִי לִי לִישׁוּעָה. זֶה אֵלִי וְאַנְוֵהוּ. אֱלהֵי אָבִי וַאֲרמְמֶנְהוּ: ה' אִישׁ מִלְחָמָה. ה' שְׁמו: מַרְכְּבת פַּרְעה וְחֵילו יָרָה בַיָּם. וּמִבְחַר שָׁלִשָׁיו טֻבְּעוּ בְיַם סוּף: תְּהמת יְכַסְיֻמוּ. יָרְדוּ בִמְצולת כְּמו אָבֶן: יְמִינְךָ ה' נֶאְדָּרִי בַּכּחַ. יְמִינְךָ ה' תִּרְעַץ אויֵב: וּבְרב גְּאונְךָ תַּהֲרס קָמֶיךָ. תְּשַׁלַּח חֲרנְךָ יאכְלֵמו כַּקַּשׁ: וּבְרוּחַ אַפֶּיךָ נֶעֶרְמוּ מַיִם. נִצְּבוּ כְמו נֵד נזְלִים. קָפְאוּ תְהמת בְּלֶב יָם: אָמַר אויֵב אֶרְדּף אַשּיג אֲחַלֵּק שָׁלָל. תִּמְלָאֵמו נַפְשִׁי. אָרִיק חַרְבִּי. תּורִישֵׁמו יָדִי: נָשַׁפְתָּ בְרוּחֲךָ כִּסָּמו יָם. צָלֲלוּ כַּעופֶרֶת בְּמַיִם. אַדִּירִים: מִי כָמכָה בָּאֵלִם ה'. מִי כָּמכָה נֶאְדָּר בַּקּדֶשׁ. נורָא תְהִלּת עשה פֶלֶא: נָטִיתָ יְמִינְךָ תִּבְלָעֵמו אָרֶץ: נָחִיתָ בְחַסְדְּךָ עַם זוּ גָּאָלְתָּ. נֵהַלְתָּ בְעָזְּךָ אֶל נְוֵה קָדְשֶׁךָ: שָׁמְעוּ עַמִּים יִרְגָּזוּן. חִיל אָחַז ישְׁבֵי פְּלָשֶׁת: אָז נִבְהֲלוּ אַלּוּפֵי אֱדום. אֵילֵי מואָב יאחֲזֵמו רָעַד. נָמגוּ כּל ישְׁבֵי כְנָעַן: תִּפּל עֲלֵיהֶם אֵימָתָה וָפַחַד. בִּגְדל זְרועֲךָ יִדְּמוּ כָּאָבֶן. עַד יַעֲבר עַמְּךָ ה'. עַד יַעֲבר עַם זוּ קָנִיתָ: תְּבִאֵמו וְתִטָּעֵמו בְּהַר נַחֲלָתְךָ. מָכון לְשִׁבְתְּךָ פָּעַלְתָּ ה'. מִקְּדָשׁ. אֲדנָי כּונְנוּ יָדֶיךָ: ה' יִמְלךְ לְעלָם וָעֶד: ה' יִמְלךְ לְעלָם וָעֶד: כִּי לה' הַמְּלוּכָה. וּמושֵׁל בַּגּויִם: וְעָלוּ מושִׁיעִים בְּהַר צִיּון לִשְׁפּט אֶת הַר עֵשו. וְהָיְתָה לה' הַמְּלוּכָה: וְהָיָה ה' לְמֶלֶךְ עַל כָּל הָאָרֶץ. בַּיּום הַהוּא יִהְיֶה ה' אֶחָד וּשְׁמו אֶחָד:",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "יִשְׁתַּבַּח שִׁמְךָ לָעַד מַלְכֵּנוּ. הָאֵל הַמֶּלֶךְ הַגָּדול וְהַקָּדושׁ בַּשָּׁמַיִם וּבָאָרֶץ. כִּי לְךָ נָאֶה ה' אֱלהֵינוּ וֵאלהֵי אֲבותֵינוּ: שִׁיר וּשְׁבָחָה הַלֵּל וְזִמְרָה עז וּמֶמְשָׁלָה נֶצַח גְּדֻלָּה וּגְבוּרָה תְּהִלָּה וְתִפְאֶרֶת קְדֻשָּׁה וּמַלְכוּת: בְּרָכות וְהודָאות מֵעַתָּה וְעַד עולָם. בָּרוּךְ אַתָּה ה', אֵל מֶלֶךְ גָּדול בַּתִּשְׁבָּחות. אֵל הַהודָאות אֲדון הַנִּפְלָאות. הַבּוחֵר בְּשִׁירֵי זִמְרָה. מֶלֶךְ אֵל חֵי הָעולָמִים:",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Card(
              child: Padding(
                padding: const EdgeInsets.all(8.0),
                child: ExpansionTile(
                  title: Center(
                      child: Text(
                    "Kaddish",
                  )),
                  children: [
                    Text(
                      "יִתְגַּדֵּל וְיִתְקַדֵּשׁ שְׁמֵהּ רַבָּא.\nבְּעָלְמָא דִּי בְרָא כִּרְעוּתֵהּ וְיַמְלִיךְ מַלְכוּתֵהּ בְּחַיֵּיכון וּבְיומֵיכון וּבְחַיֵּי דְכָל בֵּית יִשרָאֵל, בַּעֲגָלָא וּבִזְמַן קָרִיב, וְאִמְרוּ אָמֵן.\nיְהֵא שְׁמֵהּ רַבָּא מְבָרַךְ לְעָלַם וּלְעָלְמֵי עָלְמַיָּא.\nיִתְבָּרַךְ וְיִשְׁתַּבַּח וְיִתְפָּאַר וְיִתְרומַם וְיִתְנַשׁא וְיִתְהַדַּר וְיִתְעַלֶּה שְׁמֵהּ דְּקֻדְשָׁא. בְּרִיךְ הוּא.\nלְעֵלָּא מִן כָּל בִּרְכָתָא וְשִׁירָתָא תֻּשְׁבְּחָתָא וְנֶחֱמָתָא דַּאֲמִירָן בְּעָלְמָא, וְאִמְרוּ אָמֵן.",
                      textAlign: TextAlign.justify,
                      textDirection: TextDirection.rtl,
                      style: GoogleFonts.suezOne(fontSize: 24),
                    )
                  ],
                ),
              ),
            )),
      ],
    ),
    // Shema
    Column(
      children: [
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "בָּרְכוּ אֶת ה’ הַמְברָךְ. \nבָּרוּךְ ה' הַמְברָךְ לְעולָם וָעֶד.",
              textAlign: TextAlign.center,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "בָּרוּךְ אַתָּה ה', אֱלהֵינוּ מֶלֶךְ הָעולָם, יוצֵר אור וּבורֵא חשֶׁךְ. עֹשֶׂה שָׁלום וּבורֵא אֶת הַכּל.",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "הַמֵּאִיר לָאָרֶץ וְלַדָּרִים עָלֶיהָ בְּרַחֲמִים. וּבְטוּבו מְחַדֵּשׁ בְּכָל יום תָּמִיד מַעֲשֵׂה בְרֵאשִׁית. מָה רַבּוּ מַעֲשיךָ ה'. כֻּלָּם בְּחָכְמָה עָשיתָ. מָלְאָה הָאָרֶץ קִנְיָנֶךָ. הַמֶּלֶךְ הַמְרומָם לְבַדּו מֵאָז. הַמְשֻׁבָּח וְהַמְפאָר וְהַמִּתְנַשּא מִימות עולָם. אֱלהֵי עולָם. בְּרַחֲמֶיךָ הָרַבִּים רַחֵם עָלֵינוּ. אֲדון עֻזֵּנוּ. צוּר מִשגַּבֵּנוּ. מָגֵן יִשְׁעֵנוּ. מִשגָּב בַּעֲדֵנוּ. אֵל בָּרוּךְ גְּדול דֵּעָה. הֵכִין וּפָעַל זָהֳרֵי חַמָּה. טוב יָצַר כָּבוד לִשְׁמו. מְאורות נָתַן סְבִיבות עֻזּו. פִּנּות צְבָאָיו קְדושִׁים. רומְמֵי שַׁדַּי. תָּמִיד מְסַפְּרִים כְּבוד אֵל וּקְדֻשָּׁתו. תִּתְבָּרַךְ ה' אֱלהֵינוּ עַל שֶׁבַח מַעֲשי יָדֶיךָ. וְעַל מְאורֵי אור שֶׁעָשיתָ. יְפָאֲרוּךָ סֶּלָה.",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "תִּתְבָּרַךְ צוּרֵנוּ מַלְכֵּנוּ וְגואֲלֵנוּ בּורֵא קְדושִׁים. יִשְׁתַּבַּח שִׁמְךָ לָעַד מַלְכֵּנוּ יוצֵר מְשָׁרְתִים וַאֲשֶׁר מְשָׁרְתָיו כֻּלָּם עומְדִים בְּרוּם עולָם. וּמַשְׁמִיעִים בְּיִרְאָה יַחַד בְּקול. דִּבְרֵי אֱלהִים חַיִּים וּמֶלֶךְ עולָם. כֻּלָּם אֲהוּבִים. כֻּלָּם בְּרוּרִים. כֻּלָּם גִּבּורִים. וְכֻלָּם עושים בְּאֵימָה וּבְיִרְאָה רְצון קונָם. וְכֻלָּם פּותְחִים אֶת פִּיהֶם בִּקְדֻשָּׁה וּבְטָהֳרָה. בְּשִׁירָה וּבְזִמְרָה. וּמְבָרְכִים וּמְשַׁבְּחִים וּמְפָאֲרִים וּמַעֲרִיצִים וּמַקְדִּישִׁים וּמַמְלִיכִים. אֶת שֵׁם הָאֵל הַמֶּלֶךְ הַגָּדול הַגִּבּור וְהַנּורָא. קָדושׁ הוּא. וְכֻלָּם מְקַבְּלִים עֲלֵיהֶם על מַלְכוּת שָׁמַיִם זֶה מִזֶּה. וְנותְנִים רְשׁוּת זֶה לָזֶה לְהַקְדִּישׁ לְיוצְרָם בְּנַחַת רוּחַ. בְּשפָה בְרוּרָה וּבִנְעִימָה. קְדֻשָׁה כֻּלָּם כְּאֶחָד. עונִים וְאומְרִים בְּיִרְאָה",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "קָדושׁ קָדושׁ קָדושׁ ה' צְבָאות. מְלא כָל הָאָרֶץ כְּבודו:",
              textAlign: TextAlign.center,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "וְהָאופַנִּים וְחַיּות הַקּדֶשׁ בְּרַעַשׁ גָּדול מִתְנַשּאִים לְעֻמַּת שרָפִים. לְעֻמָּתָם מְשַׁבְּחִים וְאומְרִים",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "בָּרוּךְ כְּבוד ה’ מִמְּקומו:",
              textAlign: TextAlign.center,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "לְאֵל בָּרוּךְ נְעִימות יִתֵּנוּ. לְמֶּלֶךְ אֵל חַי וְקַיָּם זְמִירות יאמֵרוּ וְתִשְׁבָּחות יַשְׁמִיעוּ. כִּי הוּא לְבַדּו פּועֵל גְּבוּרות. עושה חֲדָשׁות. בַּעַל מִלְחָמות. זורֵעַ צְדָקות. מַצְמִיחַ יְשׁוּעות. בּורֵא רְפוּאות. נורָא תְהִלּות. אֲדון הַנִּפְלָאות. הַמְחַדֵּשׁ בְּטוּבו בְּכָל יום תָּמִיד מַעֲשה בְרֵאשִׁית. כָּאָמוּר לְעשה אורִים גְּדלִים. כִּי לְעולָם חַסְדּו. אור חָדָשׁ עַל צִיּון תָּאִיר וְנִזְכֶּה כֻלָּנוּ מְהֵרָה לְאורו. בָּרוּךְ אַתָּה ה', יוצֵר הַמְּאורות.",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "אַהֲבָה רַבָּה אֲהַבְתָּנוּ, ה' אֱלהֵינוּ. חֶמְלָה גְּדולָה וִיתֵרָה חָמַלְתָּ עָלֵינוּ: אָבִינוּ מַלְכֵּנוּ. בַּעֲבוּר אֲבותֵינוּ שֶׁבָּטְחוּ בְךָ. וַתְּלַמְּדֵם חֻקֵּי חַיִּים כֵּן תְּחָנֵּנוּ וּתְלַמְּדֵנוּ: אָבִינוּ הָאָב הָרַחֲמָן. הַמְרַחֵם. רַחֵם עָלֵינוּ. וְתֵן בְּלִבֵּנוּ לְהָבִין וּלְהַשכִּיל. לִשְׁמעַ. לִלְמד וּלְלַמֵּד. לִשְׁמר וְלַעֲשות וּלְקַיֵּם אֶת כָּל דִּבְרֵי תַלְמוּד תּורָתֶךָ בְּאַהֲבָה: וְהָאֵר עֵינֵינוּ בְּתורָתֶךָ. וְדַבֵּק לִבֵּנוּ בְּמִצְותֶיךָ. וְיַחֵד לְבָבֵנוּ לְאַהֲבָה וּלְיִרְאָה אֶת שְׁמֶךָ. וְלא נֵבושׁ לְעולָם וָעֶד: כִּי בְשֵׁם קָדְשְׁךָ הַגָּדול וְהַנּורָא בָּטָחְנוּ. נָגִילָה וְנִשמְחָה בִּישׁוּעָתֶךָ: וַהֲבִיאֵנוּ לְשָׁלום מֵאַרְבַּע כַּנְפות הָאָרֶץ. וְתולִיכֵנוּ קומְמִיּוּת לְאַרְצֵנוּ: כִּי אֵל פּועֵל יְשׁוּעות אָתָּה. וּבָנוּ בָחַרְתָּ מִכָּל עַם וְלָשׁון. וְקֵרַבְתָּנוּ לְשִׁמְךָ הַגָּדול סֶלָה בֶּאֱמֶת: לְהודות לְךָ וּלְיַחֶדְךָ בְּאַהֲבָה: בָּרוּךְ אַתָּה ה', הַבּוחֵר בְּעַמּו יִשרָאֵל בְּאַהֲבָה:",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "יחיד אומר: אֵל מֶלֶךְ נֶאֱמָן:",
              textAlign: TextAlign.center,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 20),
            )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "שְׁמַע יִשרָאֵל ה' אֱלהֵינוּ ה' אֶחָד:",
              textAlign: TextAlign.center,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 28),
            )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "בָּרוּךְ שֵׁם כְּבוד מַלְכוּתו לְעולָם וָעֶד:",
              textAlign: TextAlign.center,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 20),
            )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "וְאָהַבְתָּ אֵת ה' אֱלהֶיךָ בְּכָל לְבָבְךָ וּבְכָל נַפְשְׁךָ וּבְכָל מְאדֶךָ: וְהָיוּ הַדְּבָרִים הָאֵלֶּה אֲשֶׁר אָנכִי מְצַוְּךָ הַיּום עַל לְבָבֶךָ: וְשִׁנַּנְתָּם לְבָנֶיךָ וְדִבַּרְתָּ בָּם בְּשִׁבְתְּךָ בְּבֵיתֶךָ וּבְלֶכְתְּךָ בַדֶּרֶךְ וּבְשָׁכְבְּךָ וּבְקוּמֶךָ: וּקְשַׁרְתָּם לְאות עַל יָדֶךָ וְהָיוּ לְטטָפת בֵּין עֵינֶיךָ: וּכְתַבְתָּם עַל מְזֻזות בֵּיתֶךָ וּבִשְׁעָרֶיךָ:",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "וְהָיָה אִם שָׁמעַ תִּשְׁמְעוּ אֶל מִצְותַי אֲשֶׁר אָנכִי מְצַוֶּה אֶתְכֶם הַיּום לְאַהֲבָה אֶת ה' אֱלהֵיכֶם וּלְעָבְדו בְּכָל לְבַבְכֶם וּבְכָל נַפְשְׁכֶם: וְנָתַתִּי מְטַר אַרְצְכֶם בְּעִתּו יורֶה וּמַלְקושׁ וְאָסַפְתָּ דְגָנֶךָ וְתִירשְׁךָ וְיִצְהָרֶךָ: וְנָתַתִּי עֵשב בְּשדְךָ לִבְהֶמְתֶּךָ וְאָכַלְתָּ וְשבָעְתָּ: הִשָּׁמְרוּ לָכֶם פֶּן יִפְתֶּה לְבַבְכֶם וְסַרְתֶּם וַעֲבַדְתֶּם אֱלהִים אֲחֵרִים וְהִשְׁתַּחֲוִיתֶם לָהֶם: וְחָרָה אַף ה' בָּכֶם וְעָצַר אֶת הַשָּׁמַיִם וְלא יִהְיֶה מָטָר וְהָאֲדָמָה לא תִתֵּן אֶת יְבוּלָהּ וַאֲבַדְתֶּם מְהֵרָה מֵעַל הָאָרֶץ הַטּבָה אֲשֶׁר ה' נתֵן לָכֶם: וְשמְתֶּם אֶת דְּבָרַי אֵלֶּה עַל לְבַבְכֶם וְעַל נַפְשְׁכֶם וּקְשַׁרְתֶּם אתָם לְאות עַל יֶדְכֶם וְהָיוּ לְטוטָפת בֵּין עֵינֵיכֶם: וְלִמַּדְתֶּם אתָם אֶת בְּנֵיכֶם לְדַבֵּר בָּם בְּשִׁבְתְּךָ בְּבֵיתֶךָ וּבְלֶכְתְּךָ בַדֶּרֶךְ וּבְשָׁכְבְּךָ וּבְקוּמֶךָ: וּכְתַבְתָּם עַל מְזוּזות בֵּיתֶךָ וּבִשְׁעָרֶיךָ: לְמַעַן יִרְבּוּ יְמֵיכֶם וִימֵי בְנֵיכֶם עַל הָאֲדָמָה אֲשֶׁר נִשְׁבַּע ה' לַאֲבתֵיכֶם לָתֵת לָהֶם כִּימֵי הַשָּׁמַיִם עַל הָאָרֶץ:",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "וַיּאמֶר ה' אֶל משֶׁה לֵּאמר: דַּבֵּר אֶל בְּנֵי יִשרָאֵל וְאָמַרְתָּ אֲלֵהֶם וְעָשוּ לָהֶם צִיצִת עַל כַּנְפֵי בִגְדֵיהֶם לְדרתָם וְנָתְנוּ עַל צִיצִת הַכָּנָף פְּתִיל תְּכֵלֶת: וְהָיָה לָכֶם לְצִיצִת וּרְאִיתֶם אתו וּזְכַרְתֶּם אֶת כָּל מִצְות ה' וַעֲשיתֶם אתָם וְלא תָתוּרוּ אַחֲרֵי לְבַבְכֶם וְאַחֲרֵי עֵינֵיכֶם אֲשֶׁר אַתֶּם זנִים אַחֲרֵיהֶם: לְמַעַן תִּזְכְּרוּ וַעֲשיתֶם אֶת כָּל מִצְותָי וִהְיִיתֶם קְדשִׁים לֵאלהֵיכֶם: אֲנִי ה' אֱלהֵיכֶם אֲשֶׁר הוצֵאתִי אֶתְכֶם מֵאֶרֶץ מִצְרַיִם לִהְיות לָכֶם לֵאלהִים אֲנִי ה' אֱלהֵיכֶם.",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "אֱמֶת וְיַצִּיב וְנָכון וְקַיָּם וְיָשָׁר וְנֶאֱמָן וְאָהוּב וְחָבִיב וְנֶחְמָד וְנָעִים וְנורָא וְאַדִּיר וּמְתֻקָּן וּמְקֻבָּל וְטוב וְיָפֶה הַדָּבָר הַזֶּה עָלֵינוּ לְעולָם וָעֶד: אֱמֶת. אֱלהֵי עולָם מַלְכֵּנוּ. צוּר יַעֲקב מָגֵן יִשְׁעֵנוּ. לְדר וָדר הוּא קַיָּם וּשְׁמו קַיָּם. וְכִסְאו נָכון. וּמַלְכוּתו וֶאֱמוּנָתו לָעַד קַיֶּמֶת: וּדְבָרָיו חָיִים וְקַיָּמִים. נֶאֱמָנִים וְנֶחֱמָדִים לָעַד וּלְעולְמֵי עולָמִים. ינשק הציצית ויניחם מידיו עַל אֲבותֵינוּ וְעָלֵינוּ. עַל בָּנֵינוּ וְעַל דּורותֵינוּ. וְעַל כָּל דּורות זֶרַע יִשרָאֵל עֲבָדֶיךָ:",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "עַל הָרִאשׁונִים וְעַל הָאַחֲרונִים. דָּבָר טוב וְקַיָּם לְעולָם וָעֶד. אֱמֶת וֶאֱמוּנָה. חק וְלא יַעֲבר. אֱמֶת. שָׁאַתָּה הוּא ה' אֱלהֵינוּ וֵאלהֵי אֲבותֵינוּ. מַלְכֵּנוּ מֶלֶךְ אֲבותֵינוּ. גּואֲלֵנוּ גּואֵל אֲבותֵינוּ. יוצְרֵנוּ צוּר יְשׁוּעָתֵנוּ. פּודֵנוּ וּמַצִּילֵנוּ מֵעולָם שְׁמֶךָ. אֵין אֱלהִים זוּלָתֶךָ:",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "עֶזְרַת אֲבותֵינוּ אַתָּה הוּא מֵעולָם. מָגֵן וּמושִׁיעַ לִבְנֵיהֶם אַחֲרֵיהֶם בְּכָל דּור וָדור. בְּרוּם עולָם מושָׁבֶךָ. וּמִשְׁפָּטֶיךָ וְצִדְקָתְךָ עַד אַפְסֵי אָרֶץ: אַשְׁרֵי אִישׁ שֶׁיִּשְׁמַע לְמִצְותֶיךָ וְתורָתְךָ וּדְבָרְךָ יָשים עַל לִבּו: אֱמֶת. אַתָּה הוּא אָדון לְעַמֶּךָ. וּמֶלֶךְ גִּבּור לָרִיב רִיבָם: אֱמֶת. אַתָּה הוּא רִאשׁון וְאַתָּה הוּא אַחֲרון. וּמִבַּלְעָדֶיךָ אֵין לָנוּ מֶלֶךְ גּואֵל וּמושִׁיעַ: מִמִּצְרַיִם גְּאַלְתָּנוּ ה' אֱלהֵינוּ. וּמִבֵּית עֲבָדִים פְּדִיתָנוּ. כָּל בְּכורֵיהֶם הָרָגְתָּ. וּבְכורְךָ גָּאָלְתָּ. וְיַם סוּף בָּקַעְתָּ. וְזֵדִים טִבַּעְתָּ. וִידִידִים הֶעֱבַרְתָּ. וַיְכַסּוּ מַיִם צָרֵיהֶם. אֶחָד מֵהֶם לא נותָר: עַל זאת שִׁבְּחוּ אֲהוּבִים וְרומְמוּ אֵל. וְנָתְנוּ יְדִידִים זְמִירות שִׁירות וְתִשְׁבָּחות. בְּרָכות וְהודָאות לְמֶּלֶךְ אֵל חַי וְקַיָּם: רָם וְנִשּא. גָּדול וְנורָא. מַשְׁפִּיל גֵּאִים. וּמַגְבִּיהַּ שְׁפָלִים. מוצִיא אֲסִירִים. וּפודֶה עֲנָוִים. וְעוזֵר דַּלִּים. וְעונֶה לְעַמּו בְּעֵת שַׁוְּעָם אֵלָיו: תְּהִלּות לְאֵל עֶלְיון. בָּרוּךְ הוּא וּמְברָךְ. משֶׁה וּבְנֵי יִשרָאֵל לְךָ עָנוּ שִׁירָה בְּשמְחָה רַבָּה. וְאָמְרוּ כֻלָּם",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "מִי כָמכָה בָּאֵלִים ה'. מִי כָּמכָה נֶאְדָּר בַּקּדֶשׁ. נורָא תְהִלּת. עשה פֶלֶא:",
              textAlign: TextAlign.center,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "שִׁירָה חֲדָשָׁה שִׁבְּחוּ גְאוּלִים לְשִׁמְךָ עַל שפַת הַיָּם. יַחַד כֻּלָּם הודוּ וְהִמְלִיכוּ וְאְָמְרוּ:",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              " ה' יִמְלךְ לְעולָם וָעֶד:",
              textAlign: TextAlign.center,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "צוּר יִשרָאֵל, קוּמָה בְּעֶזְרַת יִשרָאֵל, וּפְדֵה כִנְאֻמֶךָ יְהוּדָה וְיִשרָאֵל. גּאֲלֵנוּ ה' צְבָאות שְׁמו קְדושׁ יִשרָאֵל. בָּרוּךְ אַתָּה ה', גָּאַל יִשרָאֵל:",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
      ],
    ),
    // Shmonei Esrei
    Column(
      children: [
        Padding(padding: const EdgeInsets.all(16.0), child: Container()),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "אֲדנָי שפָתַי תִּפְתָּח וּפִי יַגִּיד תְּהִלָּתֶךָ:",
              textAlign: TextAlign.center,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "בָּרוּךְ אַתָּה ה' אֱלהֵינוּ וֵאלהֵי אֲבותֵינוּ. אֱלהֵי אַבְרָהָם. אֱלהֵי יִצְחָק. וֵאלהֵי יַעֲקב. הָאֵל הַגָּדול הַגִּבּור וְהַנּורָא אֵל עֶלְיון. גּומֵל חֲסָדִים טובִים. וְקונֵה הַכּל. וְזוכֵר חַסְדֵּי אָבות. וּמֵבִיא גואֵל לִבְנֵי בְנֵיהֶם לְמַעַן שְׁמו בְּאַהֲבָה.",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "מֶלֶךְ עוזֵר וּמושִׁיעַ וּמָגֵן: בָּרוּךְ אַתָּה ה', מָגֵן אַבְרָהָם:",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "אַתָּה גִּבּור לְעולָם אֲדנָי. מְחַיֵּה מֵתִים אַתָּה רַב לְהושִׁיעַ:",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        JewishCalendar.fromDateTime(DateTime.now()).isWinter()
            ? Padding(
                padding: const EdgeInsets.all(8.0),
                child: Text(
                  "מַשִּׁיב הָרוּחַ וּמורִיד הַגֶּשֶׁׁם,",
                  textAlign: TextAlign.justify,
                  textDirection: TextDirection.rtl,
                  style: GoogleFonts.suezOne(fontSize: 24),
                ))
            : Padding(
                padding: const EdgeInsets.all(8.0),
                child: Text(
                  "מַשִּׁיב הָרוּחַ וּמורִיד הַטַּל,",
                  textAlign: TextAlign.justify,
                  textDirection: TextDirection.rtl,
                  style: GoogleFonts.suezOne(fontSize: 24),
                )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "מְכַלְכֵּל חַיִּים בְּחֶסֶד. מְחַיֶּה מֵתִים בְּרַחֲמִים רַבִּים. סומֵךְ נופְלִים. וְרופֵא חולִים וּמַתִּיר אֲסוּרִים. וּמְקַיֵּם אֱמוּנָתו לִישֵׁנֵי עָפָר. מִי כָמוךָ בַּעַל גְּבוּרות וּמִי דומֶה לָּךְ. מֶלֶךְ מֵמִית וּמְחַיֶּה וּמַצְמִיחַ יְשׁוּעָה.",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "וְנֶאֱמָן אַתָּה לְהַחֲיות מֵתִים: בָּרוּךְ אַתָּה ה', מְחַיֵּה הַמֵּתִים.",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Card(
              child: Padding(
                padding: const EdgeInsets.all(8.0),
                child: ExpansionTile(
                  title: Center(
                      child: Text(
                    "Keddusha",
                  )),
                  children: [
                    Text(
                      "בחזרת הש”ץ:\nנְקַדֵּשׁ אֶת שִׁמְךָ בָּעולָם. כְּשֵׁם שֶׁמַּקְדִּישִׁים אותו בִּשְׁמֵי מָרום. כַּכָּתוּב עַל יַד נְבִיאֶךָ: וְקָרָא זֶה אֶל זֶה וְאָמַר:\nקו”ח: קָדושׁ. קָדושׁ. קָדושׁ ה' צְבָאות. מְלא כָל הָאָרֶץ כְּבודו:\nחזן: לְעֻמָתָם בָּרוּךְ יאמֵרוּ:\nקו”ח: בָּרוּךְ כְּבוד ה' מִמְּקומו:\nחזן: וּבְדִבְרֵי קָדְשְׁךָ כָּתוּב לֵאמר:",
                      textAlign: TextAlign.justify,
                      textDirection: TextDirection.rtl,
                      style: GoogleFonts.suezOne(fontSize: 24),
                    ),
                    JewishCalendar.fromDateTime(DateTime.now()).isTenDays()
                        ? Text(
                            "לחזן: לְדור וָדור נַגִּיד גָּדְלֶךָ וּלְנֵצַח נְצָחִים קְדֻשָּׁתְךָ נַקְדִּישׁ. וְשִׁבְחֲךָ אֱלהֵינוּ מִפִּינוּ לא יָמוּשׁ לְעולָם וָעֶד. כִּי אֵל מֶלֶךְ גָּדול וְקָדושׁ אָתָּה: בָּרוּךְ אַתָּה ה' הַמֶּלֶךְ הַקָּדושׁ.",
                            textAlign: TextAlign.justify,
                            textDirection: TextDirection.rtl,
                            style: GoogleFonts.suezOne(fontSize: 24),
                          )
                        : Text(
                            "לחזן: לְדור וָדור נַגִּיד גָּדְלֶךָ וּלְנֵצַח נְצָחִים קְדֻשָּׁתְךָ נַקְדִּישׁ. וְשִׁבְחֲךָ אֱלהֵינוּ מִפִּינוּ לא יָמוּשׁ לְעולָם וָעֶד. כִּי אֵל מֶלֶךְ גָּדול וְקָדושׁ אָתָּה: בָּרוּךְ אַתָּה ה' הָאֵל הַקָּדושׁ.",
                            textAlign: TextAlign.justify,
                            textDirection: TextDirection.rtl,
                            style: GoogleFonts.suezOne(fontSize: 24),
                          )
                  ],
                ),
              ),
            )),
        JewishCalendar.fromDateTime(DateTime.now()).isTenDays()
            ? Padding(
                padding: const EdgeInsets.all(8.0),
                child: Text(
                  "אַתָּה קָדושׁ וְשִׁמְךָ קָדושׁ וּקְדושִׁים בְּכָל יום יְהַלְּלוּךָ סֶּלָה: בָּרוּךְ אַתָּה ה', הַמֶּלֶךְ הַקָּדושׁ",
                  textAlign: TextAlign.justify,
                  textDirection: TextDirection.rtl,
                  style: GoogleFonts.suezOne(fontSize: 24),
                ))
            : Padding(
                padding: const EdgeInsets.all(8.0),
                child: Text(
                  "אַתָּה קָדושׁ וְשִׁמְךָ קָדושׁ וּקְדושִׁים בְּכָל יום יְהַלְּלוּךָ סֶּלָה: בָּרוּךְ אַתָּה ה', הָאֵל הַקָּדושׁ",
                  textAlign: TextAlign.justify,
                  textDirection: TextDirection.rtl,
                  style: GoogleFonts.suezOne(fontSize: 24),
                )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "אַתָּה חונֵן לְאָדָם דַּעַת. וּמְלַמֵּד לֶאֱנושׁ בִּינָה: חָנֵּנוּ מֵאִתְּךָ דֵעָה בִּינָה וְהַשכֵּל. בָּרוּךְ אַתָּה ה', חונֵן הַדָּעַת:",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "הֲשִׁיבֵנוּ אָבִינוּ לְתורָתֶךָ, וְקָרְבֵנוּ מַלְכֵּנוּ לַעֲבודָתֶךָ, וְהַחֲזִירֵנוּ בִּתְשׁוּבָה שְׁלֵמָה לְפָנֶיךָ. בָּרוּךְ אַתָּה ה', הָרוצֶה בִּתְשׁוּבָה:",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "סְלַח לָנוּ אָבִינוּ כִּי חָטָאנוּ. מְחַל לָנוּ מַלְכֵּנוּ כִּי פָשָׁעְנוּ. כִּי מוחֵל וְסולֵחַ אַתָּה. בָּרוּךְ אַתָּה ה', חַנּוּן הַמַּרְבֶּה לִסְלחַ:",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "רְאֵה נָא בְעָנְיֵנוּ, וְרִיבָה רִיבֵנוּ, וּגְאָלֵנוּ מְהֵרָה לְמַעַן שְׁמֶךָ, כִּי גּואֵל חָזָק אַתָּה. בָּרוּךְ אַתָּה ה', גּואֵל יִשרָאֵל:",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "רְפָאֵנוּ ה' וְנֵרָפֵא, הושִׁיעֵנוּ וְנִוָּשֵׁעָה, כִּי תְהִלָּתֵנוּ אָתָּה. וְהַעֲלֵה רְפוּאָה שְׁלֵמָה לְכָל מַכּותֵינוּ, כִּי אֵל מֶלֶךְ רופֵא נֶאֱמָן וְרַחֲמָן אַתָּה. בָּרוּךְ אַתָּה ה', רופֵא חולֵי עַמּו יִשרָאֵל.",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        JewishCalendar.fromDateTime(DateTime.now()).isWinter()
            ? Padding(
                padding: const EdgeInsets.all(8.0),
                child: Text(
                  "בָּרֵךְ עָלֵינוּ ה' אֱלהֵינוּ אֶת הַשָּׁנָה הַזּאת וְאֶת כָּל מִינֵי תְבוּאָתָהּ לְטובָה. וְתֵן טַל וּמָטָר לִבְרָכָה עַל פְּנֵי הָאֲדָמָה וְשבְּעֵנוּ מִטּוּבָהּ. וּבָרֵךְ שְׁנָתֵנוּ כַּשָּׁנִים הַטּובות. בָּרוּךְ אַתָּה ה', מְבָרֵךְ הַשָּׁנִים:",
                  textAlign: TextAlign.justify,
                  textDirection: TextDirection.rtl,
                  style: GoogleFonts.suezOne(fontSize: 24),
                ))
            : Padding(
                padding: const EdgeInsets.all(8.0),
                child: Text(
                  "בָּרֵךְ עָלֵינוּ ה' אֱלהֵינוּ אֶת הַשָּׁנָה הַזּאת וְאֶת כָּל מִינֵי תְבוּאָתָהּ לְטובָה. וְתֵן בְּרָכָה עַל פְּנֵי הָאֲדָמָה וְשבְּעֵנוּ מִטּוּבָהּ. וּבָרֵךְ שְׁנָתֵנוּ כַּשָּׁנִים הַטּובות. בָּרוּךְ אַתָּה ה', מְבָרֵךְ הַשָּׁנִים:",
                  textAlign: TextAlign.justify,
                  textDirection: TextDirection.rtl,
                  style: GoogleFonts.suezOne(fontSize: 24),
                )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "תְּקַע בְּשׁופָר גָּדול לְחֵרוּתֵנוּ. וְשא נֵס לְקַבֵּץ גָּלֻיּותֵינוּ. וְקַבְּצֵנוּ יַחַד מֵאַרְבַּע כַּנְפות הָאָרֶץ. בָּרוּךְ אַתָּה ה', מְקַבֵּץ נִדְחֵי עַמּו יִשרָאֵל:",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        JewishCalendar.fromDateTime(DateTime.now()).isTenDays()
            ? Padding(
                padding: const EdgeInsets.all(8.0),
                child: Text(
                  "הָשִׁיבָה שׁופְטֵינוּ כְּבָרִאשׁונָה וְיועֲצֵינוּ כְּבַתְּחִלָּה. וְהָסֵר מִמֶּנּוּ יָגון וַאֲנָחָה. וּמְלךְ עָלֵינוּ אַתָּה ה' לְבַדְּךָ בְּחֶסֶד וּבְרַחֲמִים. וְצַדְּקֵנוּ בַּמִשְׁפָּט. בָּרוּךְ אַתָּה ה',הַמֶּלֶךְ הַמִשְׁפָּט:",
                  textAlign: TextAlign.justify,
                  textDirection: TextDirection.rtl,
                  style: GoogleFonts.suezOne(fontSize: 24),
                ))
            : Padding(
                padding: const EdgeInsets.all(8.0),
                child: Text(
                  "הָשִׁיבָה שׁופְטֵינוּ כְּבָרִאשׁונָה וְיועֲצֵינוּ כְּבַתְּחִלָּה. וְהָסֵר מִמֶּנּוּ יָגון וַאֲנָחָה. וּמְלךְ עָלֵינוּ אַתָּה ה' לְבַדְּךָ בְּחֶסֶד וּבְרַחֲמִים. וְצַדְּקֵנוּ בַּמִשְׁפָּט. בָּרוּךְ אַתָּה ה', מֶלֶךְ אוהֵב צְדָקָה וּמִשְׁפָּט:",
                  textAlign: TextAlign.justify,
                  textDirection: TextDirection.rtl,
                  style: GoogleFonts.suezOne(fontSize: 24),
                )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "וְלַמַּלְשִׁינִים אַל תְּהִי תִקְוָה. וְכָל הָרִשְׁעָה כְּרֶגַע תּאבֵד. וְכָל אויְבֵי עַמְּךָ מְהֵרָה יִכָּרֵתוּ. וְהַזֵדִים מְהֵרָה תְעַקֵּר וּתְשַׁבֵּר וּתְמַגֵּר וְתַכְנִיעַ בִּמְהֵרָה בְיָמֵינוּ. בָּרוּךְ אַתָּה ה', שׁובֵר אויְבִים וּמַכְנִיעַ זֵדִים:",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "עַל הַצַּדִּיקִים וְעַל הַחֲסִידִים. וְעַל זִקְנֵי עַמְּךָ בֵּית יִשרָאֵל. וְעַל פְּלֵיטַת סופְרֵיהֶם. וְעַל גֵּרֵי הַצֶּדֶק. וְעָלֵינוּ. יֶהֱמוּ רַחֲמֶיךָ ה' אֱלהֵינוּ. וְתֵן שכָר טוב לְכָל הַבּוטְחִים בְּשִׁמְךָ בֶּאֱמֶת. וְשים חֶלְקֵנוּ עִמָּהֶם לְעולָם וְלא נֵבושׁ כִּי בְךָ בָטָחְנוּ. בָּרוּךְ אַתָּה ה', מִשְׁעָן וּמִבְטָח לַצַּדִּיקִים:",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "וְלִירוּשָׁלַיִם עִירְךָ בְּרַחֲמִים תָּשׁוּב. וְתִשְׁכּן בְּתוכָהּ כַּאֲשֶׁר דִּבַּרְתָּ. וּבְנֵה אותָהּ בְּקָרוב בְּיָמֵינוּ בִּנְיַן עולָם. וְכִסֵּא דָוִד מְהֵרָה לְתוכָהּ תָּכִין: בָּרוּךְ אַתָּה ה', בּונֵה יְרוּשָׁלָיִם:",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "אֶת צֶמַח דָּוִד עַבְדְּךָ מְהֵרָה תַצְמִיחַ. וְקַרְנו תָּרוּם בִּישׁוּעָתֶךָ. כִּי לִישׁוּעָתְךָ קִוִּינוּ כָּל הַיּום. בָּרוּךְ אַתָּה ה', מַצְמִיחַ קֶרֶן יְשׁוּעָה:",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "שְׁמַע קולֵנוּ. ה' אֱלהֵינוּ חוּס וְרַחֵם עָלֵינוּ. וְקַבֵּל בְּרַחֲמִים וּבְרָצון אֶת תְּפִלָּתֵנוּ. כִּי אֵל שׁומֵעַ תְּפִלּות וְתַחֲנוּנִים אָתָּה. וּמִלְּפָנֶיךָ מַלְכֵּנוּ. רֵיקָם אַל תְּשִׁיבֵנוּ: כִּי אַתָּה שׁומֵעַ תְּפִלַּת עַמְּךָ יִשרָאֵל בְּרַחֲמִים. בָּרוּךְ אַתָּה ה', שׁומֵעַ תְּפִלָּה:",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "רְצֵה ה' אֱלהֵינוּ בְּעַמְּךָ יִשרָאֵל וּבִתְפִלָּתָם וְהָשֵׁב אֶת הָעֲבודָה לִדְבִיר בֵּיתֶךָ. וְאִשֵּׁי יִשרָאֵל וּתְפִלָּתָם. בְּאַהֲבָה תְקַבֵּל בְּרָצון. וּתְהִי לְרָצון תָּמִיד עֲבודַת יִשרָאֵל עַמֶּךָ:",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        JewishCalendar.fromDateTime(DateTime.now()).isRoshChodesh()
            ? Padding(
                padding: const EdgeInsets.all(8.0),
                child: Text(
                  "אֱלהֵינוּ וֵאלהֵי אֲבותֵינוּ. יַעֲלֶה וְיָבוא וְיַגִּיעַ. וְיֵרָאֶה וְיֵרָצֶה וְיִשָּׁמַע. וְיִפָּקֵד וְיִזָּכֵר זִכְרונֵנוּ וּפִקְדונֵנוּ וְזִכְרון אֲבותֵינוּ. וְזִכְרון מָשִׁיחַ בֶּן דָּוִד עַבְדֶּךָ. וְזִכְרון יְרוּשָׁלַיִם עִיר קָדְשֶׁךָ. וְזִכְרון כָּל עַמְּךָ בֵּית יִשרָאֵל. לְפָנֶיךָ. לִפְלֵיטָה לְטובָה. לְחֵן וּלְחֶסֶד וּלְרַחֲמִים. לְחַיִּים וּלְשָׁלום בְּיום ראשׁ הַחדֶשׁ הַזֶּה. זָכְרֵנוּ ה' אֱלהֵינוּ בּו לְטובָה. וּפָקְדֵנוּ בו לִבְרָכָה. וְהושִׁיעֵנוּ בו לְחַיִּים. וּבִדְבַר יְשׁוּעָה וְרַחֲמִים חוּס וְחָנֵּנוּ וְרַחֵם עָלֵינוּ וְהושִׁיעֵנוּ. כִּי אֵלֶיךָ עֵינֵינוּ. כִּי אֵל מֶלֶךְ חַנּוּן וְרַחוּם אָתָּה:",
                  textAlign: TextAlign.justify,
                  textDirection: TextDirection.rtl,
                  style: GoogleFonts.suezOne(fontSize: 24),
                ))
            : Container(),
        // TODO: Add cholhamoed pessah and succoth
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "וְתֶחֱזֶינָה עֵינֵינוּ בְּשׁוּבְךָ לְצִיּון בְּרַחֲמִים: בָּרוּךְ אַתָּה ה', הַמַּחֲזִיר שְׁכִינָתו לְצִיּון:",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "מודִים אֲנַחְנוּ לָךְ. שָׁאַתָּה הוּא ה' אֱלהֵינוּ וֵאלהֵי אֲבותֵינוּ לְעולָם וָעֶד. צוּר חַיֵּינוּ. מָגֵן יִשְׁעֵנוּ אַתָּה הוּא לְדור וָדור: נודֶה לְּךָ וּנְסַפֵּר תְּהִלָּתֶךָ עַל חַיֵּינוּ הַמְּסוּרִים בְּיָדֶךָ. וְעַל נִשְׁמותֵינוּ הַפְּקוּדות לָךְ. וְעַל נִסֶּיךָ שֶׁבְּכָל יום עִמָּנוּ. וְעַל נִפְלְאותֶיךָ וְטובותֶיךָ שֶׁבְּכָל עֵת. עֶרֶב וָבקֶר וְצָהֳרָיִם: הַטּוב כִּי לא כָלוּ רַחֲמֶיךָ. וְהַמְרַחֵם כִּי לא תַמּוּ חֲסָדֶיךָ. מֵעולָם קִוִּינוּ לָךְ:",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Card(
              child: Padding(
                padding: const EdgeInsets.all(8.0),
                child: ExpansionTile(
                  title: Center(
                      child: Text(
                    "Modim D'Rabanan",
                  )),
                  children: [
                    Text(
                      "מודִים אֲנַחְנוּ לָךְ. שָׁאַתָּה הוּא ה' אֱלהֵינוּ וֵאלהֵי אֲבותֵינוּ. אֱלהֵי כָל בָּשר. יוצְרֵנוּ יוצֵר בְּרֵאשִׁית. בְּרָכות וְהודָאות לְשִׁמְךָ הַגָּדול וְהַקָּדושׁ. עַל שֶׁהֶחֱיִיתָנוּ וְקִיַּמְתָּנוּ. כֵּן תְּחַיֵּנוּ וּתְקַיְּמֵנוּ. וְתֶאֱסוף גָּלֻיּותֵינוּ לְחַצְרות קָדְשֶׁךָ. לִשְׁמור חֻקֶּיךָ. וְלַעֲשות רְצונֶךָ. וּלְעָבְדְךָ בְּלֵבָב שָׁלֵם. עַל שֶׁאָֽנוּ מודִים לָךְ. בָּרוּךְ  אַתָּה ה' אֵל הַהודָאוֹת:",
                      textAlign: TextAlign.justify,
                      textDirection: TextDirection.rtl,
                      style: GoogleFonts.suezOne(fontSize: 24),
                    ),
                  ],
                ),
              ),
            )),
        JewishCalendar.fromDateTime(DateTime.now()).isChanukah()
            ? Padding(
                padding: const EdgeInsets.all(8.0),
                child: Text(
                  "עַל הַנִּסִּים וְעַל הַפֻּרְקָן וְעַל הַגְּבוּרות וְעַל הַתְּשׁוּעות וְעַל הַמִּלְחָמות שֶׁעָשיתָ לַאֲבותֵינוּ בַּיָּמִים הָהֵם בִּזְּמַן הַזֶּה:\n בִּימֵי מַתִּתְיָהוּ בֶּן יוחָנָן כּהֵן גָּדול חַשְׁמונַאִי וּבָנָיו. כְּשֶׁעָמְדָה מַלְכוּת יָוָן הָרְשָׁעָה עַל עַמְּךָ יִשרָאֵל לְהַשְׁכִּיחָם תּורָתֶךָ וּלְהַעֲבִירָם מֵחֻקֵּי רְצונֶךָ: וְאַתָּה בְּרַחֲמֶיךָ הָרַבִּים עָמַדְתָּ לָהֶם בְּעֵת צָרָתָם. רַבְתָּ אֶת רִיבָם. דַנְתָּ אֶת דִּינָם. נָקַמְתָּ אֶת נִקְמָתָם. מָסַרְתָּ גִבּורִים בְּיַד חַלָּשִׁים. וְרַבִּים בְּיַד מְעַטִּים. וּטְמֵאִים בְּיַד טְהורִים. וּרְשָׁעִים בְּיַד צַדִּיקִים. וְזֵדִים בְּיַד עוסְקֵי תורָתֶךָ. וּלְךָ עָשיתָ שֵׁם גָּדול וְקָדושׁ בְּעולָמֶךָ. וּלְעַמְּךָ יִשרָאֵל עָשיתָ תְּשׁוּעָה גְדולָה וּפֻרְקָן כְּהַיּום הַזֶּה: וְאַחַר כֵּן בָּאוּ בָנֶיךָ לִדְבִיר בֵּיתֶךָ. וּפִנּוּ אֶת הֵיכָלֶךָ. וְטִהֲרוּ אֶת מִקְדָּשֶׁךָ. וְהִדְלִיקוּ נֵרות בְּחַצְרות קָדְשֶׁךָ. וְקָבְעוּ שְׁמונַת יְמֵי חֲנֻכָּה אֵלּוּ. לְהודות וּלְהַלֵּל לְשִׁמְךָ הַגָּדול:",
                  textAlign: TextAlign.justify,
                  textDirection: TextDirection.rtl,
                  style: GoogleFonts.suezOne(fontSize: 24),
                ))
            : Container(),
        JewishCalendar.fromDateTime(DateTime.now()).isPurim()
            ? Padding(
                padding: const EdgeInsets.all(8.0),
                child: Text(
                  "עַל הַנִּסִּים וְעַל הַפֻּרְקָן וְעַל הַגְּבוּרות וְעַל הַתְּשׁוּעות וְעַל הַמִּלְחָמות שֶׁעָשיתָ לַאֲבותֵינוּ בַּיָּמִים הָהֵם בִּזְּמַן הַזֶּה:\nבִּימֵי מָרְדְּכַי וְאֶסְתֵּר בְּשׁוּשַׁן הַבִּירָה. כְּשֶׁעָמַד עֲלֵיהֶם הָמָן הָרָשָׁע. בִּקֵּשׁ לְהַשְׁמִיד לַהֲרוג וּלְאַבֵּד אֶת כָּל הַיְּהוּדִים מִנַּעַר וְעַד זָקֵן טַף וְנָשִׁים בְּיום אֶחָד. בִּשְׁלשָׁה עָשר לְחדֶשׁ שְׁנֵים עָשר. הוּא חדֶשׁ אֲדָר. וּשְׁלָלָם לָבוז: וְאַתָּה בְּרַחֲמֶיךָ הָרַבִּים. הֵפַרְתָּ אֶת עֲצָתו. וְקִלְקַלְתָּ אֶת מַחֲשַׁבְתּו. וַהֲשֵׁבותָ לּו גְּמוּלו בְּראשׁו. וְתָלוּ אותו וְאֶת בָּנָיו עַל הָעֵץ.",
                  textAlign: TextAlign.justify,
                  textDirection: TextDirection.rtl,
                  style: GoogleFonts.suezOne(fontSize: 24),
                ))
            : Container(),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "וְעַל כֻּלָּם יִתְבָּרַךְ וְיִתְרומַם שִׁמְךָ מַלְכֵּנוּ תָּמִיד לְעולָם וָעֶד:",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        JewishCalendar.fromDateTime(DateTime.now()).isTenDays()
            ? Padding(
                padding: const EdgeInsets.all(8.0),
                child: Text(
                  "וּכְתב לְחַיִּים טובִים כָּל בְּנֵי בְרִיתֶךָ:",
                  textAlign: TextAlign.justify,
                  textDirection: TextDirection.rtl,
                  style: GoogleFonts.suezOne(fontSize: 24),
                ))
            : Container(),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "וְכל הַחַיִּים יודוּךָ סֶּלָה. וִיהַלְלוּ אֶת שִׁמְךָ בֶּאֱמֶת. הָאֵל יְשׁוּעָתֵנוּ וְעֶזְרָתֵנוּ סֶלָה. בָּרוּךְ אַתָּה ה', הַטּוב שִׁמְךָ וּלְךָ נָאֶה לְהודות:",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "שים שָׁלום טובָה וּבְרָכָה. חֵן וָחֶסֶד וְרַחֲמִים עָלֵינוּ וְעַל כָּל יִשרָאֵל עַמֶּךָ. בָּרְכֵנוּ אָבִינוּ כֻּלָּנוּ כְּאֶחָד בְּאור פָּנֶיךָ. כִּי בְאור פָּנֶיךָ נָתַתָּ לָּנוּ ה' אֱלהֵינוּ תּורַת חַיִּים וְאַהֲבַת חֶסֶד. וּצְדָקָה וּבְרָכָה וְרַחֲמִים וְחַיִּים וְשָׁלום. וְטוב בְּעֵינֶיךָ לְבָרֵךְ אֶת כָּל עַמְּךָ יִשרָאֵל בְּכָל עֵת וּבְכָל שָׁעָה בִּשְׁלומֶךָ:",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        JewishCalendar.fromDateTime(DateTime.now()).isTenDays()
            ? Padding(
                padding: const EdgeInsets.all(8.0),
                child: Text(
                  "בְּסֵפֶר חַיִּים. בְּרָכָה וְשָׁלום. וּפַרְנָסָה טובָה. נִזָּכֵר וְנִכָּתֵב לְפָנֶיךָ. אֲנַחְנוּ וְכָל עַמְּךָ בֵּית יִשרָאֵל. לְחַיִּים טובִים וּלְשָׁלום:",
                  textAlign: TextAlign.justify,
                  textDirection: TextDirection.rtl,
                  style: GoogleFonts.suezOne(fontSize: 24),
                ))
            : Container(),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "בָּרוּךְ אַתָּה ה', הַמְבָרֵךְ אֶת עַמּו יִשרָאֵל בַּשָּׁלום:",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "אֱלהַי. נְצר לְשׁונִי מֵרָע וּשפָתַי מִדַּבֵּר מִרְמָה. וְלִמְקַלְלַי נַפְשִׁי תִדּם. וְנַפְשִׁי כֶּעָפָר לַכּל תִּהְיֶה. פְּתַח לִבִּי בְּתורָתֶךָ. וּבְמִצְותֶיךָ תִּרְדּף נַפְשִׁי. וְכָל הַחושְׁבִים עָלַי רָעָה. מְהֵרָה הָפֵר עֲצָתָם וְקַלְקֵל מַחֲשַׁבְתָּם: עֲשה לְמַעַן שְׁמֶךָ. עֲשה לְמַעַן יְמִינֶךָ. עֲשה לְמַעַן קְדֻשָּׁתֶךָ. עֲשה לְמַעַן תּורָתֶךָ. לְמַעַן יֵחָלְצוּן יְדִידֶיךָ הושִׁיעָה יְמִינְךָ וַעֲנֵנִי: יִהְיוּ לְרָצון אִמְרֵי פִי וְהֶגְיון לִבִּי לְפָנֶיךָ. ה' צוּרִי וְגואֲלִי: עשה שָׁלום בִּמְרומָיו. הוּא יַעֲשה שָׁלום עָלֵינוּ וְעַל כָּל יִשרָאֵל. וְאִמְרוּ אָמֵן:",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "יְהִי רָצון מִלְּפָנֶיךָ ה' אֱלהֵינוּ וֵאלהֵי אֲבותֵינוּ. שֶׁיִּבָּנֶה בֵּית הַמִּקְדָּשׁ בִּמְהֵרָה בְיָמֵינוּ. וְתֵן חֶלְקֵנוּ בְּתורָתֶךָ:",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
      ],
    ),
    // Hallel
    (JewishCalendar.fromDateTime(DateTime.now()).isHallel())
        ? Column(
            children: [
              (JewishCalendar.fromDateTime(DateTime.now()).isFullHallel())
                  ? Padding(
                      padding: const EdgeInsets.all(16.0),
                      child: Text(
                        "בָּרוּךְ אַתָּה ה' אֱלהֵינוּ מֶלֶךְ הָעולָם. אֲשֶׁר קִדְּשָׁנוּ בְּמִצְותָיו וְצִוָּנוּ לִקְרא אֶת הַהַלֵּל:",
                        textAlign: TextAlign.justify,
                        textDirection: TextDirection.rtl,
                        style: GoogleFonts.suezOne(fontSize: 24),
                      ))
                  : Container(),
              Padding(
                  padding: const EdgeInsets.all(8.0),
                  child: Text(
                    "הַלְלוּיָהּ הַלְלוּ עַבְדֵי יְהֹוָה הַלְלוּ אֶת שֵׁם יְהֹוָה: יְהִי שֵׁם יְהֹוָה מְבֹרָךְ מֵעַתָּה וְעַד־עוֹלָם: מִמִּזְרַח־שֶֽׁמֶשׁ עַד־מְבוֹאוֹ מְהֻלָּל שֵׁם יְהֹוָה: רָם עַל־כָּל־גּוֹיִם יְהֹוָה עַל הַשָּׁמַֽיִם כְּבוֹדוֹ: מִי כַּיהֹוָה אֱלֹהֵֽינוּ הַמַּגְבִּיהִי לָשָֽׁבֶת: הַמַּשְׁפִּילִי לִרְאוֹת בַּשָּׁמַֽיִם וּבָאָֽרֶץ: מְקִימִי מֵעָפָר דָּל מֵאַשְׁפֹּת יָרִים אֶבְיוֹן: לְהוֹשִׁיבִי עִם־נְדִיבִים עִם נְדִיבֵי עַמּוֹ: מוֹשִׁיבִי עֲקֶֽרֶת הַבַּֽיִת אֵם־הַבָּנִים שְׂמֵחָה הַלְלוּיָהּ:",
                    textAlign: TextAlign.justify,
                    textDirection: TextDirection.rtl,
                    style: GoogleFonts.suezOne(fontSize: 24),
                  )),
              Padding(
                  padding: const EdgeInsets.all(8.0),
                  child: Text(
                    "בְּצֵאת יִשְׂרָאֵל מִמִּצְרָֽיִם בֵּית יַעֲקֹב מֵעַם לֹעֵז: הָיְתָה יְהוּדָה לְקָדְשׁוֹ יִשְׂרָאֵל מַמְשְׁלוֹתָיו: הַיָּם רָאָה וַיָּנֹס הַיַּרְדֵּן יִסֹּב לְאָחוֹר: הֶהָרִים רָקְדוּ כְאֵילִים גְּבָעוֹת כִּבְנֵי־צֹאן: מַה־לְּךָ הַיָּם כִּי תָנוּס הַיַּרְדֵּן תִּסֹּב לְאָחוֹר: הֶהָרִים תִּרְקְדוּ כְאֵילִים גְּבָעוֹת כִּבְנֵי־צֹאן: מִלִּפְנֵי אָדוֹן חֽוּלִי אָֽרֶץ מִלִּפְנֵי אֱלֽוֹהַּ יַעֲקֹב: הַהֹפְכִי הַצּוּר אֲגַם־מָֽיִם חַלָּמִישׁ לְמַעְיְנוֹ־מָֽיִם:",
                    textAlign: TextAlign.justify,
                    textDirection: TextDirection.rtl,
                    style: GoogleFonts.suezOne(fontSize: 24),
                  )),
              JewishCalendar.fromDateTime(DateTime.now()).isFullHallel()
              ?Padding(
                  padding: const EdgeInsets.all(8.0),
                  child: Text(
                    "לֹא לָֽנוּ יְהֹוָה לֹא לָֽנוּ כִּי לְשִׁמְךָ תֵּן כָּבוֹד עַל־חַסְדְּךָ עַל־אֲמִתֶּֽךָ: לָֽמָּה יֹאמְרוּ הַגּוֹיִם אַיֵּה־נָא אֱלֹהֵיהֶם: וֵאלֹהֵֽינוּ בַשָּׁמָֽיִם כֹּל אֲשֶׁר־חָפֵץ עָשָׂה: עֲצַבֵּיהֶם כֶּֽסֶף וְזָהָב מַעֲשֵׂה יְדֵי אָדָם: פֶּה־לָהֶם וְלֹא יְדַבֵּֽרוּ עֵינַֽיִם לָהֶם וְלֹא יִרְאוּ: אָזְנַֽיִם לָהֶם וְלֹא יִשְׁמָֽעוּ אַף לָהֶם וְלֹא יְרִיחוּן: יְדֵיהֶם וְלֹא יְמִישׁוּן רַגְלֵיהֶם וְלֹא יְהַלֵּֽכוּ לֹא־יֶהְגּוּ בִּגְרוֹנָם: כְּמוֹהֶם יִהְיוּ עֹשֵׂיהֶם כֹּל אֲשֶׁר־בֹּטֵֽחַ בָּהֶם: יִשְׂרָאֵל בְּטַח בַּיהֹוָה עֶזְרָם וּמָגִנָּם הוּא: בֵּית אַהֲרֹן בִּטְחוּ בַיהֹוָה עֶזְרָם וּמָגִנָּם הוּא: יִרְאֵי יְהֹוָה בִּטְחוּ בַיהֹוָה עֶזְרָם וּמָגִנָּם הוּא:",
                    textAlign: TextAlign.justify,
                    textDirection: TextDirection.rtl,
                    style: GoogleFonts.suezOne(fontSize: 24),
                  ))
                  :Container(),
              Padding(
                  padding: const EdgeInsets.all(8.0),
                  child: Text(
                    "יְהֹוָה זְכָרָֽנוּ יְבָרֵךְ יְבָרֵךְ אֶת־בֵּית יִשְׂרָאֵל יְבָרֵךְ אֶת־בֵּית אַהֲרֹן: יְבָרֵךְ יִרְאֵי יְהֹוָה הַקְּטַנִּים עִם־הַגְּדֹלִים: יֹסֵף יְהֹוָה עֲלֵיכֶם עֲלֵיכֶם וְעַל־בְּנֵיכֶם: בְּרוּכִים אַתֶּם לַיהֹוָה עֹשֵׂה שָׁמַֽיִם וָאָֽרֶץ: הַשָּׁמַֽיִם שָׁמַֽיִם לַיהֹוָה וְהָאָֽרֶץ נָתַן לִבְנֵי־אָדָם: לֹא־הַמֵּתִים יְהַלְלוּ־יָהּ וְלֹא כָּל־יֹרְדֵי דוּמָה: וַאֲנַֽחְנוּ נְבָרֵךְ יָהּ מֵעַתָּה וְעַד־עוֹלָם הַלְלוּיָהּ:",
                    textAlign: TextAlign.justify,
                    textDirection: TextDirection.rtl,
                    style: GoogleFonts.suezOne(fontSize: 24),
                  )),
              JewishCalendar.fromDateTime(DateTime.now()).isFullHallel()
                  ?Padding(
                  padding: const EdgeInsets.all(8.0),
                  child: Text(
                    "אָהַֽבְתִּי כִּי־יִשְׁמַע יְהֹוָה אֶת־קוֹלִי תַּחֲנוּנָי: כִּי־הִטָּה אָזְנוֹ לִי וּבְיָמַי אֶקְרָא: אֲפָפֽוּנִי חֶבְלֵי־מָֽוֶת וּמְצָרֵי שְׁאוֹל מְצָאֽוּנִי צָרָה וְיָגוֹן אֶמְצָא: וּבְשֵׁם־יְהֹוָה אֶקְרָא אָנָּה יְהֹוָה מַלְּטָה נַפְשִׁי: חַנּוּן יְהֹוָה וְצַדִּיק וֵאלֹהֵֽינוּ מְרַחֵם: שֹׁמֵר פְּתָאיִם יְהֹוָה דַּלּוֹתִי וְלִי יְהוֹשִֽׁיעַ: שׁוּבִי נַפְשִׁי לִמְנוּחָֽיְכִי כִּי־יְהֹוָה גָּמַל עָלָֽיְכִי: כִּי חִלַּֽצְתָּ נַפְשִׁי מִמָּֽוֶת אֶת־עֵינִי מִן־דִּמְעָה אֶת־רַגְלִי מִדֶּֽחִי: אֶתְהַלֵּךְ לִפְנֵי יְהֹוָה בְּאַרְצוֹת הַחַיִּים: הֶאֱמַֽנְתִּי כִּי אֲדַבֵּר אֲנִי עָנִֽיתִי מְאֹד: אֲנִי אָמַֽרְתִּי בְחָפְזִי כָּל־הָאָדָם כֹּזֵב:",
                    textAlign: TextAlign.justify,
                    textDirection: TextDirection.rtl,
                    style: GoogleFonts.suezOne(fontSize: 24),
                  ))
                  :Container(),
              Padding(
                  padding: const EdgeInsets.all(8.0),
                  child: Text(
                    "מָה־אָשִׁיב לַיהֹוָה כָּל־תַּגְמוּלֽוֹהִי עָלָי: כּוֹס־יְשׁוּעוֹת אֶשָּׂא וּבְשֵׁם יְהֹוָה אֶקְרָא: נְדָרַי לַיהֹוָה אֲשַׁלֵּם נֶגְדָה־נָּא לְכָל־עַמּוֹ: יָקָר בְּעֵינֵי יְהֹוָה הַמָּֽוְתָה לַחֲסִידָיו: אָנָּה יְהֹוָה כִּי־אֲנִי עַבְדֶּֽךָ אֲנִי־עַבְדְּךָ בֶּן־אֲמָתֶֽךָ פִּתַּֽחְתָּ לְמוֹסֵרָי: לְךָ־אֶזְבַּח זֶֽבַח תּוֹדָה וּבְשֵׁם יְהֹוָה אֶקְרָא: נְדָרַי לַיהֹוָה אֲשַׁלֵּם נֶגְדָה־נָּא לְכָל־עַמּוֹ: בְּחַצְרוֹת בֵּית יְהֹוָה בְּתוֹכֵֽכִי יְרוּשָׁלָֽםִ הַלְלוּיָהּ:",
                    textAlign: TextAlign.justify,
                    textDirection: TextDirection.rtl,
                    style: GoogleFonts.suezOne(fontSize: 24),
                  )),
              Padding(
                  padding: const EdgeInsets.all(8.0),
                  child: Text(
                    "הַלְלוּ אֶת־יְהֹוָה כָּל־גּוֹיִם שַׁבְּחֽוּהוּ כָּל־הָאֻמִּים: כִּי גָּבַר עָלֵֽינוּ חַסְדּוֹ וֶאֱמֶת־יְהֹוָה לְעוֹלָם הַלְלוּיָהּ:",
                    textAlign: TextAlign.justify,
                    textDirection: TextDirection.rtl,
                    style: GoogleFonts.suezOne(fontSize: 24),
                  )),
              Padding(
                  padding: const EdgeInsets.all(8.0),
                  child: Text(
                    "הוֹדוּ לַיהֹוָה כִּי־טוֹב כִּי לְעוֹלָם חַסְדּוֹ:\nהוֹדוּ לַיהֹוָה כִּי־טוֹב כִּי לְעוֹלָם חַסְדּוֹ:\nיֹֽאמַר־נָא יִשְׂרָאֵל כִּי לְעוֹלָם חַסְדּוֹ:\nהוֹדוּ לַיהֹוָה כִּי־טוֹב כִּי לְעוֹלָם חַסְדּוֹ:\nיֹֽאמְרוּ־נָא בֵית־אַהֲרֹן כִּי לְעוֹלָם חַסְדּוֹ:\nהוֹדוּ לַיהֹוָה כִּי־טוֹב כִּי לְעוֹלָם חַסְדּוֹ:\nיֹֽאמְרוּ־נָא יִרְאֵי יְהֹוָה כִּי לְעוֹלָם חַסְדּוֹ:\nהוֹדוּ לַיהֹוָה כִּי־טוֹב כִּי לְעוֹלָם חַסְדּוֹ:",
                    textAlign: TextAlign.center,
                    textDirection: TextDirection.rtl,
                    style: GoogleFonts.suezOne(fontSize: 24),
                  )),
              Padding(
                  padding: const EdgeInsets.all(8.0),
                  child: Text(
                    "מִן־הַמֵּצַר קָרָֽאתִי יָהּ עָנָֽנִי בַמֶּרְחָב יָהּ: יְהֹוָה לִי לֹא אִירָא מַה־יַּעֲשֶׂה לִי אָדָם: יְהֹוָה לִי בְּעֹזְרָי וַאֲנִי אֶרְאֶה בְשׂנְאָי: טוֹב לַחֲסוֹת בַּיהֹוָה מִבְּטֹֽחַ בָּאָדָם: טוֹב לַחֲסוֹת בַּיהֹוָה מִבְּטֹֽחַ בִּנְדִיבִים: כָּל־גּוֹיִם סְבָבֽוּנִי בְּשֵׁם יְהֹוָה כִּי אֲמִילַם: סַבּֽוּנִי גַם־סְבָבֽוּנִי בְּשֵׁם יְהֹוָה כִּי אֲמִילַם: סַבּֽוּנִי כִדְבֹרִים דֹּעֲכוּ כְּאֵשׁ קוֹצִים בְּשֵׁם יְהֹוָה כִּי אֲמִילַם: דָּחֹה דְחִיתַֽנִי לִנְפֹּל וַיהֹוָה עֲזָרָֽנִי: עָזִּי וְזִמְרָת יָהּ וַיְהִי־לִי לִישׁוּעָה: קוֹל רִנָּה וִישׁוּעָה בְּאָהֳלֵי צַדִּיקִים יְמִין יְהֹוָה עֹֽשָׂה חָֽיִל: יְמִין יְהֹוָה רוֹמֵמָה יְמִין יְהֹוָה עֹֽשָׂה חָֽיִל: לֹא־אָמוּת כִּי־אֶחְיֶה וַאֲסַפֵּר מַעֲשֵׂי יָהּ: יַסֹּר יִסְּרַֽנִּי יָהּ וְלַמָּֽוֶת לֹא נְתָנָֽנִי: פִּתְחוּ־לִי שַֽׁעֲרֵי־צֶֽדֶק אָֽבֹא־בָם אוֹדֶה יָהּ: זֶה־הַשַּֽׁעַר לַיהֹוָה צַדִּיקִים יָבֹֽאוּ בוֹ: אוֹדְךָ כִּי עֲנִיתָֽנִי וַתְּהִי־לִי לִישׁוּעָה: אוֹדְךָ כִּי עֲנִיתָֽנִי וַתְּהִי־לִי לִישׁוּעָה: אֶֽבֶן מָאֲסוּ הַבּוֹנִים הָיְתָה לְרֹאשׁ פִּנָּה: אֶֽבֶן מָאֲסוּ הַבּוֹנִים הָיְתָה לְרֹאשׁ פִּנָּה: מֵאֵת יְהֹוָה הָֽיְתָה זֹּאת הִיא נִפְלָאת בְּעֵינֵֽינוּ: מֵאֵת יְהֹוָה הָֽיְתָה זֹּאת הִיא נִפְלָאת בְּעֵינֵֽינוּ: זֶה־הַיּוֹם עָשָׂה יְהֹוָה נָגִֽילָה וְנִשְׂמְחָה בוֹ: זֶה־הַיּוֹם עָשָׂה יְהֹוָה נָגִֽילָה וְנִשְׂמְחָה בוֹ:",
                    textAlign: TextAlign.justify,
                    textDirection: TextDirection.rtl,
                    style: GoogleFonts.suezOne(fontSize: 24),
                  )),
              Padding(
                  padding: const EdgeInsets.all(8.0),
                  child: Text(
                    "אָֽנָּא יְהֹוָה הוֹשִֽׁיעָה נָּא:\nאָֽנָּא יְהֹוָה הוֹשִֽׁיעָה נָּא:\nאָֽנָּא יְהֹוָה הַצְלִיחָה נָא:\nאָֽנָּא יְהֹוָה הַצְלִיחָה נָא:",
                    textAlign: TextAlign.center,
                    textDirection: TextDirection.rtl,
                    style: GoogleFonts.suezOne(fontSize: 24),
                  )),
              Padding(
                  padding: const EdgeInsets.all(8.0),
                  child: Text(
                    "בָּרוּךְ הַבָּא בְּשֵׁם יְהֹוָה בֵּרַכְנוּכֶם מִבֵּית יְהֹוָה: בָּרוּךְ הַבָּא בְּשֵׁם יְהֹוָה בֵּרַכְנוּכֶם מִבֵּית יְהֹוָה: אֵל יְהֹוָה וַיָּֽאֶר לָֽנוּ אִסְרוּ־חַג בַּעֲבֹתִים עַד־קַרְנוֹת הַמִּזְבֵּֽחַ: אֵל יְהֹוָה וַיָּֽאֶר לָֽנוּ אִסְרוּ־חַג בַּעֲבֹתִים עַד־קַרְנוֹת הַמִּזְבֵּֽחַ: אֵלִי אַתָּה וְאוֹדֶֽךָ אֱלֹהַי אֲרוֹמְמֶֽךָ: אֵלִי אַתָּה וְאוֹדֶֽךָ אֱלֹהַי אֲרוֹמְמֶֽךָ: הוֹדוּ לַיהֹוָה כִּי־טוֹב כִּי לְעוֹלָם חַסְדּוֹ: הוֹדוּ לַיהֹוָה כִּי־טוֹב כִּי לְעוֹלָם חַסְדּוֹ:",
                    textAlign: TextAlign.justify,
                    textDirection: TextDirection.rtl,
                    style: GoogleFonts.suezOne(fontSize: 24),
                  )),
              JewishCalendar.fromDateTime(DateTime.now()).isFullHallel()
                  ?Padding(
                  padding: const EdgeInsets.all(8.0),
                  child: Text(
                    "יְהַלְלֽוּךָ יְהֹוָה אֱלֹהֵֽינוּ כָּל־מַעֲשֶֽׂיךָ וַחֲסִידֶֽיךָ צַדִּיקִים עוֹשֵׂי רְצוֹנֶֽךָ וְכָל עַמְּךָ בֵּית יִשְׂרָאֵל בְּרִנָּה יוֹדוּ וִיבָרְכוּ וִישַׁבְּחוּ וִיפָאֲרוּ וִישׁוֹרְרוּ וִירוֹמְמוּ וְיַעֲרִֽיצוּ וְיַקְדִּֽישׁוּ וְיַמְלִֽיכוּ אֶת שִׁמְךָ מַלְכֵּֽנוּ תָּמִיד. כִּי לְךָ טוֹב לְהוֹדוֹת וּלְשִׁמְךָ נָאֶה לְזַמֵּר. כִּי מֵעוֹלָם וְעַד עוֹלָם אַתָּה אֵל. בָּרוּךְ אַתָּה יְהֹוָה מֶֽלֶךְ מְהֻלָּל בַּתִּשְׁבָּחוֹת:",
                    textAlign: TextAlign.justify,
                    textDirection: TextDirection.rtl,
                    style: GoogleFonts.suezOne(fontSize: 24),
                  ))
                  :Container(),
            ],
          )
        : Container(),
    // Avinu Malkeinu
    Column(
      children: [
        Padding(padding: const EdgeInsets.all(16.0), child: Container()),
        JewishCalendar.fromDateTime(DateTime.now()).isTenDays()
            ? Padding(
                padding: const EdgeInsets.all(8.0),
                child: Text(
                  "אָבִינוּ מַלְכֵּנוּ. חָטָאנוּ לְפָנֶיךָ:\n"
                  "אָבִינוּ מַלְכֵּנוּ. אֵין לָנוּ מֶלֶךְ אֶלָּא אָתָּה:\n"
                  "אָבִינוּ מַלְכֵּנוּ. עֲשה עִמָּנוּ לְמַעַן שְׁמֶךָ:"
                  "\nאָבִינוּ מַלְכֵּנוּ. חַדֵּשׁ עָלֵינוּ שָׁנָה טובָה:"
                  "\nאָבִינוּ מַלְכֵּנוּ. בַּטֵּל מֵעָלֵינוּ כָּל גְזֵרות קָשׁות:"
                  "\nאָבִינוּ מַלְכֵּנוּ. בַּטֵּל מַחְשְׁבות שונְאֵינוּ:"
                  "\nאָבִינוּ מַלְכֵּנוּ. הָפֵר עֲצַת אויְבֵינוּ:"
                  "\nאָבִינוּ מַלְכֵּנוּ. כַּלֵּה כָּל צַר וּמַשטִין מֵעָלֵינוּ:"
                  "\nאָבִינוּ מַלְכֵּנוּ. כַּלֵּה כָּל צַר וּמַשטִין מֵעָלֵינוּ:"
                  "\nאָבִינוּ מַלְכֵּנוּ. כַּלֵּה דֶבֶר וְחֶרֶב וְרָעָב וּשְׁבִי וּמַשְׁחִית וְעָון וּשְׁמַד מִבְּנֵי בְרִיתֶךָ:"
                  "\nאָבִינוּ מַלְכֵּנוּ. מְנַע מַגֵּפָה מִנַּחֲלָתֶךָ:"
                  "\nאָבִינוּ מַלְכֵּנוּ. סְלַח וּמְחַל לְכָל עֲונותֵינוּ:"
                  "\nאָבִינוּ מַלְכֵּנוּ. מְחֵה וְהַעֲבֵר פְּשָׁעֵינוּ וְחַטּאתֵינוּ מִנֶּגֶד עֵינֶיךָ:"
                  "\nאָבִינוּ מַלְכֵּנוּ. מְחק בְּרַחֲמֶיךָ הָרַבִּים כָּל שִׁטְרֵי חובותֵינוּ:"
                  "\nאָבִינוּ מַלְכֵּנוּ. הַחֲזִירֵנוּ בִּתְשׁוּבָה שְׁלֵמָה לְפָנֶיךָ:"
                  "\nאָבִינוּ מַלְכֵּנוּ. שְׁלַח רְפוּאָה שְׁלֵמָה לְחולֵי עַמֶּךָ:"
                  "\nאָבִינוּ מַלְכֵּנוּ. קְרַע. רועַ גְּזַר דִּינֵנוּ:"
                  "\nאָבִינוּ מַלְכֵּנוּ. זָכְרֵנוּ בְּזִכָּרון טוב לְפָנֶיךָ:"
                  "\nאָבִינוּ מַלְכֵּנוּ. כָּתְבֵנוּ בְּסֵפֶר חַיִּים טובִים:"
                  "\nאָבִינוּ מַלְכֵּנוּ. כָּתְבֵנוּ בְּסֵפֶר גְּאוּלָּה וִישׁוּעָה:"
                  "\nאָבִינוּ מַלְכֵּנוּ. כָּתְבֵנוּ בְּסֵפֶר פַּרְנָסָה וְכַלְכָּלָה:"
                  "\nאָבִינוּ מַלְכֵּנוּ. כָּתְבֵנוּ בְּסֵפֶר זְכֻיּות:"
                  "\nאָבִינוּ מַלְכֵּנוּ. כָּתְבֵנוּ בְּסֵפֶר סְלִיחָה וּמְחִילָה:"
                  "\nאָבִינוּ מַלְכֵּנוּ. הַצְמַח לָנוּ יְשׁוּעָה בְּקָרוב:"
                  "\nאָבִינוּ מַלְכֵּנוּ. הָרֵם קֶרֶן יִשרָאֵל עַמֶּךָ:"
                  "\nאָבִינוּ מַלְכֵּנוּ. הָרֵם קֶרֶן מְשִׁיחֶךָ:"
                  "\nאָבִינוּ מַלְכֵּנוּ. מַלֵּא יָדֵינוּ מִבִּרְכותֶיךָ:"
                  "\nאָבִינוּ מַלְכֵּנוּ. מַלֵּא אֲסָמֵינוּ שבָע:"
                  "\nאָבִינוּ מַלְכֵּנוּ. שְׁמַע קולֵנוּ חוּס וְרַחֵם עָלֵינוּ:"
                  "\nאָבִינוּ מַלְכֵּנוּ. קַבֵּל בְּרַחֲמִים וּבְרָצון אֶת תְּפִלָּתֵנוּ:"
                  "\nאָבִינוּ מַלְכֵּנוּ. פְּתַח שַׁעֲרֵי שָׁמַיִם לִתְפִלָּתֵנוּ:"
                  "\nאָבִינוּ מַלְכֵּנוּ. זְכר כִּי עָפָר אֲנָחְנוּ:"
                  "\nאָבִינוּ מַלְכֵּנוּ. נָא אַל תְּשִׁיבֵנוּ רֵיקָם מִלְּפָנֶיךָ:"
                  "\nאָבִינוּ מַלְכֵּנוּ. תְּהֵא הַשָּׁעָה הַזּאת שְׁעַת רַחֲמִים וְעֵת רָצון מִלְּפָנֶיךָ:"
                  "\nאָבִינוּ מַלְכֵּנוּ. חֲמול עָלֵינוּ וְעַל עולָלֵינוּ וְטַפֵּנוּ:"
                  "\nאָבִינוּ מַלְכֵּנוּ. עֲשה לְמַעַן הֲרוּגִים עַל שֵׁם קָדְשֶׁךָ:"
                  "\nאָבִינוּ מַלְכֵּנוּ. עֲשה לְמַעַן טְבוּחִים עַל יִחוּדֶךָ:"
                  "\nאָבִינוּ מַלְכֵּנוּ. עֲשה לְמַעַן בָּאֵי בָאֵשׁ וּבַמַּיִם עַל קִדּוּשׁ שְׁמֶךָ:"
                  "\nאָבִינוּ מַלְכֵּנוּ. נְקום לְעֵינֵנוּ נִקְמַת דַּם עֲבָדֶיךָ הַשָּׁפוּךְ:"
                  "\nאָבִינוּ מַלְכֵּנוּ. עֲשה לְמַעַנְךָ אִם לא לְמַעֲנֵנוּ:"
                  "\nאָבִינוּ מַלְכֵּנוּ. עֲשה לְמַעַנְךָ וְהושִׁיעֵנוּ:"
                  "\nאָבִינוּ מַלְכֵּנוּ. עֲשה לְמַעַן רַחֲמֶיךָ הָרַבִּים:"
                  "\nאָבִינוּ מַלְכֵּנוּ. עֲשה לְמַעַן שִׁמְךָ הַגָּדול הַגִּבּור וְהַנּורָא שֶׁנִּקְרָא עָלֵינוּ:"
                  "\nאָבִינוּ מַלְכֵּנוּ. חָנֵּנוּ וַעֲנֵנוּ כִּי אֵין בָּנוּ מַעֲשים עֲשה עִמָּנוּ צְדָקָה וָחֶסֶד וְהושִׁיעֵנוּ:",
                  textAlign: TextAlign.right,
                  textDirection: TextDirection.rtl,
                  style: GoogleFonts.suezOne(fontSize: 24),
                ))
            : Container(),
      ],
    ),
    // Tachanunim
    (JewishCalendar.fromDateTime(DateTime.now()).isTachanun())
        ? Column(
            children: [
              (DateTime.now().weekday == DateTime.monday ||
                      DateTime.now().weekday == DateTime.thursday)
                  ? Column(
                      children: [
                        Padding(
                            padding: const EdgeInsets.all(16.0),
                            child: Container()),
                        Padding(
                            padding: const EdgeInsets.all(8.0),
                            child: Text(
                              "וְהוּא רַחוּם יְכַפֵּר עָון וְלא יַשְׁחִית. וְהִרְבָּה לְהָשִׁיב אַפּו וְלא יָעִיר כָּל חֲמָתו: אַתָּה ה'. לא תִכְלָא רַחֲמֶיךָ מִמֶּנּוּ. חַסְדְּךָ וַאֲמִתְּךָ תָּמִיד יִצְּרוּנוּ: הושִׁיעֵנוּ ה' אֱלהֵינוּ וְקַבְּצֵנוּ מִן הַגּויִם. לְהודות לְשֵׁם קָדְשֶׁךָ. לְהִשְׁתַּבֵּחַ בִּתְהִלָּתֶךָ: אִם עֲונות תִּשְׁמָר יָהּ. אֲדנָי מִי יַעֲמד: כִּי עִמְּךָ הַסְּלִיחָה לְמַעַן תִּוָּרֵא: לא כַחֲטָאֵינוּ תַּעֲשה לָנוּ וְלא כַעֲונותֵינוּ תִּגְמל עָלֵינוּ: אִם עֲונֵינוּ עָנוּ בָנוּ. ה'. עֲשה לְמַעַן שְׁמֶךָ: זְכר רַחֲמֶיךָ ה' וַחֲסָדֶיךָ. כִּי מֵעולָם הֵמָּה: יַעֲנֵנוּ ה' בְּיום צָרָה. יְשגְּבֵנוּ שֵׁם אֱלהֵי יַעֲקב: ה' הושִׁיעָה. הַמֶּלֶךְ יַעֲנֵנוּ בְיום קָרְאֵנוּ: אָבִינוּ מַלְכֵּנוּ חָנֵּנוּ וַעֲנֵנוּ. כִּי אֵין בָּנוּ מַעֲשים. צְדָקָה עֲשה עִמָּנוּ לְמַעַן שְׁמֶךָ: אֲדונֵינוּ אֱלהֵינוּ. שְׁמַע קול תַּחֲנוּנֵינוּ. וּזְכָר לָנוּ אֶת בְּרִית אֲבותֵינוּ וְהושִׁיעֵנוּ לְמַעַן שְׁמֶךָ: וְעַתָּה אֲדנָי אֱלהֵינוּ. אֲשֶׁר הוצֵאתָ אֶת עַמְּךָ מֵאֶרֶץ מִצְרַיִם בְּיָד חֲזָקָה וַתַּעַש לְךָ שֵׁם כַּיּום הַזֶּה. חָטָאנוּ רָשָׁעְנוּ: אֲדנָי. כְּכָל צִדְקותֶיךָ יָשָׁב נָא אַפְּךָ וַחֲמָתְךָ מֵעִירְךָ יְרוּשָׁלַיִם הַר קָדְשֶׁךָ. כִּי בַחֲטָאֵינוּ וּבַעֲונות אֲבתֵינוּ. יְרוּשָׁלַיִם וְעַמְּךָ לְחֶרְפָּה לְכָל סְבִיבתֵינוּ: וְעַתָּה שְׁמַע אֱלהֵינוּ אֶל תְּפִלַּת עַבְדְּךָ וְאֶל תַּחֲנוּנָיו. וְהָאֵר פָּנֶיךָ עַל מִקְדָּשְׁךָ הַשָּׁמֵם. לְמַעַן אֲדנָי:",
                              textAlign: TextAlign.justify,
                              textDirection: TextDirection.rtl,
                              style: GoogleFonts.suezOne(fontSize: 24),
                            )),
                        Padding(
                            padding: const EdgeInsets.all(8.0),
                            child: Text(
                              "הַטֵּה אֱלהַי אָזְנְךָ וּשְׁמָע. פְּקַח עֵינֶיךָ וּרְאֵה שׁומְמותֵינוּ וְהָעִיר אֲשֶׁר נִקְרָא שִׁמְךָ עָלֶיהָ. כִּי לא עַל צִדְקותֵינוּ אֲנַחְנוּ מַפִּילִים תַּחֲנוּנֵינוּ לְפָנֶיךָ. כִּי עַל רַחֲמֶיךָ הָרַבִּים: אֲדנָי שְׁמָעָה. אֲדנָי סְלָחָה. אֲדנָי הַקְשִׁיבָה. וַעֲשה אַל תְּאַחַר. לְמַעַנְךָ אֱלהַי. כִּי שִׁמְךָ נִקְרָא עַל עִירְךָ וְעַל עַמֶּךָ: אָבִינוּ הָאָב הָרַחֲמָן. הַרְאֵנוּ אות לְטובָה וְקַבֵּץ נְפוּצותֵינוּ מֵאַרְבַּע כַּנְפות הָאָרֶץ. יַכִּירוּ וְיֵדְעוּ כָּל הַגּויִם. כִּי אַתָּה ה' אֱלהֵינוּ: וְעַתָּה ה' אָבִינוּ אָתָּה. אֲנַחְנוּ הַחמֶר וְאַתָּה יצְרֵנוּ וּמַעֲשה יָדְךָ כֻּלָּנוּ: הושִׁיעֵנוּ לְמַעַן שְׁמֶךָ. צוּרֵנוּ מַלְכֵּנוּ וְגואֲלֵנוּ: חוּסָה ה' עַל עַמֶּךָ וְאַל תִּתֵּן נַחֲלָתְךָ לְחֶרְפָּה לִמְשָׁל בָּם גּויִם. לָמָּה יאמְרוּ בָעַמִּים אַיֵּה אֱלהֵיהֶם: יָדַעְנוּ כִּי חָטָאנוּ וְאֵין מִי יַעֲמד בַּעֲדֵנוּ. שִׁמְךָ הַגָּדול יַעֲמָד לָנוּ בְּעֵת צָרָה. יָדַעְנוּ כִּי אֵין בָּנוּ מַעֲשים. צְדָקָה עֲשה עִמָּנוּ לְמַעַן שְׁמֶךָ: כְּרַחֵם אָב עַל בָּנִים כֵּן תְּרַחֵם ה' עָלֵינוּ. וְהושִׁיעֵנוּ לְמַעַן שְׁמֶךָ: חֲמול עַל עַמֶּךָ. רַחֵם עַל נַחֲלָתֶךָ. חוּסָה נָּא כְּרוב רַחֲמֶיךָ. חָנֵּנוּ מַלְכֵּנוּ וַעֲנֵנוּ. כִּי לְךָ ה' הַצְּדָקָה. עשה נִפְלָאות בְּכָל עֵת:",
                              textAlign: TextAlign.justify,
                              textDirection: TextDirection.rtl,
                              style: GoogleFonts.suezOne(fontSize: 24),
                            )),
                        Padding(
                            padding: const EdgeInsets.all(8.0),
                            child: Text(
                              "הַבֶּט נָא רַחֶם נָא עַל עַמְךָ מְהֵרָה לְמַעַן שְׁמֶךָ. בְּרַחֲמֶיךָ הָרַבִּים ה' אֱלהֵינוּ חוּס וְרַחֵם וְהושִׁיעָה צאן מַרְעִיתֶךָ. וְאַל יִמְשָׁל בָּנוּ קֶצֶף. כִּי לְךָ עֵינֵינוּ תְלוּיות. הושִׁיעֵנוּ לְמַעַן שְׁמֶּךָ.רַחֵם עָלֵינוּ לְמַעַן בְּרִיתֶךָ הַבִּיטָה וַעֲנֵנוּ בְּעֵת צָרָה. כִּי לְךָ ה' הַיְשׁוּעָה. בְּךָ תוחַלְתֵּנוּ אֱלוהַּ סְלִיחות. אָנָּא סְלַח נָא. אֵל טוב וְסַלָּח כִּי אֵל מֶלֶךְ חַנוּן וְרַחוּם אָתָּה:",
                              textAlign: TextAlign.justify,
                              textDirection: TextDirection.rtl,
                              style: GoogleFonts.suezOne(fontSize: 24),
                            )),
                        Padding(
                            padding: const EdgeInsets.all(8.0),
                            child: Text(
                              "אָנָּא מֶלֶךְ חַנּוּן וְרַחוּם. זְכר וְהַבֵּט לִבְרִית בֵּין הַבְּתָרִים וְתֵרָאֶה לְפָנֶיךָ עֲקֵדַת יָחִיד לְמַעַן יִשרָאֵל. אָבִינוּ מַלְכֵּנוּ חָנֵּנוּ וַעֲנֵנוּ. כִּי שִׁמְךָ הַגָּדול נִקְרָא עָלֵינוּ. עשה נִפְלָאות בְּכָל עֵת. עֲשה עִמָּנוּ כְּחַסְדֶּךָ. חַנּוּן וְרַחוּם. הַבִּיטָה וַעֲנֵנוּ בְּעֵת צָרָה. כִּי לְךָ ה' הַיְשׁוּעָה. אָבִינוּ מַלְכֵּנוּ מַחֲסֵנוּ אַל תַּעַשׁ עִמָּנוּ כְּרעַ מַעֲלָלֵנוּ זְכור רַחֲמֶיךָ ה' וַחֲסָדֶיךָ וּכְרב טוּבְךָ הושִׁיעֵנוּ וַחֲמָל נָא עָלֵינוּ כִּי אֵין לָנוּ אֱלוהַּ אַחֵר מִבַּלְעָדֶיךָ צוּרֵנוּ אַל תַּעַזְבֵנוּ ה' אֱלהֵינוּ אַל תִּרְחַק מִמֶּנוּ כִּי נַפְשֵׁנוּ קְצָרָה. מֵחֶרֵב וּמִשְּׁבִי וּמִדֶּבֶר וּמִמַּגֵּפָה וּמִכָּל צָרָה וְיָגון הַצִּילֵנוּ כִּי לְךָ קִוִּינוּ וְאַל תַּכְלִימֵנוּ ה' אֱלהֵינוּ וְהָאֵר פָּנֶיךָ בָּנוּ וּזְכר לָנוּ אֶת בְּרִית אֲבותֵינוּ וְהושִׁיעֵנוּ לְמַעַן שְׁמֶךָ. רְאֵה בְצָרותֵינוּ וּשְׁמַע קול תְּפִלָּתֵנוּ. כִּי אַתָּה שׁומֵע תְּפִלַּת כָּל פֶּה:",
                              textAlign: TextAlign.justify,
                              textDirection: TextDirection.rtl,
                              style: GoogleFonts.suezOne(fontSize: 24),
                            )),
                        Padding(
                            padding: const EdgeInsets.all(8.0),
                            child: Text(
                              "אֵל רַחוּם וְחַנּוּן, רַחֵם עָלֵינוּ וְעַל כָּל מַעֲשיךָ, כִּי אֵין כָּמוךָ ה' אֱלהֵינוּ, אָנָּא שא נָא פְשָׁעֵינוּ. אָבִינוּ מַלְכֵּנוּ צוּרֵנוּ וְגואֲלֵנוּ, אֵל חַי וְקַיָּם הֶחָסִין בַּכּחַ, חָסִיד וְטוב עַל כָּל מַעֲשיךָ, כִּי אַתָּה הוּא ה' אֱלהֵינוּ. אֵל אֶרֶךְ אַפַּיִם וּמָלֵא רַחֲמִים, עֲשה עִמָּנוּ כְּרב רַחֲמֶיךָ, וְהושִׁיעֵנוּ לְמַעַן שְׁמֶךָ. שְׁמַע מַלְכֵּנוּ תְּפִלָּתֵנוּ, וּמִיַּד אויְבֵינוּ הַצִּילֵנוּ. שְׁמַע מַלְכֵּנוּ תְּפִלָתֵנוּ וּמִכָּל צָרָה וְיָגון הַצִּילֵנוּ. אָבִינוּ מַלְכֵּנוּ אַתָּה, וְשִׁמְךָ עָלֵינוּ נִקְרָא, אַל תַּנִּיחֵנוּ. אַל תַּעַזְבֵנ אָבִינוּ, וְאַל תִּטְשֵׁנוּ בּורְאֵנוּ, וְאַל תִּשְׁכָּחֵנוּ יוצְרֵנוּ, כִּי אֵל מֶלֶךְ חַנּוּן וְרַחוּם אָתָּה:",
                              textAlign: TextAlign.justify,
                              textDirection: TextDirection.rtl,
                              style: GoogleFonts.suezOne(fontSize: 24),
                            )),
                        Padding(
                            padding: const EdgeInsets.all(8.0),
                            child: Text(
                              "אֵין כָּמוךָ חַנּוּן וְרַחוּם ה' אֱלהֵינוּ. אֵין כָּמוךָ אֵל אֶרֶךְ אַפַּיִם וְרַב חֶסֶד וֶאֱמֶת. הושִׁיעֵנוּ בְּרַחֲמֶיךָ הָרַבִּים. מֵרַעַשׁ וּמֵרגֶז הַצִּילֵנוּ: זְכור לַעֲבָדֶיךָ לְאַבְרָהָם לְיִצְחָק וּלְיַעֲקב. אַל תֵּפֶן אֶל קָשְׁיֵנוּ וְאֶל רִשְׁעֵנוּ וְאֶל חַטָּאתֵנוּ שׁוּב מֵחֲרון אַפֶּךָ וְהִנָּחֵם עַל הָרָעָה לְעַמֶּךָ: וְהָסֵר מִמֶּנּוּ מַכַּת הַמָּוֶת כִּי רַחוּם אָתָּה. כִּי כֵן דַּרְכֶּךָ. עושה חֶסֶד חִנָּם בְּכָל דּור וָדור. חוּסָה ה' עַל עַמֶּךָ וְהַצִּילֵנוּ מִזַּעְמֶךָ. וְהָסֵר מִמֶּנּוּ מַכַּת הַמַּגֵּפָה וּגְזֵרָה קָשָׁה. כִּי אַתָּה שׁומֵר יִשרָאֵל: לְךָ אֲדנָי הַצְּדָקָה וְלָנוּ בּשֶׁת הַפָּנִים. מַה נִּתְאונֵן מַה נּאמַר מַה נְּדַבֵּר וּמַה נִּצְטַדָּק: נַחְפְּשה דְרָכֵינוּ וְנַחְקרָה וְנָשׁוּבָה אֵלֶיךָ. כִּי יְמִינְךָ פְשׁוּטָה לְקַבֵּל שָׁבִים: אָנָּא ה' הושִׁיעָה נָּא. אָנָּא ה' הַצְּלִיחָה נָא: אָנָּא ה' עֲנֵנוּ בְיום קָרְאֵנוּ: לְךָ ה' חִכִּינוּ. לְךָ ה' קִוִּינוּ. לְךָ ה' נְיַחֵל. אַל תֶּחֱשֶׁה וּתְעַנֵּנוּ. כִּי נָאֲמוּ גּויִם. אָבְדָה תִקְוָתָם. כָּל בֶּרֶךְ וְכָל קומָה לְךָ לְבַד תִּשְׁתַּחֲוֶה:",
                              textAlign: TextAlign.justify,
                              textDirection: TextDirection.rtl,
                              style: GoogleFonts.suezOne(fontSize: 24),
                            )),
                        Padding(
                            padding: const EdgeInsets.all(8.0),
                            child: Text(
                              "הַפּותֵחַ יָד בִּתְשׁוּבָה לְקַבֵּל פּושְׁעִים וְחַטָּאִים. נִבְהֲלָה נַפְשֵׁנוּ מֵרב עִצְּבונֵנוּ. אַל תִּשְׁכָּחֵנוּ נֶצַח. קוּמָה וְהושִׁיעֵנוּ. כִּי חָסִינוּ בָךְ. אָבִינוּ מַלְכֵּנוּ. אִם אֵין בָּנוּ צְדָקָה וּמַעֲשים טובִים. זְכָר לָנוּ אֶת בְּרִית אֲבותֵינוּ. וְעֵדותֵינוּ בְּכָל יום ה' אֶחָד. הַבִּיטָה בְעָנְיֵנוּ. כִּי רַבּוּ מַכְאובֵינוּ. וְצָרות לְבָבֵנוּ. חוּסָה ה' עָלֵינוּ. וְאַל תִּשְׁפּךְ חֲרונְךָ עָלֵינוּ. כִּי אֲנַחְנוּ עַמְּךָ בְּנֵי בְרִיתֶךָ. אֵל הַבִּיטָה. דַּל כְּבודֵנוּ בַּגּויִים וְשִׁקְּצוּנוּ כְּטֻמְאַת הַנִּדָּה. עַד מָתַי עֻזְּךָ בַּשְּׁבִי. וְתִפְאַרְתְּךָ בְּיַד צָר. עורְרָה גְבוּרָתְךָ וְקִנְאָתְךָ עַל אויְבֶיךָ. הֵם יֵבושׁוּ וְיֵחַתּוּ מִגְבוּרָתָם. וְאַל יִמְעֲטוּ לְפָנֶיךָ תְּלָאותֵינוּ. מַהֵר יְקַדְּמוּנוּ רַחֲמֶיךָ בְּיום צָרָתֵנוּ. וְאִם לא לְמַעֲנֵנוּ לְמַעַנְךָ פְּעַל. וְאַל תַּשְׁחִית זֵכֶר שְׁאֵרִיתֵנוּ וְחון אם הַמְיַחֲדִים שִׁמְךָ פַּעֲמַיִם בְּכָל יום תָּמִיד בְּאַהֲבָה וְאומְרִים שְׁמַע יִשרָאֵל. ה' אֱלהֵינוּ. ה' אֶחָד:",
                              textAlign: TextAlign.justify,
                              textDirection: TextDirection.rtl,
                              style: GoogleFonts.suezOne(fontSize: 24),
                            )),
                      ],
                    )
                  : Container(),
              Padding(
                  padding: const EdgeInsets.all(8.0),
                  child: Text(
                    "רַחוּם וְחַנּוּן חָטָאתִי לְפָנֶיךָ. ה' מָלֵא רַחֲמִים. רַחֵם עָלַי וְקַבֵּל תַּחֲנוּנָי: ה' אַל בְּאַפְּךָ תוכִיחֵנִי. וְאַל בַּחֲמָתְךָ תְיַסְּרֵנִי: חָנֵּנִי ה'. כִּי אֻמְלַל אָנִי. רְפָאֵנִי ה'. כִּי נִבְהֲלוּ עֲצָמָי: וְנַפְשִׁי נִבְהֲלָה מְאד. וְאַתָּה ה' עַד מָתָי: שׁוּבָה ה'. חַלְּצָה נַפְשִׁי. הושִׁיעֵנִי לְמַעַן חַסְדֶּךָ: כִּי אֵין בַּמָּוֶת זִכְרֶךָ. בִּשְׁאול מִי יודֶה לָּךְ: יָגַעְתִּי בְאַנְחָתִי. אַשחֶה בְכָל לַיְלָה מִטָּתִי. בְּדִמְעָתִי עַרְשי אַמְסֶה: עָשְׁשָׁה מִכַּעַס עֵינִי. עָתְקָה בְּכָל צורְרָי: סוּרוּ מִמֶּנִּי כָּל פּעֲלֵי אָוֶן. כִּי שָׁמַע ה' קול בִּכְיִי: שָׁמַע ה' תְּחִנָּתִי. ה' תְּפִלָּתִי יִקָּח: יֵבשׁוּ וְיִבָּהֲלוּ מְאד כָּל איְבָי. יָשֻׁבוּ יֵבשׁוּ רָגַע:",
                    textAlign: TextAlign.justify,
                    textDirection: TextDirection.rtl,
                    style: GoogleFonts.suezOne(fontSize: 24),
                  )),
              (DateTime.now().weekday == DateTime.monday ||
                      DateTime.now().weekday == DateTime.thursday)
                  ? Column(
                      children: [
                        Padding(
                            padding: const EdgeInsets.all(8.0),
                            child: Text(
                              "ה' אֱלהֵי יִשרָאֵל. שׁוּב מֵחֲרון אַפֶּךָ וְהִנָּחֵם עַל הָרָעָה לְעַמֶּךָ: הַבֵּט מִשָּׁמַיִם וּרְאֵה כִּי הָיִינוּ לַעַג וָקֶלֶס בַּגּויִם. נֶחְשַׁבְנוּ כַּצּאן לַטֶּבַח יוּבָל. לַהֲרוג וּלְאַבֵּד וּלְמַכָּה וּלְחֶרְפָּה: וּבְכָל זאת שִׁמְךָ לא שָׁכָחְנוּ. נָא אַל תִּשְׁכָּחֵנוּ:",
                              textAlign: TextAlign.justify,
                              textDirection: TextDirection.rtl,
                              style: GoogleFonts.suezOne(fontSize: 24),
                            )),
                        Padding(
                            padding: const EdgeInsets.all(8.0),
                            child: Text(
                              "ה' אֱלהֵי יִשרָאֵל. שׁוּב מֵחֲרון אַפֶּךָ וְהִנָּחֵם עַל הָרָעָה לְעַמֶּךָ:",
                              textAlign: TextAlign.justify,
                              textDirection: TextDirection.rtl,
                              style: GoogleFonts.suezOne(fontSize: 24),
                            )),
                        Padding(
                            padding: const EdgeInsets.all(8.0),
                            child: Text(
                              "זָרִים אומְרִים אֵין תּוחֶלֶת וְתִקְוָה. חון אום לְשִׁמְךָ מְקַוֶּה. טָהור. יְשׁוּעָתֵנוּ קָרְבָה. יָגַעְנוּ וְלא הוּנַח לָנוּ. רַחֲמֶיךָ יִכְבְּשׁוּ אֶת כַּעַסְךָ מֵעָלֵינוּ: אָנָּא שׁוּב מֵחֲרונְךָ וְרַחֵם סְגֻלָּה אֲשֶׁר בָּחָרְתָּ:",
                              textAlign: TextAlign.justify,
                              textDirection: TextDirection.rtl,
                              style: GoogleFonts.suezOne(fontSize: 24),
                            )),
                        Padding(
                            padding: const EdgeInsets.all(8.0),
                            child: Text(
                              "ה' אֱלהֵי יִשרָאֵל. שׁוּב מֵחֲרון אַפֶּךָ וְהִנָּחֵם עַל הָרָעָה לְעַמֶּךָ:",
                              textAlign: TextAlign.justify,
                              textDirection: TextDirection.rtl,
                              style: GoogleFonts.suezOne(fontSize: 24),
                            )),
                        Padding(
                            padding: const EdgeInsets.all(8.0),
                            child: Text(
                              "חוּסָה ה' עָלֵינוּ בְּרַחֲמֶיךָ וְאַל תִּתְּנֵנוּ בִּידֵי אַכְזָרִים. לָמָּה יאמְרוּ הַגּויִם אַיֵּה נָא אֱלהֵיהֶם. לְמַעַנְךָ עֲשה עִמָּנוּ חֶסֶד וְאַל תְּאַחַר: אָנָּא שׁוּב מֵחֲרונְךָ וְרַחֵם סְגֻלָּה אֲשֶׁר בָּחָרְתָּ:",
                              textAlign: TextAlign.justify,
                              textDirection: TextDirection.rtl,
                              style: GoogleFonts.suezOne(fontSize: 24),
                            )),
                        Padding(
                            padding: const EdgeInsets.all(8.0),
                            child: Text(
                              "ה' אֱלהֵי יִשרָאֵל. שׁוּב מֵחֲרון אַפֶּךָ וְהִנָּחֵם עַל הָרָעָה לְעַמֶּךָ:",
                              textAlign: TextAlign.justify,
                              textDirection: TextDirection.rtl,
                              style: GoogleFonts.suezOne(fontSize: 24),
                            )),
                        Padding(
                            padding: const EdgeInsets.all(8.0),
                            child: Text(
                              "קולֵנוּ תִשְׁמַע וְתָחון. וְאַל תִּטְּשֵׁנוּ בְּיַד איְבֵינוּ לִמְחות אֶת שְׁמֵנוּ. זְכר אֲשֶׁר נִשְׁבַּעְתָּ לַאֲבותֵינוּ כְּכוכְבֵי הַשָּׁמַיִם אַרְבֶּה אֶת זַרְעֲכֶם. וְעַתָּה נִשְׁאַרְנוּ מְעַט מֵהַרְבֵּה: וּבְכָל זאת שִׁמְךָ לא שָׁכָחְנוּ. נָא אַל תִּשְׁכָּחֵנוּ:",
                              textAlign: TextAlign.justify,
                              textDirection: TextDirection.rtl,
                              style: GoogleFonts.suezOne(fontSize: 24),
                            )),
                        Padding(
                            padding: const EdgeInsets.all(8.0),
                            child: Text(
                              "ה' אֱלהֵי יִשרָאֵל. שׁוּב מֵחֲרון אַפֶּךָ וְהִנָּחֵם עַל הָרָעָה לְעַמֶּךָ:",
                              textAlign: TextAlign.justify,
                              textDirection: TextDirection.rtl,
                              style: GoogleFonts.suezOne(fontSize: 24),
                            )),
                        Padding(
                            padding: const EdgeInsets.all(8.0),
                            child: Text(
                              "עָזְרֵנוּ אֱלהֵי יִשְׁעֵנוּ עַל דְּבַר כְּבוד שְׁמֶךָ. וְהַצִּילֵנוּ וְכַפֵּר עַל חַטּאתֵינוּ לְמַעַן שְׁמֶךָ:",
                              textAlign: TextAlign.justify,
                              textDirection: TextDirection.rtl,
                              style: GoogleFonts.suezOne(fontSize: 24),
                            )),
                        Padding(
                            padding: const EdgeInsets.all(8.0),
                            child: Text(
                              "ה' אֱלהֵי יִשרָאֵל. שׁוּב מֵחֲרון אַפֶּךָ וְהִנָּחֵם עַל הָרָעָה לְעַמֶּךָ:",
                              textAlign: TextAlign.justify,
                              textDirection: TextDirection.rtl,
                              style: GoogleFonts.suezOne(fontSize: 24),
                            )),
                      ],
                    )
                  : Container(),
              (JewishCalendar.fromDateTime(DateTime.now()).isTaanis())
                  ? Column(
                      children: [
                        Padding(
                            padding: const EdgeInsets.all(8.0),
                            child: Text(
                              "שׁומֵר יִשרָאֵל. שְׁמר שְׁאֵרִית יִשרָאֵל. וְאַל יאבַד יִשרָאֵל. הָאומְרִים שְׁמַע יִשרָאֵל:",
                              textAlign: TextAlign.justify,
                              textDirection: TextDirection.rtl,
                              style: GoogleFonts.suezOne(fontSize: 24),
                            )),
                        Padding(
                            padding: const EdgeInsets.all(8.0),
                            child: Text(
                              "שׁומֵר גּוי אֶחָד. שְׁמר שְׁאֵרִית עַם אֶחָד. וְאַל יאבַד גּוי אֶחָד. הַמְיַחֲדִים שִׁמְךָ ה' אֱלהֵינוּ ה' אֶחָד:",
                              textAlign: TextAlign.justify,
                              textDirection: TextDirection.rtl,
                              style: GoogleFonts.suezOne(fontSize: 24),
                            )),
                        Padding(
                            padding: const EdgeInsets.all(8.0),
                            child: Text(
                              "שׁומֵר גּוי קָדושׁ. שְׁמר שְׁאֵרִית עַם קָדושׁ. וְאַל יאבַד גּוי קָדושׁ. הַמְשַׁלְּשִׁים בְּשָׁלשׁ קְדֻשּׁות לְקָדושׁ:",
                              textAlign: TextAlign.justify,
                              textDirection: TextDirection.rtl,
                              style: GoogleFonts.suezOne(fontSize: 24),
                            )),
                        Padding(
                            padding: const EdgeInsets.all(8.0),
                            child: Text(
                              "מִתְרַצֶּה בְּרַחֲמִים וּמִתְפַּיֵּס בְּתַחֲנוּנִים. הִתְרַצֶּה וְהִתְפַּיֵּס לְדור עָנִי. כִּי אֵין עוזֵר: אָבִינוּ מַלְכֵּנוּ. חָנֵּנוּ וַעֲנֵנוּ. כִּי אֵין בָּנוּ מַעֲשים. עֲשה עִמָּנוּ צְדָקָה וָחֶסֶד וְהושִׁיעֵנוּ:",
                              textAlign: TextAlign.justify,
                              textDirection: TextDirection.rtl,
                              style: GoogleFonts.suezOne(fontSize: 24),
                            )),
                      ],
                    )
                  : Container(),
              Padding(
                  padding: const EdgeInsets.all(8.0),
                  child: Text(
                    "וַאֲנַחְנוּ לא נֵדַע מַה נַּעֲשה. כִּי עָלֶיךָ עֵינֵינוּ: זְכר רַחֲמֶיךָ ה' וַחֲסָדֶיךָ. כִּי מֵעולָם הֵמָּה: יְהִי חַסְדְּךָ ה' עָלֵינוּ. כַּאֲשֶׁר יִחַלְנוּ לָךְ: אַל תִּזְכָּר לָנוּ עֲונות רִאשׁונִים. מַהֵר יְקַדְּמוּנוּ רַחֲמֶיךָ. כִּי דַלּונוּ מְאד: חָנֵּנוּ ה' חָנֵּנוּ. כִּי רַב שבַעְנוּ בוּז: בְּרגֶז רַחֵם תִּזְכּור. כִּי הוּא יָדַע יִצְרֵנוּ. זָכוּר כִּי עָפָר אֲנָחְנוּ: עָזְרֵנוּ אֱלהֵי יִשְׁעֵנוּ עַל דְּבַר כְּבוד שְׁמֶךָ. וְהַצִּילֵנוּ וְכַפֵּר עַל חַטּאתֵינוּ לְמַעַן שְׁמֶךָ:",
                    textAlign: TextAlign.justify,
                    textDirection: TextDirection.rtl,
                    style: GoogleFonts.suezOne(fontSize: 24),
                  )),
            ],
          )
        : Container(),
    // Torah Reading
    (DateTime.now().weekday == DateTime.monday ||
            DateTime.now().weekday == DateTime.thursday)
        ? Column(
            children: [
              Padding(
                  padding: const EdgeInsets.all(8.0),
                  child: Card(
                    child: Padding(
                      padding: const EdgeInsets.all(8.0),
                      child: ExpansionTile(
                        title: Center(
                            child: Text(
                          "Kaddish",
                        )),
                        children: [
                          Text(
                            "יִתְגַּדֵּל וְיִתְקַדֵּשׁ שְׁמֵהּ רַבָּא.\nבְּעָלְמָא דִּי בְרָא כִּרְעוּתֵהּ וְיַמְלִיךְ מַלְכוּתֵהּ בְּחַיֵּיכון וּבְיומֵיכון וּבְחַיֵּי דְכָל בֵּית יִשרָאֵל, בַּעֲגָלָא וּבִזְמַן קָרִיב, וְאִמְרוּ אָמֵן.\nיְהֵא שְׁמֵהּ רַבָּא מְבָרַךְ לְעָלַם וּלְעָלְמֵי עָלְמַיָּא.\nיִתְבָּרַךְ וְיִשְׁתַּבַּח וְיִתְפָּאַר וְיִתְרומַם וְיִתְנַשׁא וְיִתְהַדַּר וְיִתְעַלֶּה שְׁמֵהּ דְּקֻדְשָׁא. בְּרִיךְ הוּא.\nלְעֵלָּא מִן כָּל בִּרְכָתָא וְשִׁירָתָא תֻּשְׁבְּחָתָא וְנֶחֱמָתָא דַּאֲמִירָן בְּעָלְמָא, וְאִמְרוּ אָמֵן.",
                            textAlign: TextAlign.justify,
                            textDirection: TextDirection.rtl,
                            style: GoogleFonts.suezOne(fontSize: 24),
                          )
                        ],
                      ),
                    ),
                  )),
              (JewishCalendar.fromDateTime(DateTime.now()).isTachanun())
                  ? Padding(
                      padding: const EdgeInsets.all(8.0),
                      child: Text(
                        "אֵל אֶרֶךְ אַפַּיִם וְרַב חֶסֶד וֶאֱמֶת. אַל בְּאַפְּךָ תוכִיחֵנוּ. חוּסָה ה' עַל יִשרָאֵל עַמֶּךָ וְהושִׁיעֵנוּ מִכָּל רָע. חָטָאנוּ לְךָ אָדון. סְלַח נָא כְּרוב רַחֲמֶיךָ אֵל:",
                        textAlign: TextAlign.justify,
                        textDirection: TextDirection.rtl,
                        style: GoogleFonts.suezOne(fontSize: 24),
                      ))
                  : Container(),
              Padding(
                  padding: const EdgeInsets.all(8.0),
                  child: Text(
                    "וַיְהִי בִּנְסעַ הָאָרן וַיּאמֶר משֶׁה קוּמָה ה' וְיָפֻצוּ איְבֶיךָ וְיָנֻסוּ מְשנְאֶיךָ מִפָּנֶיךָ: כִּי מִצִּיּון תֵּצֵא תורָה וּדְבַר ה' מִירוּשָׁלָיִם: בָּרוּךְ שֶׁנָּתַן תּורָה לְעַמּו יִשרָאֵל בִּקְדֻשָּׁתו:",
                    textAlign: TextAlign.justify,
                    textDirection: TextDirection.rtl,
                    style: GoogleFonts.suezOne(fontSize: 24),
                  )),
              Padding(
                  padding: const EdgeInsets.all(8.0),
                  child: Text(
                    "בְּרִיךְ שְׁמֵהּ דְּמָרֵא עָלְמָא. בְּרִיךְ כִּתְרָךְ וְאַתְרָךְ. יְהֵא רְעוּתָךְ עִם עַמָּךְ יִשרָאֵל לְעָלַם. וּפֻרְקַן יְמִינָךְ אַחֲזֵי לְעַמָּךְ בְּבֵית מַקְדְּשָׁךְ. וּלְאַמְטויֵי לָנָא מִטּוּב נְהורָךְ וּלְקַבֵּל צְלותָנָא בְּרַחֲמִין. יְהֵא רַעֲוָא קֳדָמָךְ דְּתורִיךְ לָן חַיִּין בְּטִיבוּ. וְלֶהֱוֵי אֲנָא פְקִידָא בְּגו צַדִּיקַיָּא. לְמִרְחַם עָלַי וּלְמִנְטַר יָתִי וְיַת כָּל דִּי לִי וְדִי לְעַמָּךְ יִשרָאֵל. אַנְתְּ הוּא זָן לְכלָּא וּמְפַרְנֵס לְכלָּא. אַנְתְּ הוּא שַׁלִּיט עַל כּלָּא. אַנְתְּ הוּא דְשַׁלִּיט עַל מַלְכַיָּא. וּמַלְכוּתָא דִּילָךְ הִיא. אֲנָא עַבְדָּא דְקֻדְשָׁא בְּרִיךְ הוּא דְּסָגִידְנָא קַמֵּהּ וּמִקַּמֵּי דִּיקַר אורַיְתֵהּ בְּכָל עִדָּן וְעִדָּן. לָא עַל אֱנָשׁ רָחִיצְנָא וְלָא עַל בַּר אֱלָהִין סָמִיכְנָא. אֶלָּא בֶּאֱלָהָא דִשְׁמַיָּא. דְּהוּא אֱלָהָא קְשׁוט וְאורַיְתֵהּ קְשׁוט וּנְבִיאוהִי קְשׁוט. וּמַסְגֵּא לְמֶעְבַּד טַבְוָן וּקְשׁוט. בֵּהּ אֲנָא רָחִיץ. וְלִשְׁמֵהּ יַקִּירָא קַדִּישָׁא אֲנָא אֵמַר תֻּשְׁבְּחָן. יְהֵא רַעֲוָא קֳדָמָךְ דְּתִפְתַּח לִבָּאִי בְּאורַיְתָא. וְתַשְׁלִים מִשְׁאֲלִין דְּלִבָּאי וְלִבָּא דְכָל עַמָּךְ יִשרָאֵל. לְטַב וּלְחַיִּין וְלִשְׁלָם:",
                    textAlign: TextAlign.justify,
                    textDirection: TextDirection.rtl,
                    style: GoogleFonts.suezOne(fontSize: 24),
                  )),
              Padding(
                  padding: const EdgeInsets.all(8.0),
                  child: Text(
                    "חזן: גַּדְּלוּ לה' אִתִּי וּנְרומְמָה שְׁמו יַחְדָּו:",
                    textAlign: TextAlign.justify,
                    textDirection: TextDirection.rtl,
                    style: GoogleFonts.suezOne(fontSize: 24),
                  )),
              Padding(
                  padding: const EdgeInsets.all(8.0),
                  child: Text(
                    "קהל: לְךָ ה' הַגְּדֻלָּה וְהַגְּבוּרָה וְהַתִּפְאֶרֶת וְהַנֵּצַח וְהַהוד כִּי כל בַּשָּׁמַיִם וּבָאָרֶץ: לְךָ ה' הַמַּמְלָכָה וְהַמִּתְנַשּא לְכל לְראשׁ: רומְמוּ ה' אֱלהֵינוּ וְהִשְׁתַּחֲווּ לַהֲדם רַגְלָיו קָדושׁ הוּא: רומְמוּ ה' אֱלהֵינוּ וְהִשְׁתַּחֲווּ לְהַר קָדְשׁו כִּי קָדושׁ ה' אֱלהֵינוּ:",
                    textAlign: TextAlign.justify,
                    textDirection: TextDirection.rtl,
                    style: GoogleFonts.suezOne(fontSize: 24),
                  )),
              Padding(
                  padding: const EdgeInsets.all(8.0),
                  child: Text(
                    "אַב הָרַחֲמִים. הוּא יְרַחֵם עַם עֲמוּסִים וְיִזְכּור בְּרִית אֵיתָנִים. וְיַצִּיל נַפְשׁותֵינוּ מִן הַשָּׁעות הָרָעות. וְיִגְעַר בְּיֵצֶר הָרָע מִן הַנְּשוּאִים. וְיָחון אותָנוּ לִפְלֵיטַת עולָמִים. וִימַלֵּא מִשְׁאֲלותֵינוּ בְּמִדָּה טובָה יְשׁוּעָה וְרַחֲמִים:",
                    textAlign: TextAlign.justify,
                    textDirection: TextDirection.rtl,
                    style: GoogleFonts.suezOne(fontSize: 24),
                  )),
              Padding(
                  padding: const EdgeInsets.all(8.0),
                  child: Text(
                    "וְתִגָּלֶה וְתֵרָאֶה מַלְכוּתו עָלֵינוּ בִּזְמַן קָרוב. וְיָחון פְּלֵטָתֵנוּ וּפְלֵטַת עַמּו בֵּית יִשרָאֵל לְחֵן וּלְחֶסֶד וּלְרַחֲמִים וּלְרָצון וְנאמַר אָמֵן. הַכּל הָבוּ גדֶל לֵאלהֵינוּ וּתְנוּ כָבוד לַתּורָה. כּהֵן קְרָב יַעֲמד [פלוני בן פלוני] הַכּהֵן.",
                    textAlign: TextAlign.justify,
                    textDirection: TextDirection.rtl,
                    style: GoogleFonts.suezOne(fontSize: 24),
                  )),
              Padding(
                  padding: const EdgeInsets.all(8.0),
                  child: Text(
                    " בָּרוּךְ שֶׁנָּתַן תּורָה לְעַמּו יִשרָאֵל בִּקְדֻשָּׁתו:",
                    textAlign: TextAlign.center,
                    textDirection: TextDirection.rtl,
                    style: GoogleFonts.suezOne(fontSize: 24),
                  )),
              Padding(
                  padding: const EdgeInsets.all(8.0),
                  child: Text(
                    "",
                    textAlign: TextAlign.justify,
                    textDirection: TextDirection.rtl,
                    style: GoogleFonts.suezOne(fontSize: 24),
                  )),
              // TODO: add Torah Portion
            ],
          )
        : Container(),
    // Ashrei
    Column(
      children: [
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "אַשְׁרֵי יושְׁבֵי בֵיתֶךָ. עוד יְהַלְלוּךָ סֶּלָה: אַשְׁרֵי הָעָם שֶׁכָּכָה לּו. אַשְׁרֵי הָעָם שה' אֱלהָיו: תְּהִלָּה לְדָוִד. אֲרומִמְךָ אֱלוהַי הַמֶּלֶךְ. וַאֲבָרְכָה שִׁמְךָ לְעולָם וָעֶד: בְּכָל יום אֲבָרְכֶךָּ. וַאֲהַלְלָה שִׁמְךָ לְעולָם וָעֶד: גָּדול ה' וּמְהֻלָּל מְאד. וְלִגְדֻלָּתו אֵין חֵקֶר: דּור לְדור יְשַׁבַּח מַעֲשיךָ. וּגְבוּרתֶיךָ יַגִּידוּ: הֲדַר כְּבוד הודֶךָ. וְדִבְרֵי נִפְלְאתֶיךָ אָשיחָה: וֶעֱזוּז נורְאתֶיךָ יאמֵרוּ. וּגְדֻלָּתְךָ אֲסַפְּרֶנָּה: זֵכֶר רַב טוּבְךָ יַבִּיעוּ. וְצִדְקָתְךָ יְרַנֵּנוּ: חַנּוּן וְרַחוּם ה'. אֶרֶךְ אַפַּיִם וּגְדָל חָסֶד: טוב ה' לַכּל. וְרַחֲמָיו עַל כָּל מַעֲשיו: יודוּךָ ה' כָּל מַעֲשיךָ. וַחֲסִידֶיךָ יְבָרְכוּכָה: כְּבוד מַלְכוּתְךָ יאמֵרוּ. וּגְבוּרָתְךָ יְדַבֵּרוּ: לְהודִיעַ לִבְנֵי הָאָדָם גְּבוּרתָיו. וּכְבוד הֲדַר מַלְכוּתו: מַלְכוּתְךָ מַלְכוּת כָּל עולָמִים. וּמֶמְשַׁלְתְּךָ בְּכָל דּור וָדר: סומֵךְ ה' לְכָל הַנּפְלִים. וְזוקֵף לְכָל הַכְּפוּפִים: עֵינֵי כל אֵלֶיךָ יְשבֵּרוּ. וְאַתָּה נותֵן לָהֶם אֶת אָכְלָם בְּעִתּו: פּותֵחַ אֶת יָדֶךָ. וּמַשבִּיעַ לְכָל חַי רָצון: צַדִּיק ה' בְּכָל דְּרָכָיו. וְחָסִיד בְּכָל מַעֲשיו: קָרוב ה' לְכָל קרְאָיו. לְכל אֲשֶׁר יִקְרָאֻהוּ בֶאֱמֶת: רְצון יְרֵאָיו יַעֲשה. וְאֶת שַׁוְעָתָם יִשְׁמַע וְיושִׁיעֵם: שׁומֵר ה' אֶת כָּל אהֲבָיו. וְאֵת כָּל הָרְשָׁעִים יַשְׁמִיד: תְּהִלַּת ה' יְדַבֶּר פִּי. וִיבָרֵךְ כָּל בָּשר שֵׁם קָדְשׁו לְעולָם וָעֶד: וַאֲנַחְנוּ נְבָרֵךְ יָהּ מֵעַתָּה וְעַד עולָם. הַלְלוּיָהּ:",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        (JewishCalendar.fromDateTime(DateTime.now()).isLamnatzeach())
            ? Padding(
                padding: const EdgeInsets.all(8.0),
                child: Text(
                  "לַמְנַצֵּחַ מִזְמור לְדָוִד: יַעַנְךָ יְהוָה בְּיום צָרָה. יְשַׂגֶּבְךָ שֵׁם אֱלהֵי יַעֲקב: יִשְׁלַח עֶזְרְךָ מִקּדֶשׁ. וּמִצִּיּון יִסְעָדֶךָּ: יִזְכּר כָּל מִנְחתֶיךָ. וְעולָתְךָ יְדַשְּׁנֶה סֶלָה: יִתֶּן לְךָ כִלְבָבֶךָ. וְכָל עֲצָתְךָ יְמַלֵּא: נְרַנְּנָה בִּישׁוּעָתֶךָ. וּבְשֵׁם אֱלהֵינוּ נִדְגּל. יְמַלֵּא יְהוָה כָּל מִשְׁאֲלותֶיךָ: עַתָּה יָדַעְתִּי. כִּי הושִׁיעַ יְהוָה מְשִׁיחו. יַעֲנֵהוּ מִשְּׁמֵי קָדְשׁו. בִּגְבוּרות יֵשַׁע יְמִינו: אֵלֶּה בָרֶכֶב וְאֵלֶּה בַסּוּסִים. וַאֲנַחְנוּ בְּשֵׁם יְהוָה אֱלהֵינוּ נַזְכִּיר: הֵמָּה כָּרְעוּ וְנָפָלוּ. וַאֲנַחְנוּ קַמְנוּ וַנִּתְעודָד: יְהוָה הושִׁיעָה הַמֶּלֶךְ יַעֲנֵנוּ בְיום קָרְאֵנוּ:",
                  textAlign: TextAlign.justify,
                  textDirection: TextDirection.rtl,
                  style: GoogleFonts.suezOne(fontSize: 24),
                ))
            : Container(),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "וּבָא לְצִיּון גּואֵל וּלְשָׁבֵי פֶשַׁע בְּיַעֲקב. נְאֻם יְהוָה: וַאֲנִי זאת בְּרִיתִי. אותָם אָמַר יְהוָה. רוּחִי אֲשֶׁר עָלֶיךָ וּדְבָרַי אֲשֶׁר שַׂמְתִּי בְּפִיךָ. לא יָמוּשׁוּ מִפִּיךָ וּמִפִּי זַרְעֲךָ וּמִפִּי זֶרַע זַרְעֲךָ. אָמַר יְהוָה. מֵעַתָּה וְעַד עולָם: וְאַתָּה קָדושׁ יושֵׁב תְּהִלּות יִשְׂרָאֵל. וְקָרָא זֶה אֶל זֶה וְאָמַר:",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "קָדושׁ. קָדושׁ. קָדושׁ יְהוָה צְבָאות. מְלא כָל הָאָרֶץ כְּבודו:",
              textAlign: TextAlign.center,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "וּמְקַבְּלִין דֵּין מִן דֵּין. וְאָמְרִין קַדִּישׁ בִּשְׁמֵי מְרומָא עִלָּאָה בֵּית שְׁכִינְתֵּהּ. קַדִּישׁ עַל אַרְעָא עובַד גְּבוּרְתֵּהּ. קַדִּישׁ לְעָלַם וּלְעָלְמֵי עָלְמַיָּא. יְהוָה צְבָאות. מַלְיָא כָל אַרְעָא זִיו יְקָרֵהּ: וַתִּשָּׂאֵנִי רוּחַ. וָאֶשְׁמַע אַחֲרַי קול רַעַשׁ גָדול.",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "בָּרוּךְ כְּבוד יְהוָה מִמְּקומו:",
              textAlign: TextAlign.center,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "וּנְטָלַתְנִי רוּחָא. וּשְׁמָעִית בַּתְרַי קָל זִיעַ סַגִּיא דִּמְשַׁבְּחִין וְאָמְרִין: בְּרִיךְ יְקָרָא דַיהוָה מֵאֲתַר בֵּית שְׁכִינְתֵּהּ: יְהוָה יִמְלךְ לְעולָם וָעֶד: יְהוָה מַלְכוּתֵהּ קָאֵם לְעָלַם וּלְעָלְמֵי עָלְמַיָּא. יְהוָה אֱלהֵי אַבְרָהָם יִצְחָק וְיִשְׂרָאֵל אֲבותֵינוּ. שָׁמְרָה זּאת לְעולָם לְיֵצֶר מַחְשְׁבות לְבַב עַמֶּךָ. וְהָכֵן לְבָבָם אֵלֶיךָ: וְהוּא רַחוּם. יְכַפֵּר עָון וְלא יַשְׁחִית. וְהִרְבָּה לְהָשִׁיב אַפּו. וְלא יָעִיר כָּל חֲמָתו: כִּי אַתָּה אֲדנָי טוב וְסַלָּח. וְרַב חֶסֶד לְכָל קרְאֶיךָ: צִדְקָתְךָ צֶדֶק לְעולָם וְתורָתְךָ אֱמֶת: תִּתֵּן אֱמֶת לְיַעֲקב. חֶסֶד לְאַבְרָהָם. אֲשֶׁר נִשְׁבַּעְתָּ לַאֲבתֵינוּ מִימֵי קֶדֶם: בָּרוּךְ אֲדנָי יום יום יַעֲמָס לָנוּ. הָאֵל יְשׁוּעָתֵנוּ סֶלָה: יְהוָה צְבָאות עִמָּנוּ. מִשְׂגָּב לָנוּ אֱלהֵי יַעֲקב סֶלָה: יְהוָה צְבָאות אַשְׁרֵי אָדָם בּטֵחַ בָּךְ: יְהוָה הושִׁיעָה. הַמֶּלֶךְ יַעֲנֵנוּ בְיום קָרְאֵנוּ: בָּרוּךְ הוּא אֱלהֵינוּ שֶׁבְּרָאָנוּ לִכְבודו. וְהִבְדִּילָנוּ מִן הַתּועִים. וְנָתַן לָנוּ תּורַת אֱמֶת. וְחַיֵּי עולָם נָטַע בְּתוכֵנוּ. הוּא יִפְתַּח לִבֵּנוּ בְּתורָתו. וְיָשֵׂם בְּלִבֵּנוּ אַהֲבָתו וְיִרְאָתו וְלַעֲשׂות רְצונו וּלְעָבְדו בְּלֵבָב שָׁלֵם. לְמַעַן לא נִיגַע לָרִיק וְלא נֵלֵד לַבֶּהָלָה: יְהִי רָצון מִלְּפָנֶיךָ יְהוָה אֱלהֵינוּ וֵאלהֵי אֲבותֵינוּ. שֶׁנִּשְׁמר חֻקֶּיךָ בָּעולָם הַזֶּה. וְנִזְכֶּה וְנִחְיֶה וְנִרְאֶה וְנִירַשׁ טובָה וּבְרָכָה לִשְׁנֵי יְמות הַמָּשִׁיחַ וּלְחַיֵּי הָעולָם הַבָּא. לְמַעַן יְזַמֶּרְךָ כָבוד וְלא יִדּם. יְהוָה אֱלהַי לְעולָם אודֶךָּ: בָּרוּךְ הַגֶּבֶר אֲשֶׁר יִבְטַח בַּיהוָה. וְהָיָה יְהוָה מִבְטַחו: בִּטְחוּ בַיהוָה עֲדֵי עַד. כִּי בְּיָהּ יְהוָה צוּר עולָמִים: וְיִבְטְחוּ בְךָ יודְעֵי שְׁמֶךָ. כִּי לא עָזַבְתָּ דּרְשֶׁיךָ יְהוָה: יְהוָה חָפֵץ לְמַעַן צִדְקו. יַגְדִּיל תּורָה וְיַאְדִּיר:",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Card(
              child: Padding(
                padding: const EdgeInsets.all(8.0),
                child: ExpansionTile(
                  title: Center(
                      child: Text(
                    "Kaddish",
                  )),
                  children: [
                    Text(
                      "יִתְגַּדֵּל וְיִתְקַדֵּשׁ שְׁמֵהּ רַבָּא.\nבְּעָלְמָא דִּי בְרָא כִּרְעוּתֵהּ וְיַמְלִיךְ מַלְכוּתֵהּ בְּחַיֵּיכון וּבְיומֵיכון וּבְחַיֵּי דְכָל בֵּית יִשרָאֵל, בַּעֲגָלָא וּבִזְמַן קָרִיב, וְאִמְרוּ אָמֵן.\nיְהֵא שְׁמֵהּ רַבָּא מְבָרַךְ לְעָלַם וּלְעָלְמֵי עָלְמַיָּא.\nיִתְבָּרַךְ וְיִשְׁתַּבַּח וְיִתְפָּאַר וְיִתְרומַם וְיִתְנַשׁא וְיִתְהַדַּר וְיִתְעַלֶּה שְׁמֵהּ דְּקֻדְשָׁא. בְּרִיךְ הוּא.\nלְעֵלָּא מִן כָּל בִּרְכָתָא וְשִׁירָתָא תֻּשְׁבְּחָתָא וְנֶחֱמָתָא דַּאֲמִירָן בְּעָלְמָא, וְאִמְרוּ אָמֵן.\n תִּתְקַבַּל צְלוֹתְהוֹן וּבָעוּתְהוֹן דְּכָל בֵּית יִשְׂרָאֵל קֳדָם אֲבוּהוֹן דִּי בִשְׁמַיָּא, וְאִמְרוּ אָמֵן.\n יְהֵא שְׁלָמָא רַבָּא מִן שְׁמַיָא וְחַיִּים עָלֵינו וְעַל כָּל יִשְׂרָאֵל וְאִמְרוּ אָמֵן:\n עוֹשֶׂה שָׁלוֹם בעשרת ימי תשובה: השלום בִּמְרוֹמָיו הוּא יַעֲשֶׂה שָׁלוֹם עָלֵינוּ וְעַל כָּל יִשְׂרָאֵל, וְאִמְרוּ אָמֵן:",
                      textAlign: TextAlign.justify,
                      textDirection: TextDirection.rtl,
                      style: GoogleFonts.suezOne(fontSize: 24),
                    )
                  ],
                ),
              ),
            )),
      ],
    ),
    // Aleinu
    Column(
      children: [
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "עָלֵינוּ לְשַׁבֵּחַ לַאֲדון הַכּל. לָתֵת גְּדֻלָּה לְיוצֵר בְּרֵאשִׁית. שֶׁלּא עָשנוּ כְּגויֵי הָאֲרָצות. וְלא שמָנוּ כְּמִשְׁפְּחות הָאֲדָמָה. שֶׁלּא שם חֶלְקֵנוּ כָּהֶם וְגורָלֵנוּ כְּכָל הֲמונָם: שֶׁהֵם מִשְׁתַּחֲוִים לְהֶבֶל וְרִיק וּמִתְפַּלְלִים אֶל אֵל לא יושִׁיעַ: וַאֲנַחְנוּ כּורְעִים וּמִשְׁתַּחֲוִים וּמודִים לִפְנֵי מֶלֶךְ מַלְכֵי הַמְּלָכִים הַקָּדושׁ בָּרוּךְ הוּא: שֶׁהוּא נוטֶה שָׁמַיִם וְיוסֵד אָרֶץ, וְכִסֵּא כְבוֹדוֹ בַּשָּׁמַיִם מִמַּעַל. וּשְׁכִינַת עֻזּו בְּגָבְהֵי מְרומִים: הוּא אֱלהֵינוּ אֵין עוד. אֱמֶת מַלְכֵּנוּ. אֶפֶס זוּלָתו. כַּכָּתוּב בְּתורָתו. וְיָדַעְתָּ הַיּום וַהֲשֵׁבתָ אֶל לְבָבֶךָ. כִּי ה' הוּא הָאֱלהִים בַּשָּׁמַיִם מִמַּעַל וְעַל הָאָרֶץ מִתָּחַת. אֵין עוד:",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
        Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "עַל כֵּן נְקַוֶּה לְּךָ ה' אֱלהֵינוּ לִרְאות מְהֵרָה בְּתִפְאֶרֶת עֻזֶּךָ. לְהַעֲבִיר גִּלּוּלִים מִן הָאָרֶץ. וְהָאֱלִילִים כָּרות יִכָּרֵתוּן. לְתַקֵּן עולָם בְּמַלְכוּת שַׁדַּי. וְכָל בְּנֵי בָשר יִקְרְאוּ בִשְׁמֶךָ לְהַפְנות אֵלֶיךָ כָּל רִשְׁעֵי אָרֶץ. יַכִּירוּ וְיֵדְעוּ כָּל יושְׁבֵי תֵבֵל. כִּי לְךָ תִּכְרַע כָּל בֶּרֶךְ. תִּשָּׁבַע כָּל לָשׁון. לְפָנֶיךָ ה' אֱלהֵינוּ יִכְרְעוּ וְיִפּלוּ. וְלִכְבוד שִׁמְךָ יְקָר יִתֵּנוּ. וִיקַבְּלוּ כֻלָּם אֶת על מַלְכוּתֶךָ. וְתִמְלךְ עֲלֵיהֶם מְהֵרָה לְעולָם וָעֶד. כִּי הַמַּלְכוּת שֶׁלְּךָ הִיא וּלְעולְמֵי עַד תִּמְלךְ בְּכָבוד. כַּכָּתוּב בְּתורָתֶךָ. ה' יִמְלךְ לְעולָם וָעֶד:",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            )),
      ],
    ),
    // Song of the day
    SongOfTheDay(),
  ];

  List<DropdownMenuItem<int>> dropDownMenuItems = [
    DropdownMenuItem(
      value: 0,
      child: Text(
        "Morning Prayers",
//                  style: TextStyle(color: Theme.of(context).accentColor),
      ),
    ),
    DropdownMenuItem(
      value: 1,
      child: Text(
        "Birkoth HaTorah",
//                  style: TextStyle(color: Theme.of(context).accentColor),
      ),
    ),
    DropdownMenuItem(
      value: 2,
      child: Text(
        "Seder HaKorbanoth",
//                  style: TextStyle(color: Theme.of(context).accentColor),
      ),
    ),
    DropdownMenuItem(
      value: 3,
      child: Text(
        "Psukei D'Zimra",
//                  style: TextStyle(color: Theme.of(context).accentColor),
      ),
    ),
    DropdownMenuItem(
      value: 4,
      child: Text(
        "Shema",
//                  style: TextStyle(color: Theme.of(context).accentColor),
      ),
    ),
    DropdownMenuItem(
      value: 5,
      child: Text(
        "Shmonei Esrei",
//                  style: TextStyle(color: Theme.of(context).accentColor),
      ),
    ),

    DropdownMenuItem(
      value: 10,
      child: Text(
        "Ashrei",
//                  style: TextStyle(color: Theme.of(context).accentColor),
      ),
    ),
    DropdownMenuItem(
      value: 11,
      child: Text(
        "Aleinu",
//                  style: TextStyle(color: Theme.of(context).accentColor),
      ),
    ),
    DropdownMenuItem(
      value: 12,
      child: Text(
        "Song of the day",
//                  style: TextStyle(color: Theme.of(context).accentColor),
      ),
    ),
  ];

  int _value = 0;

  @override
  void initState() {
    super.initState();

    itemScrollController = ItemScrollController();

    if (IS_TAANITH || IS_TEN_DAYS) {
      dropDownMenuItems.insert(
          5,
          DropdownMenuItem(
            value: 7,
            child: Text(
              "Avinu Malkeinu",
//                  style: TextStyle(color: Theme.of(context).accentColor),
            ),
          ));
    }
    if (IS_TACHANUN) {
      dropDownMenuItems.insert(
          6,
          DropdownMenuItem(
            value: 8,
            child: Text(
              "Tachanun",
//                  style: TextStyle(color: Theme.of(context).accentColor),
            ),
          ));
    }
    if (IS_MONDAY_OR_TUESDAY) {
      dropDownMenuItems.insert(
          7,
          DropdownMenuItem(
            value: 8,
            child: Text(
              "Torah Reading",
//                  style: TextStyle(color: Theme.of(context).accentColor),
            ),
          ));
    }
    if (IS_HALLEL) {
      dropDownMenuItems.insert(
          5,
          DropdownMenuItem(
            value: 6,
            child: Text(
              "HALLEL",
//                  style: TextStyle(color: Theme.of(context).accentColor),
            ),
          ));
    }

  }

//   TODO: Implement autoscoll
  void autoScroll(){
//        itemScrollController.scrollTo(index:_scrollIndex+1,
//            duration: Duration(seconds: 30),
//            alignment: 0,
//            curve: Curves.linear);
  }
  
  @override
  Widget build(BuildContext context) {

    itemPositionsListener.itemPositions.addListener(() {
      if (itemPositionsListener.itemPositions.value.length > 0) {
        int currentIndex =
            itemPositionsListener.itemPositions.value.elementAt(0).index;
        setState(() {
          _scrollIndex = currentIndex;
        });
        if (currentIndex < dropDownMenuItems.length && currentIndex > -1) {
          if (currentIndex == 7) {
            if (IS_TAANITH || IS_TEN_DAYS) {
              setState(() {
                _value = currentIndex;
              });
            }
          } else if (currentIndex == 8) {
            if (IS_TACHANUN) {
              setState(() {
                _value = currentIndex;
              });
            }
          } else if (currentIndex == 9) {
            if (IS_MONDAY_OR_TUESDAY) {
              setState(() {
                _value = currentIndex;
              });
            }
          } else if (currentIndex == 6) {
            if (IS_HALLEL) {
              setState(() {
                _value = currentIndex;
              });
            }
          }else {
            setState(() {
              _value = currentIndex;
            });
          }
        }
      }
    });

    return Scaffold(
      backgroundColor: Theme.of(context).primaryColor,
      appBar: AppBar(
        leading: Builder(
          builder: (context) {
            return IconButton(
              icon: Icon(Icons.menu),
              onPressed: () => CustomDrawer.of(context).open(),
            );
          },
        ),
        title: new DropdownButton(
          underline: Container(),
          items: dropDownMenuItems,
          onChanged: (value) {
            itemScrollController.jumpTo(index: value);
            setState(() {
              _value = value;
            });
          },
          value: _value,
        ),
      ),
      body: GestureDetector(
        onDoubleTap: () {
          autoScroll();
        },
        onScaleStart: (details) {
          _baseScaleFactor = _scaleFactor;
        },
        onScaleUpdate: (details) {
          print(details.scale);
          setState(() {
            _scaleFactor = _baseScaleFactor * details.scale;
          });
        },
        child: Center(
            child: ScrollablePositionedList.builder(
          scrollDirection: Axis.vertical,
          itemCount: morningPrayers.length,
          itemBuilder: (context, index) => morningPrayers[index],
          itemScrollController: itemScrollController,
          itemPositionsListener: itemPositionsListener,
        )),
      ),
    );
  }

  @override
  void dispose() {
    super.dispose();
  }
}
