import 'package:flutter/material.dart';
import 'package:google_fonts/google_fonts.dart';
import 'package:siddur/tools/hebrewcalendar/jewish_calendar.dart';
import 'package:siddur/tools/hebrewcalendar/jewish_date.dart';

class SongOfTheDay extends StatelessWidget{
  final TODAY = DateTime.now();
  final JEWISH_DATE_TODAY = JewishCalendar.fromDateTime(DateTime.now());

  @override
  Widget build(BuildContext context) {

    if(JEWISH_DATE_TODAY.isRoshChodesh())
      {
        return Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "בָּרֲכִי נַפְשִׁי אֶת יְהוָה יְהוָה אֱלֹהַי גָּדַלְתָּ מְּאֹד הוֹד וְהָדָר לָבָשְׁתָּ. ב עֹטֶה אוֹר כַּשַּׂלְמָה נוֹטֶה שָׁמַיִם כַּיְרִיעָה. גהַמְקָרֶה בַמַּיִם עֲ‍לִיּוֹתָיו הַשָּׂם עָבִים רְכוּבוֹ הַמְהַלֵּךְ עַל כַּנְפֵי רוּחַ. ד עֹשֶׂה מַלְאָכָיו רוּחוֹת מְשָׁרְתָיו אֵשׁ לֹהֵט. היָסַד אֶרֶץ עַל מְכוֹנֶיהָ בַּל תִּמּוֹט עוֹלָם וָעֶד. ו תְּהוֹם כַּלְּבוּשׁ כִּסִּיתוֹ עַל הָרִים יַעַמְדוּ מָיִם. ז מִן גַּעֲרָתְךָ יְנוּסוּן מִן קוֹל רַעַמְךָ יֵחָפֵזוּן. ח יַעֲלוּ הָרִים יֵרְדוּ בְקָעוֹת אֶל מְקוֹם זֶה יָסַדְתָּ לָהֶם. ט גְּבוּל שַׂמְתָּ בַּל יַעֲבֹרוּן בַּל יְשׁוּבוּן לְכַסּוֹת הָאָרֶץ. י הַמְשַׁלֵּחַ מַעְיָנִים בַּנְּחָלִים בֵּין הָרִים יְהַלֵּכוּן. יא יַשְׁקוּ כָּל חַיְתוֹ שָׂדָי יִשְׁבְּרוּ פְרָאִים צְמָאָם. יבעֲלֵיהֶם עוֹף הַשָּׁמַיִם יִשְׁכּוֹן מִבֵּין עֳפָאיִם יִתְּנוּ קוֹל. יג מַשְׁקֶה הָרִים מֵעֲלִיּוֹתָיו מִפְּרִי מַעֲשֶׂיךָ תִּשְׂבַּע הָאָרֶץ. ידמַצְמִיחַ חָצִיר לַבְּהֵמָה וְעֵשֶׂב לַעֲבֹדַת הָאָדָם לְהוֹצִיא לֶחֶם מִן הָאָרֶץ. טו וְיַיִן יְשַׂמַּח לְבַב אֱנוֹשׁ לְהַצְהִיל פָּנִים מִשָּׁמֶן וְלֶחֶם לְבַב אֱנוֹשׁ יִסְעָד. טז יִשְׂבְּעוּ עֲצֵי יְהוָה אַרְזֵי לְבָנוֹן אֲשֶׁר נָטָע. יז אֲשֶׁר שָׁם צִפֳּרִים יְקַנֵּנוּ חֲסִידָה בְּרוֹשִׁים בֵּיתָהּ. יח הָרִים הַגְּבֹהִים לַיְּעֵלִים סְלָעִים מַחְסֶה לַשְׁפַנִּים. יט עָשָׂה יָרֵחַ לְמוֹעֲדִים שֶׁמֶשׁ יָדַע מְבוֹאוֹ. כתָּשֶׁת חֹשֶׁךְ וִיהִי לָיְלָה בּוֹ תִרְמֹשׂ כָּל חַיְתוֹ יָעַר. כא הַכְּפִירִים שֹׁאֲגִים לַטָּרֶף וּלְבַקֵּשׁ מֵאֵל אָכְלָם. כב תִּזְרַח הַשֶּׁמֶשׁ יֵאָסֵפוּן וְאֶל מְעוֹנֹתָם יִרְבָּצוּן. כג יֵצֵא אָדָם לְפָעֳלוֹ וְלַעֲבֹדָתוֹ עֲדֵי עָרֶב. כד מָה רַבּוּ מַעֲשֶׂיךָ יְהוָה כֻּלָּם בְּחָכְמָה עָשִׂיתָ מָלְאָה הָאָרֶץ קִנְיָנֶךָ. כה זֶה הַיָּם גָּדוֹל וּרְחַב יָדָיִם שָׁם רֶמֶשׂ וְאֵין מִסְפָּר חַיּוֹת קְטַנּוֹת עִם גְּדֹלוֹת. כו שָׁם אֳנִיּוֹת יְהַלֵּכוּן לִוְיָתָן זֶה יָצַרְתָּ לְשַׂחֶק בּוֹ. כז כֻּלָּם אֵלֶיךָ יְשַׂבֵּרוּן לָתֵת אָכְלָם בְּעִתּוֹ. כח תִּתֵּן לָהֶם יִלְקֹטוּן תִּפְתַּח יָדְךָ יִשְׂבְּעוּן טוֹב. כט תַּסְתִּיר פָּנֶיךָ יִבָּהֵלוּן תֹּסֵף רוּחָם יִגְוָעוּן וְאֶל עֲפָרָם יְשׁוּבוּן. ל תְּשַׁלַּח רוּחֲךָ יִבָּרֵאוּן וּתְחַדֵּשׁ פְּנֵי אֲדָמָה. לא יְהִי כְבוֹד יְהוָה לְעוֹלָם יִשְׂמַח יְהוָה בְּמַעֲשָׂיו. לב הַמַּבִּיט לָאָרֶץ וַתִּרְעָד יִגַּע בֶּהָרִים וְיֶעֱשָׁנוּ. לגאָשִׁירָה לַיהוָה בְּחַיָּי אֲזַמְּרָה לֵאלֹהַי בְּעוֹדִי. לד יֶעֱרַב עָלָיו שִׂיחִי אָנֹכִי אֶשְׂמַח בַּיהוָה. לה יִתַּמּוּ חַטָּאִים מִן הָאָרֶץ וּרְשָׁעִים עוֹד אֵינָם בָּרֲכִי נַפְשִׁי אֶת יְהוָה הַלְלוּ יָהּ.",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            ));
      }
    else{
      if(JEWISH_DATE_TODAY.isChanukah()){
        return Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "מִזְמ֡וֹר שִׁיר־חֲנֻכַּ֖ת הַבַּ֣יִת לְדָוִֽד׃ באֲרוֹמִמְךָ֣ יְ֭הוָה כִּ֣י דִלִּיתָ֑נִי וְלֹא־שִׂמַּ֖חְתָּ אֹיְבַ֣י לִֽי׃ גיְהוָ֥ה אֱלֹהָ֑י שִׁוַּ֥עְתִּי אֵ֝לֶ֗יךָ וַתִּרְפָּאֵֽנִי׃ דיְֽהוָ֗ה הֶֽעֱלִ֣יתָ מִן־שְׁא֣וֹל נַפְשִׁ֑י חִ֝יִּיתַ֗נִי מיורדי־[מִיָּֽרְדִי־] בֽוֹר׃ הזַמְּר֣וּ לַיהוָ֣ה חֲסִידָ֑יו וְ֝הוֹד֗וּ לְזֵ֣כֶר קָדְשֽׁוֹ׃ וכִּ֤י רֶ֨גַע ׀ בְּאַפּוֹ֮ חַיִּ֪ים בִּרְצ֫וֹנ֥וֹ בָּ֭עֶרֶב יָלִ֥ין בֶּ֗כִי וְלַבֹּ֥קֶר רִנָּֽה׃ זוַ֭אֲנִי אָמַ֣רְתִּי בְשַׁלְוִ֑י בַּל־אֶמּ֥וֹט לְעוֹלָֽם׃ חיְֽהוָ֗ה בִּרְצוֹנְךָ֮ הֶעֱמַ֪דְתָּה לְֽהַרְרִ֫י עֹ֥ז הִסְתַּ֥רְתָּ פָנֶ֗יךָ הָיִ֥יתִי נִבְהָֽל׃ טאֵלֶ֣יךָ יְהוָ֣ה אֶקְרָ֑א וְאֶל־אֲ֝דֹנָ֗י אֶתְחַנָּֽן׃ ימַה־בֶּ֥צַע בְּדָמִי֮ בְּרִדְתִּ֪י אֶ֫ל־שָׁ֥חַת הֲיוֹדְךָ֥ עָפָ֑ר הֲיַגִּ֥יד אֲמִתֶּֽךָ׃ יאשְׁמַע־יְהוָ֥ה וְחָנֵּ֑נִי יְ֝הוָה הֱ‍ֽיֵה־עֹזֵ֥ר לִֽי׃ יבהָפַ֣כְתָּ מִסְפְּדִי֮ לְמָח֪וֹל לִ֥י פִּתַּ֥חְתָּ שַׂקִּ֑י וַֽתְּאַזְּרֵ֥נִי שִׂמְחָֽה׃ יגלְמַ֤עַן ׀ יְזַמֶּרְךָ֣ כָ֭בוֹד וְלֹ֣א יִדֹּ֑ם יְהוָ֥ה אֱ֝לֹהַ֗י לְעוֹלָ֥ם אוֹדֶֽךָּ׃",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            ));
      }
      if(JEWISH_DATE_TODAY.isPurim()){
        return Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              "לַ֭מְנַצֵּחַ עַל־אַיֶּ֥לֶת הַשַּׁ֗חַר מִזְמ֥וֹר לְדָוִֽד׃ באֵלִ֣י אֵ֭לִי לָמָ֣ה עֲזַבְתָּ֑נִי רָח֥וֹק מִֽ֝ישׁוּעָתִ֗י דִּבְרֵ֥י שַׁאֲגָתִֽי׃ גאֱ‍ֽלֹהַ֗י אֶקְרָ֣א י֭וֹמָם וְלֹ֣א תַעֲנֶ֑ה וְ֝לַ֗יְלָה וְֽלֹא־דֽוּמִיָּ֥ה לִֽי׃ דוְאַתָּ֥ה קָד֑וֹשׁ י֝וֹשֵׁ֗ב תְּהִלּ֥וֹת יִשְׂרָאֵֽל׃ הבְּ֭ךָ בָּטְח֣וּ אֲבֹתֵ֑ינוּ בָּ֝טְח֗וּ וַֽתְּפַלְּטֵֽמוֹ׃ ואֵלֶ֣יךָ זָעֲק֣וּ וְנִמְלָ֑טוּ בְּךָ֖ בָטְח֣וּ וְלֹא־בֽוֹשׁוּ׃ זוְאָנֹכִ֣י תוֹלַ֣עַת וְלֹא־אִ֑ישׁ חֶרְפַּ֥ת אָ֝דָ֗ם וּבְז֥וּי עָֽם׃ חכָּל־רֹ֭אַי יַלְעִ֣גוּ לִ֑י יַפְטִ֥ירוּ בְ֝שָׂפָ֗ה יָנִ֥יעוּ רֹֽאשׁ׃ טגֹּ֣ל אֶל־יְהוָ֣ה יְפַלְּטֵ֑הוּ יַ֝צִּילֵ֗הוּ כִּ֘י חָ֥פֵֽץ בּֽוֹ׃ יכִּֽי־אַתָּ֣ה גֹחִ֣י מִבָּ֑טֶן מַ֝בְטִיחִ֗י עַל־שְׁדֵ֥י אִמִּֽי׃ יאעָ֭לֶיךָ הָשְׁלַ֣כְתִּי מֵרָ֑חֶם מִבֶּ֥טֶן אִ֝מִּ֗י אֵ֣לִי אָֽתָּה׃ יבאַל־תִּרְחַ֣ק מִ֭מֶּנִּי כִּי־צָרָ֣ה קְרוֹבָ֑ה כִּי־אֵ֥ין עוֹזֵֽר׃ יגסְ֭בָבוּנִי פָּרִ֣ים רַבִּ֑ים אַבִּירֵ֖י בָשָׁ֣ן כִּתְּרֽוּנִי׃ ידפָּצ֣וּ עָלַ֣י פִּיהֶ֑ם אַ֝רְיֵ֗ה טֹרֵ֥ף וְשֹׁאֵֽג׃ טוכַּמַּ֥יִם נִשְׁפַּכְתִּי֮ וְהִתְפָּֽרְד֗וּ כָּֽל־עַצְמ֫וֹתָ֥י הָיָ֣ה לִ֭בִּי כַּדּוֹנָ֑ג נָ֝מֵ֗ס בְּת֣וֹךְ מֵעָֽי׃ טזיָ֘בֵ֤שׁ כַּחֶ֨רֶשׂ ׀ כֹּחִ֗י וּ֭לְשׁוֹנִי מֻדְבָּ֣ק מַלְקוֹחָ֑י וְֽלַעֲפַר־מָ֥וֶת תִּשְׁפְּתֵֽנִי׃ יזכִּ֥י סְבָב֗וּנִי כְּלָ֫בִ֥ים עֲדַ֣ת מְ֭רֵעִים הִקִּיפ֑וּנִי כָּ֝אֲרִ֗י יָדַ֥י וְרַגְלָֽי׃ יחאֲסַפֵּ֥ר כָּל־עַצְמוֹתָ֑י הֵ֥מָּה יַ֝בִּ֗יטוּ יִרְאוּ־בִֽי׃ יטיְחַלְּק֣וּ בְגָדַ֣י לָהֶ֑ם וְעַל־לְ֝בוּשִׁ֗י יַפִּ֥ילוּ גוֹרָֽל׃ כוְאַתָּ֣ה יְ֭הוָה אַל־תִּרְחָ֑ק אֱ֝יָלוּתִ֗י לְעֶזְרָ֥תִי חֽוּשָׁה׃ כאהַצִּ֣ילָה מֵחֶ֣רֶב נַפְשִׁ֑י מִיַּד־כֶּ֝֗לֶב יְחִידָתִֽי׃ כבה֭וֹשִׁיעֵנִי מִפִּ֣י אַרְיֵ֑ה וּמִקַּרְנֵ֖י רֵמִ֣ים עֲנִיתָֽנִי׃ כגאֲסַפְּרָ֣ה שִׁמְךָ֣ לְאֶחָ֑י בְּת֖וֹךְ קָהָ֣ל אֲהַלְלֶֽךָּ׃ כדיִרְאֵ֤י יְהוָ֨ה ׀ הַֽלְל֗וּהוּ כָּל־זֶ֣רַע יַעֲקֹ֣ב כַּבְּד֑וּהוּ וְג֥וּרוּ מִ֝מֶּ֗נּוּ כָּל־זֶ֥רַע יִשְׂרָאֵֽל׃ כהכִּ֤י לֹֽא־בָזָ֨ה וְלֹ֪א שִׁקַּ֡ץ עֱנ֬וּת עָנִ֗י וְלֹא־הִסְתִּ֣יר פָּנָ֣יו מִמֶּ֑נּוּ וּֽבְשַׁוְּע֖וֹ אֵלָ֣יו שָׁמֵֽעַ׃ כומֵ֥אִתְּךָ֗ תְֽהִלָּ֫תִ֥י בְּקָהָ֥ל רָ֑ב נְדָרַ֥י אֲ֝שַׁלֵּ֗ם נֶ֣גֶד יְרֵאָֽיו׃ כזיֹאכְל֬וּ עֲנָוִ֨ים ׀ וְיִשְׂבָּ֗עוּ יְהַֽלְל֣וּ יְ֭הוָה דֹּ֣רְשָׁ֑יו יְחִ֖י לְבַבְכֶ֣ם לָעַֽד׃ כחיִזְכְּר֤וּ ׀ וְיָשֻׁ֣בוּ אֶל־יְ֭הוָה כָּל־אַפְסֵי־אָ֑רֶץ וְיִֽשְׁתַּחֲו֥וּ לְ֝פָנֶ֗יךָ כָּֽל־מִשְׁפְּח֥וֹת גּוֹיִֽם׃ כטכִּ֣י לַ֭יהוָה הַמְּלוּכָ֑ה וּ֝מֹשֵׁ֗ל בַּגּוֹיִֽם׃ לאָכְל֬וּ וַיִּֽשְׁתַּחֲוּ֨וּ ׀ כָּֽל־דִּשְׁנֵי־אֶ֗רֶץ לְפָנָ֣יו יִ֭כְרְעוּ כָּל־יוֹרְדֵ֣י עָפָ֑ר וְ֝נַפְשׁ֗וֹ לֹ֣א חִיָּֽה׃ לאזֶ֥רַע יַֽעַבְדֶ֑נּוּ יְסֻפַּ֖ר לַֽאדֹנָ֣י לַדּֽוֹר׃ לביָ֭בֹאוּ וְיַגִּ֣ידוּ צִדְקָת֑וֹ לְעַ֥ם נ֝וֹלָ֗ד כִּ֣י עָשָֽׂה׃",
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
              style: GoogleFonts.suezOne(fontSize: 24),
            ));
      }
      switch(TODAY.weekday){
        case DateTime.sunday:
          return Padding(
              padding: const EdgeInsets.all(8.0),
              child: Text(
                " לְדָוִד מִזְמור. לה' הָאָרֶץ וּמְלואָהּ. תֵּבֵל וְישְׁבֵי בָהּ: כִּי הוּא עַל יַמִּים יְסָדָהּ. וְעַל נְהָרות יְכונְנֶהָ: מִי יַעֲלֶה בְהַר ה'. וּמִי יָקוּם בִּמְקום קָדְשׁו: נְקִי כַפַּיִם וּבַר לֵבָב. אֲשֶׁר לא נָשא לַשָּׁוְא נַפְשִׁי וְלא נִשְׁבַּע לְמִרְמָה: יִשּא בְרָכָה מֵאֵת ה'. וּצְדָקָה מֵאֱלהֵי יִשְׁעו: זֶה דּור דּרְשָׁיו. מְבַקְשֵׁי פָנֶיךָ יַעֲקב סֶלָה: שאוּ שְׁעָרִים רָאשֵׁיכֶם וְהִנָּשאוּ פִּתְחֵי עולָם. וְיָבוא מֶלֶךְ הַכָּבוד: מִי זֶה מֶלֶךְ הַכָּבוד. ה' עִזּוּז וְגִבּור. ה' גִּבּור מִלְחָמָה: שאוּ שְׁעָרִים רָאשֵׁיכֶם וּשאוּ פִּתְחֵי עולָם. וְיָבא מֶלֶךְ הַכָּבוד: מִי הוּא זֶה מֶלֶךְ הַכָּבוד. ה' צְבָאות הוּא מֶלֶךְ הַכָּבוד. סֶלָה:",
                textAlign: TextAlign.justify,
                textDirection: TextDirection.rtl,
                style: GoogleFonts.suezOne(fontSize: 24),
              ));
        case DateTime.monday:
          return Padding(
              padding: const EdgeInsets.all(8.0),
              child: Text(
                "שִׁיר מִזְמור לִבְנֵי קרַח: גָּדול ה' וּמְהֻלָּל מְאד בְּעִיר אֱלהֵינוּ הַר קָדְשׁו: יְפֵה נוף מְשוש כָּל הָאָרֶץ. הַר צִיּון יַרְכְּתֵי צָפון. קִרְיַת מֶלֶךְ רָב: אֱלהִים בְּאַרְמְנותֶיהָ נודַע לְמִשגָּב: כִּי הִנֵּה הַמְּלָכִים נועֲדוּ. עָבְרוּ יַחְדָּו: הֵמָּה רָאוּ כֵּן תָּמָהוּ. נִבְהֲלוּ נֶחְפָּזוּ: רְעָדָה אֲחָזָתַם שָׁם. חִיל כַּיּולֵדָה: בְּרוּחַ קָדִים תְּשַׁבֵּר אֳנִיּות תַּרְשִׁישׁ: כַּאֲשֶׁר שָׁמַעְנוּ כֵּן רָאִינוּ בְּעִיר ה' צְבָאות בְּעִיר אֱלהֵינוּ. אֱלהִים יְכונְנֶהָ עַד עולָם סֶלָה: דִּמִּינוּ אֱלהִים חַסְדֶּךָ בְּקֶרֶב הֵיכָלֶךָ: כְּשִׁמְךָ אֱלהִים כֵּן תְּהִלָּתְךָ עַל קַצְוֵי אֶרֶץ. צֶדֶק מָלְאָה יְמִינֶךָ: יִשמַח הַר צִיּון. תָּגֵלְנָה בְּנות יְהוּדָה. לְמַעַן מִשְׁפָּטֶיךָ: סבּוּ צִיּון וְהַקִּיפוּהָ. סִפְרוּ מִגְדָּלֶיהָ: שִׁיתוּ לִבְּכֶם לְחֵילָה. פַּסְּגוּ אַרְמְנותֶיהָ. לְמַעַן תְּסַפְּרוּ לְדור אַחֲרון: כִּי זֶה אֱלהִים אֱלהֵינוּ עולָם וָעֶד. הוּא יְנַהֲגֵנוּ עַל מוּת:",
                textAlign: TextAlign.justify,
                textDirection: TextDirection.rtl,
                style: GoogleFonts.suezOne(fontSize: 24),
              ));
        case DateTime.tuesday:
          return Padding(
              padding: const EdgeInsets.all(8.0),
              child: Text(
                "מִזְמור לְאָסָף. אֱלהִים נִצָּב בַּעֲדַת אֵל. בְּקֶרֶב אֱלהִים יִשְׁפּט: עַד מָתַי תִּשְׁפְּטוּ עָוֶל. וּפְנֵי רְשָׁעִים תִּשאוּ סֶלָה: שִׁפְטוּ דָל וְיָתום. עָנִי וָרָשׁ הַצְדִּיקוּ: פַּלְּטוּ דַל וְאֶבְיון. מִיַּד רְשָׁעִים הַצִּילוּ: לא יָדְעוּ וְלא יָבִינוּ בַּחֲשֵׁכָה יִתְהַלָּכוּ. יִמּוטוּ כָּל מוסְדֵי אָרֶץ: אֲנִי אָמַרְתִּי אֱלהִים אַתֶּם. וּבְנֵי עֶלְיון כֻּלְּכֶם: אָכֵן כְּאָדָם תְּמוּתוּן. וּכְאַחַד הַשּרִים תִּפּלוּ: קוּמָה אֱלהִים שָׁפְטָה הָאָרֶץ. כִּי אַתָּה תִנְחַל בְּכָל הַגּויִם:",
                textAlign: TextAlign.justify,
                textDirection: TextDirection.rtl,
                style: GoogleFonts.suezOne(fontSize: 24),
              ));
        case DateTime.wednesday:
          return Padding(
              padding: const EdgeInsets.all(8.0),
              child: Text(
                "אֵל נְקָמות ה'. אֵל נְקָמות הופִיעַ: הִנָּשא שׁפֵט הָאָרֶץ. הָשֵׁב גְּמוּל עַל גֵּאִים: עַד מָתַי רְשָׁעִים ה'. עַד מָתַי רְשָׁעִים יַעֲלזוּ: יַבִּיעוּ יְדַבְּרוּ עָתָק. יִתְאַמְּרוּ כָּל פּעֲלֵי אָוֶן: עַמְּךָ ה' יְדַכְּאוּ. וְנַחֲלָתְךָ יְעַנּוּ: אַלְמָנָה וְגֵר יַהֲרגוּ וִיתומִים יְרַצֵּחוּ: וַיּאמְרוּ לא יִרְאֶה יָּהּ. וְלא יָבִין אֱלהֵי יַעֲקב: בִּינוּ בּעֲרִים בָּעָם. וּכְסִילִים מָתַי תַּשכִּילוּ: הֲנטַע אזֶן הֲלא יִשְׁמָע. אִם יצֵר עַיִן הֲלא יַבִּיט: הֲיסֵר גּויִם הֲלא יוכִיחַ. הַמְלַמֵּד אָדָם דָּעַת: ה' ידֵעַ מַחְשְׁבות אָדָם. כִּי הֵמָּה הָבֶל: אַשְׁרֵי הַגֶּבֶר אֲשֶׁר תְּיַסְּרֶנּוּ יָּהּ. וּמִתּורָתְךָ תְלַמְּדֶנּוּ: לְהַשְׁקִיט לו מִימֵי רָע. עַד יִכָּרֶה לָרָשָׁע שָׁחַת: כִּי לא יִטּשׁ ה' עַמּו. וְנַחֲלָתו לא יַעֲזב: כִּי עַד צֶדֶק יָשׁוּב מִשְׁפָּט. וְאַחֲרָיו כָּל יִשְׁרֵי לֵב: מִי יָקוּם לִי עִם מְרֵעִים. מִי יִתְיַצֵּב לִי עִם פּעֲלֵי אָוֶן: לוּלֵי ה' עֶזְרָתָה לִּי כִּמְעַט שָׁכְנָה דוּמָה נַפְשִׁי: אִם אָמַרְתִּי מָטָה רַגְלִי. חַסְדְּךָ ה' יִסְעָדֵנִי: בְּרב שרְעַפַּי בְּקִרְבִּי תַּנְחוּמֶיךָ יְשַׁעַשְׁעוּ נַפְשִׁי: הַיְחָבְרְךָ כִּסֵּא הַוּות. יצֵר עָמָל עֲלֵי חק: יָגודּוּ עַל נֶפֶשׁ צַדִּיק וְדָם נָקִי יַרְשִׁיעוּ: וַיְהִי ה' לִי לְמִשגָּב. וֵאלהַי לְצוּר מַחְסִי: וַיָּשֶׁב עֲלֵיהֶם אֶת אונָם וּבְרָעָתָם יַצְמִיתֵם. יַצְמִיתֵם ה' אֱלהֵינוּ: לְכוּ נְרַנְּנָה לה'. נָרִיעָה לְצוּר יִשְׁעֵנוּ: נְקַדְּמָה פָנָיו בְּתודָה. בִּזְמִירות נָרִיעַ לו: כִּי אֵל גָּדול ה' וּמֶלֶךְ גָּדול עַל כָּל אֱלהִים:",
                textAlign: TextAlign.justify,
                textDirection: TextDirection.rtl,
                style: GoogleFonts.suezOne(fontSize: 24),
              ));
        case DateTime.thursday:
          return Padding(
              padding: const EdgeInsets.all(8.0),
              child: Text(
                "לַמְנַצֵּחַ עַל הַגִּתִּית לְאָסָף: הַרְנִינוּ לֵאלהִים עוּזֵּנוּ. הָרִיעוּ לֵאלהֵי יַעֲקב: שאוּ זִמְרָה וּתְנוּ תף. כִּנּור נָעִים עִם נָבֶל: תִּקְעוּ בַחדֶשׁ שׁופָר. בַּכֶּסֶה לְיום חַגֵּנוּ: כִּי חק לְיִשרָאֵל הוּא. מִשְׁפָּט לֵאלהֵי יַעֲקב: עֵדוּת בִּיהוסֵף שמו. בְּצֵאתו עַל אֶרֶץ מִצְרָיִם. שפַת לא יָדַעְתִּי אֶשְׁמָע: הֲסִירותִי מִסֵּבֶל שִׁכְמו. כַּפָּיו מִדּוּד תַּעֲברְנָה: בַּצָּרָה קָרָאתָ וָאֲחַלְּצֶךָּ. אֶעֶנְךָ בְּסֵתֶר רַעַם. אֶבְחָנְךָ עַל מֵי מְרִיבָה סֶלָה: שְׁמַע עַמִּי וְאָעִידָה בָּךְ. יִשרָאֵל אִם תִּשְׁמַע לִי: לא יִהְיֶה בְךָ אֵל זָר. וְלא תִשְׁתַּחֲוֶה לְאֵל נֵכָר: אָנכִי ה' אֱלהֶיךָ הַמַּעַלְךָ מֵאֶרֶץ מִצְרָיִם. הַרְחֶב פִּיךָ וַאֲמַלְאֵהוּ: וְלא שָׁמַע עַמִּי לְקולִי וְיִשרָאֵל לא אָבָה לִי: וָאֲשַׁלְּחֵהוּ בִּשְׁרִירוּת לִבָּם. יֵלְכוּ בְּמועֲצותֵיהֶם: לוּ עַמִּי שׁמֵעַ לִי. יִשרָאֵל בִּדְרָכַי יְהַלֵּכוּ: כִּמְעַט. אויְבֵיהֶם אַכְנִיעַ. וְעַל צָרֵיהֶם אָשִׁיב יָדִי: מְשנְאֵי ה' יְכַחֲשׁוּ לו. וִיהִי עִתָּם לְעולָם: וַיַּאֲכִילֵהוּ מֵחֵלֶב חִטָּה. וּמִצּוּר דְּבַשׁ אַשְׂבִּיעֶךָ:",
                textAlign: TextAlign.justify,
                textDirection: TextDirection.rtl,
                style: GoogleFonts.suezOne(fontSize: 24),
              ));
        case DateTime.friday:
          return Padding(
              padding: const EdgeInsets.all(8.0),
              child: Text(
                "ה' מָלָךְ גֵּאוּת לָבֵשׁ. לָבֵשׁ ה' עז הִתְאַזָּר. אַף תִּכּון תֵּבֵל בַּל תִּמּוט: נָכון כִּסְאֲךָ מֵאָז. מֵעולָם אָתָּה: נָשאוּ נְהָרות ה'. נָשאוּ נְהָרות קולָם. יִשאוּ נְהָרות דָּכְיָם: מִקּלות מַיִם רַבִּים אַדִּירִים מִשְׁבְּרֵי יָם. אַדִּיר בַּמָּרום ה': עֵדתֶיךָ נֶאֶמְנוּ מְאד. לְבֵיתְךָ נָאֲוָה קדֶשׁ. ה' לְארֶךְ יָמִים:",
                textAlign: TextAlign.justify,
                textDirection: TextDirection.rtl,
                style: GoogleFonts.suezOne(fontSize: 24),
              ));
        default: return Container();
      }
    }
  }

}